[
    {
        "id": 185409149,
        "title": "I saw Strictly Live and this is why it is the best show in town",
        "text": "This year, the cast looked genuinely touched by the reception from a crowd which was raring to go from the off. First up was Channel 4 newsreader Krishnan Guru-Murthy, with professional partner Jowita Przystal, likened to ‘Jack and Victor doing the slosh’ by Mr Nasty judge (and the show’s director), Craig Revel Horwood, to the delight of the audience. From that point on, no joke was too cheesy, no Scottish reference too cliched, it was just non-stop fun, glamour and hilarity. (That Barbie group dance? There are no words.) The Barbie group dance was a hit (Image: Marc Brenner) The judges were in a particularly giddy mood, with stylish host Janette Manrara having to sternly rein them in on more than one occasion. Anton du Beke, in particular, wittered on charmingly about everything from his sporran to hair transplants and hip replacements. For a confusing moment, it seemed Shirley Ballas was about to deliver a topical Glasgow culture joke when she announced she had become a ‘glam-mother’ with the birth of her new grandson. “He is called Banksi,” she said, proudly. The crowd waited for the punchline, but this is, in fact, true – little Banksi-with-an-i-Wylde-with-a-y-Ballas was born late last year – and nothing to do with THAT exhibition which created a stir in the city last year. Series winner Ellie Leach and her partner Vito Coppola dazzled in the paso doble and the American smooth, while fellow finalist and nation’s sweetheart Bobby Brazier instantly charmed the audience with his hip-shaking samba and glorious Viennese waltz alongside partner Dianne Buswell. Bobby Brazier and Dianne Buswell (Image: Marc Brenner) Loudest roars of the evening were delivered to the mighty Layton Williams and Nikita Kuzmin, whose quickstep to Puttin’ on the Ritz didn’t need the multiple backflips to be a sure-fire crowd pleaser; Angela Rippon’s reprise of the “leg extension which broke the internet” amid her cha-cha with Kai Widdrington; and the sultry Argentine Tango from Angela Scanlon and Carlos Gu which remains a thing of exquisite beauty. There was warmth for all the couples, however, especially Annabel Croft, dancing with Graziano di Prima instead of her TV partner Johannes Radebe, who is on his own tour, and Angela Scanlon, who was, kind of, our representative in the absence of any Scots in this year’s line-up. Angela Scanlon and Carlos Gu (Image: Marc Brenner) “I spotted plenty of wild-eyed redheads out about in Glasgow today, so I do feel like I’m home,” she grinned. The Strictly professionals at work (Image: Marc Brenner) Lobbying for votes, Angela Rippon explained she had Scottish roots (“my grandmother was born in Killiecrankie,” she said, adding apologetically, “and the family moved just up the road to Edinburgh”, while Krishnan, who revealed in the Glasgow Times that his first job was in the city, reminded the crowd of this, to great cheers. None of it mattered anyway, because Layton and Nikita took the title, their latest of many glitterballs on the tour so far. There were amazing performances from the live singers, backed by Allan Rogers and his band, and Janette was a witty, warm host. Strictly Live is the antidote to January’s gloom and god-awful weather, it’s joy wrapped up in candy-floss sprinkled with sequins, a slick, professional, big-arena version of the TV show for fans unable to win coveted seats in the Elstree audience. And on Friday night, for a joyful few hours, it belonged to Glasgow.",
        "url": "https://www.glasgowtimes.co.uk/news/24079651.saw-strictly-live-best-show-town/",
        "image": "http://www.glasgowtimes.co.uk/resources/images/17690015.jpg/",
        "publish_date": "2024-01-29 07:59:55",
        "author": "Ann Fotheringha, Toby Granville",
        "authors": [
            "Ann Fotheringha",
            "Toby Granville"
        ],
        "language": "en",
        "source_country": "gb",
        "sentiment": 0.462
    },
    {
        "id": 157594537,
        "title": "Minister Heydon leads Agri-Food Trade Mission to Malaysia and Philippines - MerrionStreet",
        "text": "“This is a significant two country trade mission where there are opportunities in both countries to grow the value of agri-food and agri-tech exports and deepen the relations between our countries. Malaysia has a sophisticated domestic market and is emerging in importance for Irish producers, particularly in the dairy sector, while Ireland and the Philippines have long historic links between its peoples and an increasing level of trade. “This will be the first ever Irish agri-food trade mission to the Philippines and I look forward to working with counterparts on the ground in both counties to further develop markets there. Two thirds of global economic growth both now and into the future will come in the Asia Pacific region. With populations of 33 and 144 million in Malaysia and the Philippines respectively, coupled with their growing middle classes, these are markets which have been identified as having significant potential for our high quality, safe and sustainable Irish agri-food produce.” “It is vital that trade is mutually beneficial. Therefore, my focus on this Trade Mission is twofold; to support our export sector in new market development while sharing expertise on safe, sustainable food systems and how we can work together with our hosts to promote the further development of these systems in both countries.” “Malaysia and the Philippines have been identified through Bord Bia’s market prioritisation study as key markets for dairy and meat. These markets are import-dependent, so this trade mission gives us the perfect opportunity to raise the profile of the Irish food industry. We know from experience that it is vital for companies to develop trade relationships, learn the market dynamics and to be guided by the best consumer and market insight. Our main goal on this trade mission is to build awareness of Ireland as a source of safe and sustainably produced dairy, to enhance our understanding of the meat market and to create further commercial opportunities for Irish exporters.”",
        "url": "https://merrionstreet.ie/en/News-Room/News/minister_heydon_leads_major_agri-food_trade_mission_to_malaysia_and_philippines.176421.shortcut.html",
        "image": "https://merrionstreet.ie/merrionstreet/famine.png",
        "publish_date": "2023-11-06 13:39:44",
        "author": "Minister McEntee",
        "authors": [
            "Minister McEntee"
        ],
        "language": "en",
        "source_country": "ie",
        "sentiment": 0.555
    },
    {
        "id": 158982075,
        "title": "Screen Queen reviews: A Murder at the End of the World, Scrublands, The Buccaneers & The Curse",
        "text": "The West Australian Perth Now Click to open navigation ‌‌ News Chevron Down Icon Breaking News Western Australia National World Technology Opinion Weather Sport Chevron Down Icon AFL Cricket Soccer Basketball Tennis NRL Rugby Motor Racing MMA Golf Netball Cycling Entertainment Chevron Down Icon Confidential Movies Best Short Film Television Music Reviews Books Competitions Business Chevron Down Icon Breaking News Economy Markets Property Commercial Property Workplace Matters Lifestyle Chevron Down Icon Food Personal Finance Health Parenting Fashion Travel Home & Garden Relationships Stars Real Estate HUH? Local News Chevron Down Icon North Central South Mandurah Competitions Find My Paper Digital Editions Shop Now Read your local paperNews to your inbox Confidential Movies Best Short Film Television Music Reviews Books Competitions Camera IconA Murder at the End of the World is coming to Disney Plus. Credit: Supplied/Disney Plus review Screen Queen reviews: A Murder at the End of the World, Scrublands, The Buccaneers & The Curse Clare RigdenSTM November 12, 2023 2:00AM Comments TopicsTVTV Reviews A Murder at the End of the World Tuesday, streaming on Disney Plus As a kid, I was obsessed with Nancy Drew books, though, truth be told, I never particularly liked them. They always felt too tame, the mysteries too neatly wrapped up for my curious 10-year-old brain. I was always left wanting more. My fascination with young female detectives was reignited with Veronica Mars. Kristin Bell’s high school detective felt like the Nancy Drew I’d longed for in my youth, and I lapped it up. In the years since I’ve been hunting for something to fill that space, and I think I may have found it with this great new murder mystery. It stars Emma Corrin as gen Z amateur sleuth and tech-savvy hacker Darby Hart. In this beautifully shot, moody-as-heck series (which also has a fabulous soundtrack, full of Portishead, Annie Lennox and Grimes), Darby and eight other guests are invited by a reclusive billionaire (Clive Owen, who appears to be channelling Elon Musk) to participate in a retreat at a remote Icelandic location. So far, so Glass Onion, right? Kinda. But not really. Not long after Darby rocks up, a guest is found dead, and like that great Netflix whodunnit, it can only be someone at the retreat. The audience is left to try to piece it together, and Darby’s right at the centre of the mystery. This intriguing and addictive series is Mr Robot meets The Girl with the Dragon Tattoo meets Silo, and if that hasn’t persuaded you to watch it, nothing will. Welcome to your new TV obsession. Scrublands Thursday, streaming on StanCamera IconLuke Arnold plays Martin Scarsden in this addictive whodunnit. Credit: Sarah Enticknap/Stan While we’re talking addictive whodunnits, this fantastic Aussie series drops this week and I’m equally invested. It features Black Sails star Luke Arnold playing a journalist dispatched to a small town to do a puff piece on how the residents are faring a year on from a horrific incident, which saw their local priest open fire on his congregation. He quickly discovers there’s a whole lot more to the story. This is top-shelf Aussie drama, beautifully realised on screen. More, please! The Buccaneers Streaming now on Apple TV Plus Your cookie settings are preventing this third party content from displaying. If you’d like to view this content, please adjust your Cookie Settings. To find out more about how we use cookies, please see our Cookie Guide. This revisionist historical romantic comedy feels like I’ve seen it all before. Because I have — Shonda Rhimes did it over on Netflix. But who cares: this modern reimagining of Edith Wharton’s unfinished novel is such good fun, you’ll likely love it too. The Curse Streaming now, Paramount PlusCamera IconThe Curse is coming to Paramount Plus. Credit: Beth Garrabrant/A24/Paramount+ with Showtime I can’t watch anything with Nathan Fielder in it without squirming with second-hand embarrassment. This drama is no exception. It explores an alleged “curse” put on a man (Fielder) and the effect it has on his relationship with his new bride, played by Emma Stone (she’s terrific). This is every bit as strange and uncomfortable to watch as you would want/expect. Pamela’s Garden of Eden Friday, streaming on Binge Your cookie settings are preventing this third party content from displaying. If you’d like to view this content, please adjust your Cookie Settings. To find out more about how we use cookies, please see our Cookie Guide. I fell in love with this under-the-radar reality series, starring Pamela Anderson in her hippie era, last year. I’m thrilled it’s back for a second series, and I can’t wait to find out how Pammy’s life has changed after the astonishing 12 months she’s just had. Share to Facebook Share to Twitter Email Us Copy the Link Register and have your say. Register to comment Already have an account? Log in Saturday December 2The 2023 Alinta Energy Christmas Pageant is returning to St Georges Terrace! Watch the city come alive through sparkling floats and a spectacular parade. From around the site Ouch!Summer’s on the way - and so are the NASTY bites and stings New appearance ‘What happened?’: Zac Efron’s new look leaves fans worried No pressure mate!The ONE rule OnlyFans star Annie Knight has for boyfriend Water an awardSurprising place you’ll find WA’s best tap water revealed Comments Your Local News Share to TwitterShare to FacebookShare to InstagramShare to YoutubeEmail UsGet Digital Edition Saturday December 2The 2023 Alinta Energy Christmas Pageant is returning to St Georges Terrace! Watch the city come alive through sparkling floats and a spectacular parade. Perth Now Email UsNewsletter Chevron Down IconSubmit story tip Camera IconSubmit photos Get Digital EditionDigital edition Chevron Down IconBack to top Follow Us Share to FacebookShare to TwitterShare to InstagramShare to YoutubeGet Digital EditionEmail Us About Us Contact Us Careers Letter to the Editor Place an Ad Privacy Policy Code of Conduct Editorial Complaints Terms of Use Cookie Settings © West Australian Newspapers Limited 2023 News Sport Entertainment Business Lifestyle Shop Now Privacy Policy Code of Conduct Editorial Complaints Terms of Use Cookie Settings Subscribe to the Paper Read your PerthNow Local Newspaper Advertise on PerthNow Our Partners Real Estate View Healthengine Huddle Insurance Carbar CarExpert Raiz Invest Institchu Starts at 60 MoneyMe Iseekplant The West Australian 7plus 7NEWS TV Guide",
        "url": "https://www.perthnow.com.au/entertainment/tv/screen-queen-reviews-a-murder-at-the-end-of-the-world-scrublands-the-buccaneers-the-curse-c-12459010",
        "image": "https://images.perthnow.com.au/publication/C-12459010/3d83f050c2a039384bbdf4bb331204c1d42c758e-16x9-x0y0w3823h2150.jpg?imwidth=1200",
        "publish_date": "2023-11-11 19:00:00",
        "author": "Clare Rigden, Clare RigdenSTMNo",
        "authors": [
            "Clare Rigden",
            "Clare RigdenSTMNo"
        ],
        "language": "en",
        "source_country": "au",
        "sentiment": 0.651
    },
    {
        "id": 193400349,
        "title": "Margot Robbie makes an ’80s Barbie statement on the SAG Awards 2024 red carpet",
        "text": "Barbie meets the SAGs. Margot Robbie wore her best pink attire to hit the SAG Awards 2024 red carpet in Los Angeles Saturday, wearing a very ’80s black-and-pink mini from Schiaparelli’s fall/winter 2020 couture collection. The 33-year-old actress, who plays the titular role in Greta Gerwig’s hit flick, delivered plenty of glam vibes in her fun ‘fit, which featured a piece of pink fabric that tied around her waist and formed a massive flounce at her shoulder, finishing off in a dramatic train. She styled her hair in a perfect doll-like ‘do with beachy waves, adding dazzling Lorraine Schwartz jewels including a diamond anklet and sparkling statement earrings. While she didn’t appear to be channeling a specific Barbie on Saturday, 1984’s “Dream Date” doll features a very similar pink shoulder flounce. This is far from the first Barbie recreation Robbie has worn on the red carpet this awards season, with the star rocking a seriously pink gown in honor of Superstar Barbie to the Golden Globes in January. And while it wasn’t a direct copy of a Mattel look, she didn’t forget her pink at the BAFTAs last week, sporting a chic pale pink-and-black Armani Privé gown to the British awards ceremony. For more Page Six Style … See the best celebrity looks of the week in our new series, “Instantly Iconic Style” Browse the best fashion and beauty products, according to celebs Shop our exclusive merch Of course, she’s sported many other Barbie ‘fits over the past year as she’s promoted the movie, ranging from colorful minidresses to glam pink evening gowns. Although Robbie was snubbed for an Oscars 2024 nomination, she earned a best actress nod at the SAG Awards, and Oscar nominee Ryan Gosling, who plays Ken, is up for best supporting actor. “Barbie” is nominated for four awards in total at the annual ceremony, with the hit movie also nominated for best cast and an award for stunt ensemble performances. As for the Academy Awards, watch this space for her next — and possibly last — dazzling doll moment.",
        "url": "https://pagesix.com/2024/02/24/style/margot-robbie-makes-an-80s-barbie-statement-on-the-sag-awards-2024-red-carpet/",
        "image": "https://pagesix.com/wp-content/uploads/sites/3/2024/02/77128647.jpg?quality=75&strip=all&w=1200",
        "publish_date": "2024-02-25 02:06:30",
        "author": "Kristin Contino",
        "authors": [
            "Kristin Contino"
        ],
        "language": "en",
        "source_country": "us",
        "sentiment": 1.0
    },
    {
        "id": 193265277,
        "title": "EU to pay first €4.5 bln to Ukraine under new 50-bln aid program in March",
        "text": "BRUSSELS, February 24. /TASS/. The EU intends to pay the first 4.5 billion euros to Ukraine under the new 50-billion aid program that Brussels approved on February 1 in March, European Commission President Ursula von der Leyen said during her visit to Kiev. \"We discussed next steps on the €50 billion Ukraine Facility. The 1st payment of €4.5 bn will come in March,\" she said on her X page.",
        "url": "https://tass.com/world/1751123",
        "image": "https://tass.com/img/blocks/common/tass_logo_share_ru.png",
        "publish_date": "2024-02-24 14:48:15",
        "authors": [],
        "language": "en",
        "source_country": "ru",
        "sentiment": 0.63
    },
    {
        "id": 192081935,
        "title": "Son of former YouTube CEO Susan Wojcicki remembered as 'incredibly intelligent' student destined for greatness",
        "text": "The son of former YouTube CEO Susan Wojcicki who was found dead inside his dorm at the University of California, Berkeley, was remembered by some of his educators as an “incredibly intelligent” mathematician and leader who had ideas on how to use AI and nanotechnologies to cure cancer. Marco Troper, 19, who was found unresponsive last Tuesday of what his grandmother believes was a suspected drug overdose, received a heartfelt tribute from Professor Freedom Cheteni, who served as a mentor to Troper and his cousins when they were middle schoolers. “With profound sadness, my most extraordinary moonshot kid, Marco Troper whose light, leadership and love will never diminish unexpectedly died,” Cheteni wrote. “Marco and I were working on his most inspiring idea to cure cancer leveraging nanotechnologies and Ai the last six years,” he added alongside several photos and videos of a young Troper and his cousins. The dean of Gideon Hausner Jewish Day School, where Troper was a student before starting college this past fall, shared some of his successes with SFGate, including how he led the school’s hackathon and served as a tutor to other students. “He was incredibly intelligent, curious, and creative—often showing up to class and community events with a bright smile and an infectious energy, said school head Than Healy. Healy goes on to describe Troper as “an avid mathematician and computer scientist, he relished tackling challenging problems.” His grandmother Esther Wojcicki also said he was destined for greatness. “He was everything you could have wished for in a son and a grandson,” Esther Wojcicki told SFGate. “He was destined to make a difference, it’s heartbreaking.” Police found no signs of foul play at the scene, leading Wojcicki, who is often referred to as the “Godmother of Silicon Valley” to believe the teen died from a suspected drug overdose. “Kids in college, especially freshmen and sophomores, experiment with everything. I think this was an experiment that went wrong,” she told the Palo Alto Daily Post. Wojcicki remembered her grandson as “the most kind, loving, smart, fun and beautiful human being” in a touching tribute shared online. “Our family is devastated beyond comprehension,” Wojcicki wrote in a post on Facebook Wednesday. Troper, a promising math major, was in his second semester at UC Berkeley and a member of the Zeta Psi fraternity. His grandmother described him as an “all-around athlete” who enjoyed playing all kinds of sports. “Marco’s life was cut too short,” Wojcicki added. “We are all devastated, thinking about all the opportunities and life experiences that he will miss and we will miss together.” A toxicology report to confirm Troper’s cause of death will take up to 30 days, Susan Wojcicki married her husband David Troper in 1998 and they share five children. She was appointed CEO of the famed video platform in 2014 and named one of Time Magazine’s 100 most influential people the following year. Susan Wojcicki resigned from her position — and 25 years with the company — in Feb. 2023 to “start a new chapter focused on my family, health, and personal projects.”",
        "url": "https://nypost.com/2024/02/20/us-news/tributes-pour-in-for-son-of-former-youtube-ceo-susan-wojcicki/",
        "image": "https://nypost.com/wp-content/uploads/sites/2/2024/02/76832745.jpg?quality=75&strip=all&w=1200",
        "publish_date": "2024-02-20 17:08:12",
        "author": "Isabel Keane",
        "authors": [
            "Isabel Keane"
        ],
        "language": "en",
        "source_country": "us",
        "sentiment": 0.419
    },
    {
        "id": 184711033,
        "title": "How new lefty slugger Michael Busch fits the Chicago Cubs’ offensive needs: ‘He’s going to get an opportunity’",
        "text": "Michael Busch’s whirlwind 72 hours brought him to Chicago, where he quickly got to know his new organization and Cubs fans. Busch, traded Thursday from the Los Angeles Dodgers to the Cubs as the headliner in a four-player deal, lauded the smooth transition amid his first taste of the fandom during the Cubs Convention. He even participated in the annual kids-only news conference alongside teammates Patrick Wisdom, Adbert Alzolay and Pete Crow-Armstrong. He deftly handled the kids’ hard-hitting questions that ranged from his favorite color (Cubbie red) to why he chose to wore No. 29 (liked it best among the numbers offered). He even broke out a couple of dance moves. “Thank God ‘The Griddy’ has been around a little bit so I had to do it a couple times before,” a smiling Busch said afterward. Only 26, Busch’s potential and power stroke could quickly turn him into a fan favorite. He gives the Cubs exactly what they needed this offseason: a left-handed power hitter who can play the corner infield positions. Busch is expected to primarily play first base but also possesses the flexibility to play multiple infield and outfield positions. Busch didn’t enter the offseason mentally preparing for a trade, instead focusing on each day and not worrying about things he can’t control. With the Dodgers moving Mookie Betts to second base for 2024, it further clogged the possibilities of regular at-bats in the majors after Busch appeared in 27 games last season in his first taste of the big leagues. “Going forward, I just try to take it one step at a time and the competition part of sports, I think is good for people,” Busch said. “No matter who you are, what you’ve done, just walking into the clubhouse to the locker room to the field every day with that mindset of just getting better that day. At the end of the day, all you can ask for as a player is the opportunity to get out there and show what you’ve been working for and working on the last few years.” Hitting coach Dustin Kelly represents a friendly face for Busch. During Kelly’s three years (2018-20) as a hitting coach in the Dodgers farm system, he worked with Busch, a 2019 first-round pick. When COVID-19 ended 2020 spring training prematurely, the Dodgers created small hitting groups, talking one to two times a week as well as Zoom calls for video sessions. Busch was among the hitters in Kelly’s group. From March until July, Kelly and Busch chatted roughly 10 times a month. After the minor-league season was canceled, Busch was part of the Dodgers’ alternate camp site where Kelly worked with the hitters. “Any time anybody that you know makes the big leagues, you’re super happy for them and proud of them,” Kelly told the Tribune on Saturday. “But there was a little extra special feeling for it just because we had spent so much time that year together.” Busch said his swing hasn’t changed a ton since he last worked with Kelly, though he figures it might have evolved a little over the last three years. “He’s adapted to every level,” Kelly said. “I think that’s what’s going to happen now in the big leagues is when he gets his opportunity to get some consistent at-bats, you’ll see him make some little changes with the velocity and pitch shapes and what everybody goes through. “But it’s such a compact, simple, repeatable swing that as a hitting coach, you just love to see guys like that. There’s not a ton of moving parts for things to go wrong, and he just has that natural ability to hit.” Busch hasn’t sacrificed his plate approach to sell out for power, posting a .431 on-base percentage in 469 plate appearances at Triple A in 2023. He was named the Pacific Coast League Most Valuable Player. Part of that success stems from a solid two-strike approach. Busch isn’t afraid to hit with two strikes and is willing to adjust in those spots as needed. He will need to keep his strikeout rate down, sitting at 33.3% in his small big-league sample size of 81 plate appearances. Kelly lauded Busch’s plate discipline and what he chooses to swing at in the strike zone. “He doesn’t chase a lot so like a lot of times that put you into some deeper counts at times because he doesn’t end the at-bat as early as some other guys might because they put the ball in play a little bit earlier,” Kelly said. “But he’ll take some of those borderline pitches. He’ll take some pitches that are in the zone and still strikes but maybe not necessarily what he was looking for and that’s just a testament to his maturity and really his confidence of what he can do. “We’re all confident that he can hit and he’s going to hit it at this level. There may be a little bit of an adjustment like there is for a lot of guys that get their feet wet in the big leagues, but he fits the profile exactly of what our offense needs.” The Cubs are expected to give Busch ample chances to be an everyday fixture in the lineup after he “conquered” the minors, manager Craig Counsell explained Saturday. It’s an ideal chance following the limited path to the majors in Los Angeles. “It’s time for him to get major-league at-bats,” Counsell said. “I mean, pressure, this is how it works, right? You’ve got to perform. Players want opportunities. He’s going to get an opportunity.” ()",
        "url": "https://www.bostonherald.com/2024/01/26/how-new-lefty-slugger-michael-busch-fits-the-chicago-cubs-offensive-needs-hes-going-to-get-an-opportunity-5/",
        "image": "https://www.bostonherald.com/wp-content/uploads/2024/01/202401141036TMS_____MNGTRPUB_SPORTS-HOW-NEW-LEFTY-SLUGGER-MICHAEL-BUSCH-3-TB5_8100a6.jpg?w=1024",
        "publish_date": "2024-01-26 19:29:43",
        "author": "Tribune News Service",
        "authors": [
            "Tribune News Service"
        ],
        "language": "en",
        "source_country": "us",
        "sentiment": 0.524
    },
    {
        "id": 163767607,
        "title": "Haier and Imbaco furnishers collaborations: IMARAT builders mall continues to elevate shopping experience – The Frontier Post",
        "text": "F.P. Report ISLAMABAD: IMARAT Builders Mall, the epitome of construction and interior shopping in the twin cities, proudly announces two significant collaborations that promise to redefine home living and interior spaces for its esteemed customers. In an exciting development, Pakistan’s biggest builders’ mall has inked strategic agreements with renowned brands Haier and Imbaco Furnishers, enriching its diverse portfolio of offerings. Located on GT Road Islamabad, IBM is ideally located to cater to residents of twin cities, especially those residing in the surrounding DHA. Haier: Elevating Homes with Cutting-Edge Appliances IMARAT Builders Mall is thrilled to welcome Haier, a global leader in home appliances, to its distinguished roster of partners. The collaboration with Haier marks a monumental step in providing customers with access to a comprehensive range of cutting-edge home appliances. The product line, featuring refrigerators, air conditioners, washing machines, microwaves, ovens, and Small Domestic Appliances (SDA), aligns perfectly with IMARAT Builders Mall’s commitment to delivering top-notch solutions for modern living. Shafiq Akbar, Chairman of IMARAT Group, expressed his enthusiasm about the collaboration, stating, “We are delighted to join hands with Haier, a brand synonymous with innovation and quality. This partnership allows us to enhance the shopping experience for our customers by offering state-of-the-art home appliances that cater to their evolving needs.” As IMARAT Builders Mall continues to evolve as the preferred destination for all construction and home-related needs, the addition of Haier to its portfolio underscores its dedication to providing a one-stop solution for customers seeking excellence in home living. Imbaco Furnishers: Transforming Spaces with Exceptional Furniture In another remarkable collaboration, IMARAT Builders Mall is proud to announce its partnership with Imbaco Furnishers, a trusted local name in furniture industry. Imbaco Furnishers specializes in offering a wide array of furniture, including pieces for offices, homes, interiors, and fabrics. This collaboration aims to provide customers with diverse choices and high-quality solutions for creating personalized and aesthetically pleasing living and working spaces. Farhan Javed, Group Director, shared his thoughts on the collaboration, saying, “Our association with Imbaco Furnishers reflects our commitment to curate a comprehensive collection for our customers. Imbaco’s expertise in providing quality furniture aligns seamlessly with our vision of making IMARAT Builders Mall the ultimate destination for all interior needs.” With these new collaborations, IMARAT Builders Mall continues to solidify its position as a hub for innovation and excellence in construction, home living, and interior solutions. The partnerships with Haier and Imbaco Furnishers promise to elevate the mall’s offerings, providing customers with unparalleled choices and exceptional quality for their homes and workspaces. The IMARAT Group looks forward to the positive impact these collaborations will have on enhancing the overall shopping experience for its valued patrons.",
        "url": "https://thefrontierpost.com/haier-and-imbaco-furnishers-collaborations-imarat-builders-mall-continues-to-elevate-shopping-experience/",
        "image": "https://thefrontierpost.com/wp-content/uploads/2023/11/bus-3-3.jpg",
        "publish_date": "2023-11-27 18:33:22",
        "author": "The Frontier Post",
        "authors": [
            "The Frontier Post"
        ],
        "language": "en",
        "source_country": "pk",
        "sentiment": 0.861
    },
    {
        "id": 177225345,
        "title": "AFCON-Bound Algeria Suffer Heavy 3-0 Defeat To Togo",
        "text": "Algeria, bound for AFCON 2023, endured a tough 3-0 loss against Togo in an exhilarating friendly match on Friday. Both teams displayed exceptional skills and determination, keeping the audience on the edge of their seats throughout the game. The match began with Togo showcasing their offensive prowess from the outset. Star striker James Thompson stole the spotlight with his remarkable speed and agility, creating numerous scoring opportunities for the West African side. However, Algeria’s defense proved to be a formidable barrier. According to reports by Time News Global, Togo managed to break through Algeria’s strong defense in the 35th minute. Midfielder Emmanuel Kofi skillfully dribbled past several defenders and netted a sensational goal, propelling his team into the lead. The stadium erupted in cheers as Togo celebrated their well-deserved advantage. Algeria fought back fiercely, refusing to surrender easily. Their standout player, Mohamed Ahmed, displayed exceptional ball control and strategic gameplay, attempting to equalise the score. Nonetheless, Togo’s goalkeeper, Samuel Mbappe, exhibited exceptional reflexes, making crucial saves and denying Algeria any chance to level the playing field. The tension escalated in the second half as both teams relentlessly pursued victory. Togo maintained their offensive pressure, creating several near-goal opportunities that kept Algeria’s defense on high alert. Conversely, Algeria launched swift counter-attacks, testing Togo’s defensive line and keeping their goalkeeper on edge. The pivotal moment of the match unfolded in the 80th minute when Togo launched a powerful counter-attack. James Thompson, displaying sheer brilliance, manoeuvred past Algeria’s defenders and unleashed a thunderous shot into the top corner of the net. The stadium erupted in euphoria as Togo secured a 2-0 lead, leaving Algeria struggling to recover in the remaining minutes. Despite Algeria’s last-minute efforts to reverse the tide, Togo’s solid defense held firm until the final whistle. The match concluded with Togo celebrating their hard-earned victory, while Algeria left the field with disappointment etched on their faces.",
        "url": "https://leadership.ng/afcon-bound-algeria-suffer-heavy-3-0-defeat-to-togo/",
        "image": "https://leadership.ng/wp-content/uploads/2024/01/Algeria-football.jpeg",
        "publish_date": "2024-01-06 10:16:04",
        "author": "Salifu Usman",
        "authors": [
            "Salifu Usman"
        ],
        "language": "en",
        "source_country": "ng",
        "sentiment": 0.36
    },
    {
        "id": 171822135,
        "title": "'Each shoe box delivers a smile'",
        "text": "A WOMAN who has helped fill shoeboxes of hope for more than 21 years has been honoured by Keith Rotary Club. Mary McGregor has co-ordinated the Blythswood Care shoebox effort in Keith in that time, inspiring many others to get involved in support of the charity. Since the first appeal in 1993, Blythswood Care has sent more than 2.5 million boxes, each one an \"expression of your care and kindness towards a stranger in need\". Mary has been integral in sending thousands of boxes from Keith to the appeal each year. They are filled with small items such as toiletries, stationery, and clothing, the individually-wrapped boxes have been distributed in schools, hospitals, orphanages and care homes, and to households in very low income communities. Romania has been one of the main beneficiaries over the years and in the last 18 months, many have gone to people affected by the war in Ukraine. Mary, who is a member at North Church in Keith, has been involved with the Guild associated to Keith North, Newmill, Boharm and Rothiemay Church for many years. \"I think of each box delivering a smile to the recipient but also lots of other smiles to their mums and dads, grannies and grandpas and others,\" she said. \"It started off small in Keith but one year we filled over 750 boxes.\" Mary, who is \"82 years young\", was the key driver of the annual appeal locally but as many of the ladies involved have got older, the numbers have reduced. \"The last year we have had a problem getting enough shoeboxes in Keith.\" Mary is a keen knitter and will continue knitting hats, scarves and other items for small children, which she will send to the appeal, however, she is taking a well earned retirement from filling shoeboxes. She will most likely donate her knitted items to the Buckie Blythswood Shoe Box appeal. \"Knitting is a great way of passing the time. One woman liked knitting but had no bairns in her family, so knitted for the shoebox appeal. \"These folk needed an outlet and the shoeboxes were ideal. It was about everybody working together.\" Even her late husband Alistair got involved in the shoebox operation for many years, helping fill boxes at home and delivering them to the charity. Mary was moved by images of orphans and other young children in bare feet receiving their shoeboxes, so knitting slipperettes is on her 'to do' list as well. Mary, who was born in Aberdeen, but has lived in the Keith area for almost 50 years, received a glass trophy and flowers from Keith Rotary in honour of her sterling work with the Blythswood Shoebox appeal locally. \"It wasn't just me who received this award,\" she said, \"it was anybody who has helped over the years.\" The Blythswood Tract Society, as it was then known, started in Glasgow in 1966. The group was made up of young men with a passion for Jesus and sharing the gospel. They engaged people in conversation on the city’s streets, handing out Christian messages. The Society’s name came from the area in Glasgow where they had a tiny office, near Blythswood Square. Jackie (John Walter) Ross, Donald Ross, Ian Tallach and John Tallach were all training to be ministers and they led the group. The group wanted to show Jesus’ example of love with practical action. They visited homeless hostels with food and clothes. Reaching out to people in need in their homes and communities became part of the much-needed work. By 1970, all the student ministers had congregations away from Glasgow and in 1977, the charity moved to Lochcarron, in Wester Ross, where Jackie Ross was a minister. During the 1970s and 80s the work expanded, with Bibles being sent to Africa and India, the communist Eastern Bloc; distributed to schools and in UK prisons. In 1984, in response to emergency requests, essential aid was delivered to Poland. Relief goods were sent to Armenia in 1988 when a devastating earthquake killed 25,000 people and left many destitute. Another container went to the poor in India. Small loads of aid were taken into Romania early in 1988 and 1989. The Romanian revolution of December 1989 led to crippling poverty there and Blythswood had sent five vehicles filled with aid by January 15, the first of many convoys. The first Shoe Box Appeal, in 1993, delivered Christmas boxes to the poorest and most vulnerable communities in Europe. In 1997, as its work expanded, the charity moved to a new warehouse and office premises in Deephaven, Evanton. Do you want to respond to this article? If so, click here to submit your thoughts and they may be published in print.",
        "url": "https://www.grampianonline.co.uk/news/each-shoe-box-delivers-a-smile-336568/",
        "image": "https://www.grampianonline.co.uk/_media/img/MS3SLXMI4F6SDLOKKYMJ.jpg",
        "publish_date": "2023-12-21 15:00:00",
        "author": "Chris Saunderson",
        "authors": [
            "Chris Saunderson"
        ],
        "language": "en",
        "source_country": "gb",
        "sentiment": 0.316
    },
    {
        "id": 160935277,
        "title": "'Counting On' star Jeremiah Duggar and wife Hannah expecting baby No. 2 just 11 months after welcoming first",
        "text": "Jeremiah Duggar and Hannah Duggar are growing their family! The former “Counting On” star and his wife announced Saturday they are expecting their second child just 11 months after welcoming their first. The happy couple shared the news by posting a sweet snapshot of Hannah holding up her sonogram photos to show their firstborn, daughter Brynley. Jeremiah smiled in the background as he held their little one. “Life just keeps getting sweeter! ",
        "url": "https://pagesix.com/2023/11/18/entertainment/counting-on-star-jeremiah-duggar-and-wife-hannah-expecting-baby-no-2/",
        "image": "https://pagesix.com/wp-content/uploads/sites/3/2023/11/counting-on-star-jeremiah-duggar-72535928.jpg?quality=75&strip=all&w=1200",
        "publish_date": "2023-11-18 21:09:43",
        "author": "Sara Whitman",
        "authors": [
            "Sara Whitman"
        ],
        "language": "en",
        "source_country": "us",
        "sentiment": 0.489
    },
    {
        "id": 162322815,
        "title": "Japan's Mizuho applies to set up securities company in China",
        "text": "We know it's a hassle to switch browsers but we want your experience with CNA to be fast, secure and the best it can possibly be. To continue, upgrade to a supported browser or, for the finest experience, download the mobile app.",
        "url": "https://www.channelnewsasia.com/business/japans-mizuho-applies-set-securities-company-china-3941341",
        "image": "https://onecms-res.cloudinary.com/image/upload/s--3Z-P9Let--/fl_relative,g_south_east,l_one-cms:core:watermark:reuters,w_0.1/f_auto,q_auto/c_fill,g_auto,h_338,w_600/v1/one-cms/core/2023-11-23t042329z_1_lynxmpejam01g_rtroptp_3_mizuho-strategy.jpg?itok=l6gv",
        "publish_date": "2023-11-23 05:23:29",
        "author": "Reuters",
        "authors": [
            "Reuters"
        ],
        "language": "en",
        "source_country": "sg",
        "sentiment": 0.448
    },
    {
        "id": 182266531,
        "title": "Reimagining Jane and Finch",
        "text": "The proposed plan reflects what we heard from the community and proposes long-term, incremental changes to the Site that will unfold over several decades—with early development along Finch Ave. We expect that the majority of the Mall will remain operational for +15 years during the plan’s first major phase. “As long-term owners of the mall, we recognize that it is an anchor for the community,” says Felman. “However, we also want to create more public space near the Jane and Finch intersection.” The initial development will occur along Finch Ave.. “Our goal is to continue to engage with the community throughout the process,” he says. “We’re confident that residents will also appreciate what’s offered in the new plan, including more homes, shops, service, community spaces and parks that will serve current and future residents in the decades to come.”",
        "url": "https://torontosun.com/life/homes/reimagining-jane-and-finch",
        "image": "https://smartcdn.gprod.postmedia.digital/torontosun/wp-content/uploads/2024/01/0120-ts-janefinch1-scaled.jpg?quality=100&strip=all",
        "publish_date": "2024-01-19 15:16:18",
        "author": "Martin Slofstra",
        "authors": [
            "Martin Slofstra"
        ],
        "language": "en",
        "source_country": "ca",
        "sentiment": 0.425
    },
    {
        "id": 153825825,
        "title": "Akeredolu meets south west govs, harps on collaboration",
        "text": "The Chairman of the South West Governors' Forum and Governor of Ondo State, Oluwarotimi Akeredolu, on Tuesday met with his counterparts within the region. The meeting, held in Ibadan, the capital of Oyo State, took place against the backdrop of speculations surrounding Akeredolu's alleged incapacitation and his absence from Ondo State. Present at the meeting were Babajide Sanwo-Olu of Lagos, Dapo Abiodun of Ogun, Engr Seyi Makinde of Oyo, and Biodun Oyebanji of Ekiti. In a statement issued by Richard Olatunde, the Chief Press Secretary to Governor Akeredolu, the Ondo State Governor expressed his deep appreciation to his fellow governors for their solidarity. Akeredolu stressed the importance of continuous collaboration and cooperation among the South-West states in order to effectively address common challenges and pursue shared goals. Although specific details of the discussions were not disclosed, it is believed that they centered around matters of regional importance. \"Governor Akeredolu, who appreciated the governors for their solidarity, harped on continuous collaboration among the Southwest States. \"Oyo State Governor, Engr Seyi Makinde, said the Forum is praying for Governor Akeredolu, adding that he has the support of all the governors in the region. \"The governors discussed national and other issues affecting the region and the people.\"",
        "url": "https://dailypost.ng/2023/10/24/akeredolu-meets-south-west-govs-harps-on-collaboration/",
        "image": "https://dailypost.ng/wp-content/uploads/2021/07/Akeredolu.jpg",
        "publish_date": "2023-10-24 19:36:25",
        "author": "Abdul Babajide, Richard Olatunde",
        "authors": [
            "Abdul Babajide",
            "Richard Olatunde"
        ],
        "language": "en",
        "source_country": "ng",
        "sentiment": 0.632
    },
    {
        "id": 152932485,
        "title": "Here are the best, healthiest veggie burgers — and why cult favorites Impossible and Beyond didn't make the cut",
        "text": "Want a taste of health? Put down the artery clogging red meat and pick up a veggie burger, brimming with the good stuff essential for a healthy diet. Experts have revealed the best plant-based alternatives to the classic, grilled meat patty — consumption of which has been linked to an array of health issues, such as type 2 diabetes. “Veggie burgers often incorporate a variety of vegetables, whole grains and legumes, which are rich in essential nutrients such as dietary fiber, vitamins, minerals and antioxidants,” registered dietitian nutritionist Sam Schleiger told HuffPost. “These nutrients are important for maintaining overall health, supporting digestion, reducing the risk of chronic diseases and promoting a well-balanced diet.” Plant-based meat has climbed in popularity in recent years with a market value of $4.8 billion last year, as restaurants adopt the vegan-friendly alternative on their menus and meatless eateries crop up across New York City. But while veggie burgers seem to promise an array of health benefits, experts warn that some brands load their products with additives, preservatives and sodium. Registered dietitian nutritionist Danielle Gaffen cautioned consumers to avoid food additives, like thickening agents such as xanthan gum. While their purpose is to enhance the flavor, texture, appearance or shelf-life of grocery store grub, some additives can lead to negative health consequences, such as digestive problems. Next up on the chopping block is sodium content. Unfortunately, some brands of the processed plant-based protein sources are more salt lick than nutrient haven. In fact, compared to a 4 ounce service of 85% lean beef, which has 80 milligrams of sodium, green-eating fan favorites Impossible and Beyond could very likely send your blood pressure spiking. The Impossible burger has a whopping 370 milligrams of sodium for a 4 ounce serving, while the Beyond is truly beyond, delivering a jaw-dropping 390 milligrams for the same portion size. According to the Centers for Disease Control and Prevention, Americans already consume too much sodium — 3,400 milligrams of their 2,300 milligram daily allowance. “While some sodium is necessary for bodily functions, too much can lead to high blood pressure,” said Gaffen. And health-conscious foodies might think they’re escaping saturated fats by noshing on plant-based burgers, but some brands still contain high concentrations. A traditional burger has around 7 grams of saturated fat, while Beyond has 6 and Impossible 8. “While plant-based, some veggie burgers can still be high in saturated fats, particularly if they contain coconut oil,” Gaffen explained, adding that too much of it can increase cholesterol levels and the risk of heart disease. Despite the lackluster performance of many of the burgers, others can be a good source of protein and vitamins for those that are meat-averse or who are looking for a health-conscious dinner option. Here, a selection of expert-approved choices — most, if not all of them found in your typical supermarket. Dr. Praeger’s Black Bean Quinoa Veggie Burgers Found in the frozen aisle, these plant-based patties are a favorite among the experts, especially Gaffen, who applauded the ingredient list. “It incorporates five distinct types of vegetables, offers 5 grams of protein per serving [and] it caters to various dietary requirements by being both gluten-free and vegan,” she said. The experts were also fond of Dr. Praeger’s Perfect Burger — which touts 20 grams of protein — and Dr. Praeger’s Kale Veggie Burger. Hilary’s Organic World’s Best Veggie Burger Schleiger prefers Hilary’s due to their organic ingredients that are jam-packed with nutrients “from whole grains, vegetables and things like ground flaxseed and apple cider vinegar,” she said. Not to mention, they’re allergy-friendly and lack artificial additives and pesky preservatives. Engine 2 Poblano Black Bean Veggie Burger These patties have no cholesterol — you read that right. And better yet, they are chock-full of fiber. Amy’s Organic Black Bean Veggie Burger “I like the variety of quality ingredients and think this can fit within a well-balanced diet, even if you include meat in your diet,” Schleiger said, praising the patties for their organic, non-GMO and nutrient-dense qualities. Hilary’s Fiesta Black Bean Veggie Burger Allergens can be difficult to avoid when eating plant-based, as many veggie-friendly options are manufactured with nuts, soy, gluten. But this burger is made without the 12 most common food allergens, Gaffen explained, and is “an excellent choice for those with specific dietary restrictions.”",
        "url": "https://nypost.com/2023/10/21/here-are-the-best-healthiest-veggie-burgers/",
        "image": "https://nypost.com/wp-content/uploads/sites/2/2023/10/NYPICHPDPICT000062177503.jpg?quality=75&strip=all&w=1200",
        "publish_date": "2023-10-21 17:10:07",
        "author": "Brooke Kato",
        "authors": [
            "Brooke Kato"
        ],
        "language": "en",
        "source_country": "us",
        "sentiment": 0.604
    },
    {
        "id": 154139011,
        "title": "‘Nightmare’ hurricane Otis slams into Acapulco in Mexico",
        "text": "What is included in my trial? During your trial you will have complete digital access to FT.com with everything in both of our Standard Digital and Premium Digital packages. Standard Digital includes access to a wealth of global news, analysis and expert opinion. Premium Digital includes access to our premier business column, Lex, as well as 15 curated newsletters covering key business themes with original, in-depth reporting. For a full comparison of Standard and Premium Digital, click here. Change the plan you will roll onto at any time during your trial by visiting the “Settings & Account” section. What happens at the end of my trial? you will be auto-enrolled in our premium digital monthly subscription plan and retain complete access for 65 € per month. you can change your plan at any time online in the “Settings & Account” section. If you’d like to retain your premium access and save 20%, you can opt to pay annually at the end of the trial. You may also opt to downgrade to Standard Digital, a robust journalistic offering that fulfils many user’s needs. Compare Standard and Premium Digital here. Any changes made can be done at any time and will become effective at the end of the trial period, allowing you to retain full access for 4 weeks, even if you downgrade or cancel.",
        "url": "https://www.ft.com/content/3b89d027-5ad0-487b-8660-e65a160cbff3",
        "image": "https://d1e00ek4ebabms.cloudfront.net/production/f6acf591-148b-4baf-b343-a36f57b9b2c2.jpg",
        "publish_date": "2023-10-25 20:06:10",
        "authors": [],
        "language": "en",
        "source_country": "gb",
        "sentiment": 0.338
    },
    {
        "id": 154770901,
        "title": "Acapulco needs us: A personal story from our CEO",
        "text": "Acapulco is a truly magical place. Anyone who has ever been there can tell you stories of that magic. I first heard of Acapulco as a child. I remember stories of how my uncle Norm, who was a private airplane pilot, would take executives from major U.S. corporations there in the 1970s for a few days of rest and relaxation. The way he described it was fascinating – truly a playground for the rich and famous and the jet set vacation hot spot for many years. My first direct experience with Acapulco came from a college friend of mine, Pilar, whom I met while studying at the University of Wisconsin – Madison. Pilar was from downtown Acapulco, just a few blocks off the main beach. She was a true “costeña” – loved to smile, have fun, enjoy life, and dance the night away. Imagine how that Acapulco girl suffered in Wisconsin winters! I visited Pilar’s family in Acapulco multiple times over the years when she would be back for the holidays. I remember her mother helping me wash my clothes once by hand on their rooftop. Her mother is a beautiful, wonderful, strong woman – imagine raising your daughter and telling her that success meant that she would never come back again to live in Acapulco. Her father is a local doctor helping the community from a clinic near their home. Today Pilar lives near Vienna. Her brother lives in Germany. Their parents still both live in that same home just a few blocks from the beach – and as of my writing this, Pilar has still been unable to communicate with them. Another friend of mine, Angelica, a colleague from my first job, also has an Acapulco connection. Her family had a home there. One time, my wife and I and two friends were visiting Acapulco, and Angelica, though she wasn’t there, insisted that we spend the day on a boat with her family. It was one of those unforgettable days – filled with laughter, swimming, dancing, an amazing sunset, and lots of tequila. Acapulco is a place where it is impossible to not make incredible memories. A few more of my own include – late nights at “Disco Beach”, seeing the sunrise on back to back mornings after all-night clubbing, seeing the famous Acapulco cliff divers, having New Year’s Eve dinner one year with Pilar’s family, and attending Pilar’s wedding at a mountaintop location with a stunning view of the entire bay. I could go on and on as I guarantee you anyone who has been to Acapulco could. The port of Acapulco has many centuries of history, and the people of Acapulco have endured tough times. Recent years have not been kind to the area due to drug violence. This devastating hurricane only adds to the pain and suffering that too many families have endured. It will be too easy to forget about this magic of this special place. We can’t do that. The people and the place that have brought so much joy to so many people need us now more than ever. Travis Bembenek is the CEO of Mexico News Daily and has been living, working or playing in Mexico for over 27 years.",
        "url": "https://mexiconewsdaily.com/mexico-living/acapulco-needs-us-a-personal-story-from-our-ceo/",
        "image": "https://mexiconewsdaily.com/wp-content/uploads/2023/10/shutterstock_1139323190_850.jpg",
        "publish_date": "2023-10-27 20:48:25",
        "author": "Travis Bembenek",
        "authors": [
            "Travis Bembenek"
        ],
        "language": "en",
        "source_country": "mx",
        "sentiment": 0.388
    },
    {
        "id": 186842349,
        "title": "The most lavish royal weddings from William and Kate to Meghan and Harry",
        "text": "During any royal wedding, some glitz and glamour is to be expected, with these nuptials never failing to wow, from the bride’s extravagant gown or gowns to the stunning venues. Although fans of the royal families are rarely invited to the nuptials, royal weddings are not only worldwide spectacles, viewed by millions, but also a celebratory occasion for the communities in these countries. For example, when the Duke of Sussex, Prince Harry, married former actor Meghan Markle in 2018, their nuptials were heavily broadcast, with viewers fawning over the bride’s gorgeous veil and the event’s star-studded guest list. Aside from the British royal family, members of other royal families – such as in Jordan and Sweden – have gone on to host luxurious weddings for the leaders of their country. Unsurprisingly, some of these beautiful ceremonies reportedly came with a hefty price tag. From the Crown Prince and Princess of Jordan to the now Prince and Princess of Wales, here are some of the most lavish royal weddings of all time. Crown Prince Al Hussein and Princess Rajwa Al Saif On 1 June 2023, King Abdullah’s eldest son, Crown Prince Al Hussein, officially tied the knot with Saudi Arabian architect Rajwa Al Saif, who is the youngest daughter of Saudi businessman Khaled Al Saif. The wedding ceremony took place at Zahran Palace in Amman, Jordan, followed by a free concert to celebrate the nuptials. The bride arrived at the wedding in a custom 1968 Rolls-Royce Phantom alongside the prince’s siblings Princess Iman, Princess Salma, and Prince Hashem. She wore a white, long-sleeve Elie Saab gown with an asymmetrical neckline and a long, flowing train. Many famous faces attended the nuptials, including Prince William and his wife, Kate Middleton, and the US President and the First Lady, Joe and Jill Biden. While the wedding was last year, the total cost of the extravagant occasion hasn’t been reported. Prince William and Kate Middleton On 29 April 2011, millions of people from all around the world watched William and Kate’s historic wedding, which took place at Westminster Abbey. For the big day, Kate wore an Alexander McQueen dress designed by Sarah Burton. She also wrote the Cartier Scroll Tiara, which the late Queen Elizabeth II had lent to her. Unsurprisingly, many famous faces attended the royal affair, including Victoria and David Beckham and Elton John. Although the exact costs are unclear, the wedding was reportedly about $34m, with a majority of the money being used for security at the event. Prince Harry and Meghan Markle On 19 May 2018, the Duke and Duchess of Sussex married at St George’s Chapel in Windsor. At the time, the wedding became a viral sensation, as the star-studded guest list featured Oprah Winfrey, Serena Williams and husband Alexis Ohanian, and George and Amal Clooney. Some of Meghan’s co-stars from her hit show, Suits, were in attendance, including Patrick J Adams and wife Troian Bellisario. For the occasion, Meghan wore a white Givenchy dress, made by British designer Clare Waight Keller. The extravagant yet simple gown was quite pricey, as it reportedly cost $265,000. According to UK wedding website Bride Book, the entire wedding itself reportedly came with a huge bill: $42.8m. Prince Rainier and Grace Kelly On 18 April 1956, Prince Rainier of Monaco tied the knot with beloved American actor Grace Kelly. The nuptials took place at Saint Nicholas Cathedral in Monaco, with Kelly wearing a white dress with a high, lace neckline. The skirt of the dress was also embroidered with pearls. While the exact cost of the 1956 wedding is unknown, reports have claimed that it cost about $8,000. With inflation rates now, that would be more than $100,000 for the wedding. Princess Victoria and Daniel Westling On 19 June 2010, the Crown Princess of Sweden tied the knot with Daniel Westling after eight years of dating. The wedding took place at Stockholm Cathedral, with the nuptials then described as one of Europe’s biggest royal weddings since now King Charles III and Princess Diana’s wedding in 1981. For the occasion, Victoria wore a satin off-the-shoulder gown with a long train, and a gold tiara that had a veil attached. Her gown was also made by Swedish designer Pär Engsheden. The extraordinary nuptials weren’t anything short of expensive, as People previously reported that the estimated cost of the royal wedding was $2m. King Charles III and Diana On 29 July 1981, now King Charles III married Princess Diana, with the wedding taking place at St Paul’s Cathedral in London. Similar to her sons Harry and Williams’ weddings, Diana’s nuptials were another heavily televised event, with a global television audience of 750m in 74 countries, according to the BBC. For her wedding, Diana – who died in a car accident in 1997 – wore a white gown with statement sleeves, a ruffled neckline, and a 25-foot-long train. The outfit was made by former husband and wife duo designers, Elizabeth and David Emanuel. The royal wedding of 1981 was also costly, as People reported that it cost roughly $48m. The publication also specified that when the price was adjusted for inflation rates, it means the wedding would cost about $156m today.",
        "url": "https://www.independent.co.uk/life-style/royal-family/royal-weddings-kate-william-grace-kelly-b2489777.html",
        "image": "https://static.independent.co.uk/2024/02/02/21/royal-weddings.png?width=1200",
        "publish_date": "2024-02-02 23:04:06",
        "author": "Amber Raiken",
        "authors": [
            "Amber Raiken"
        ],
        "language": "en",
        "source_country": "gb",
        "sentiment": 0.559
    },
    {
        "id": 162701949,
        "title": "Pres. Weah to Convene First Inaugural Meeting of Joint Presidential Transition Team…",
        "text": "MONROVIA, LIBERIA-President George Weah is expected to convene the first inaugural meeting of the Joint Presidential Transition Team later today. According to an Executive Mansion release, the Joint Presidential Transition Team was established recently by Executive Order Number 123, issued by President Weah. The gathering is expected to be co-chaired by President-elect, Joseph Boakai, on the grounds of the Executive Mansion. The release also quotes President Weah as urging members of the Joint Presidential Transition Team to be in attendance to fast-track the transition process. By: Vasta Tarlue",
        "url": "https://elbcradio.com/2023/11/24/pres-weah-to-convene-first-inaugural-meeting-of-joint-presidential-transition-team/",
        "image": "https://elbcradio.com/wp-content/uploads/2023/11/wb.jpg",
        "publish_date": "2023-11-24 10:16:30",
        "author": "Maximilian K. Kasseh jr",
        "authors": [
            "Maximilian K. Kasseh jr"
        ],
        "language": "en",
        "source_country": "lr",
        "sentiment": 0.304
    },
    {
        "id": 186046835,
        "title": "VIDEO: Olympic great Sir Steve Redgrave throws his weight behind Coleraine club",
        "text": "And that’s exactly what has happened for Coleraine’s Bann Rowing Club after it received a glowing endorsement from one of the greatest ever Olympians, Sir Steve Redgrave. In a video message to the Club, Sir Steve encourages local people to support “the fantastic community club that is recognised around the world”, that has done so much for the local community and produced world class rowers. Watch the video here...",
        "url": "https://www.northernirelandworld.com/sport/other-sport/video-olympic-great-sir-steve-redgrave-throws-his-weight-behind-coleraine-club-4499526",
        "image": "https://www.northernirelandworld.com/webimg/b25lY21zOmQ2NDkyNzgxLWMxZmItNGRlNS1iYTM3LTMzM2Q5MGM5OGM2ODplZmZlZmJjMC01NGIwLTRhOWEtYWVhYi03MTcwZDRkOGM1MDM=.jpg?width=1200&enable=upscale",
        "publish_date": "2024-01-31 13:23:55",
        "author": "By The Newsroom",
        "authors": [
            "By The Newsroom"
        ],
        "language": "en",
        "source_country": "gb",
        "sentiment": 0.427
    },
    {
        "id": 160814695,
        "title": "Kate Beckinsale, Hailey Bieber and Jessica Simpson’s hot night out on the town: PHOTOS",
        "text": "Kate Beckinsale Actress Kate Beckinsale arrived at Leonardo DiCaprio's 49th birthday party wearing a strapless black minidress, featuring a bedazzled neckline. What made the dress stand out, however, was the blue sapphire diamond-like embellishment she wore as an accessory around her waist. The choice of accessory acts as a less than subtle nod to DiCaprio's time playing Jack Dawson in 1997's \"Titanic,\" a role which catapulted the actor into megastardom. Along with the big jewel, Beckinsale paired the outfit with black tights, dangly earrings, black stilettos and a black purse, wearing her hair in a ponytail with a black bow holding it up. Beckinsale partied the night away at the A-lister's birthday bash with all the other stars in attendance, including Zoe Saldana, Olivia Wilde, Tobey Maguire, Channing Tatum and Chris Rock. KATE BECKINSALE SLAMS HATERS AND THEIR ‘FAIRLY CONSTANT… BULLYING’ Hailey Bieber Hailey Bieber stunned when she walked the red carpet at the Baby2Baby Gala in a strapless black Saint Laurent dress with a cutout in the back. She accessorized the look with jewelry from Tiffany & Co., including gold bracelets and earrings. The model recently posed for photos promoting the launch of her upcoming lip tint shade, jelly bean, which is part of her beauty and skincare line Rhode. She first launched the company in June 2022 with three products and has been adding to the line ever since. \"I always wanted to start my own brand in general; I chose to go with skincare first because I reached a point where I had been modeling for a long time,\" Bieber told Forbes in June 2022. \"I had tried so many different things. I had the extreme privilege of being able to work with different estheticians and dermatologists. I'm like a sponge; I soak up knowledge, so I've always been really inquisitive and asking questions to all these people I've gotten to work with.\" Jessica Simpson View this post on Instagram A post shared by Jessica Simpson (@jessicasimpson) APP USERS CLICK HERE FOR POST \"Steak Me Home Tonight,\" Jessica Simpson captioned the photo of herself all dressed up and ready for a night out. In the pic, the singer is seen wearing an all-black ensemble, paired with a red belt. Just a few weeks ago, she reposted an old photo of herself to celebrate six years of sobriety, writing \"this person in the early morning of Nov 1, 2017 is an unrecognizable version of myself.\" JESSICA SIMPSON CELEBRATES 6 YEARS OF SOBRIETY: 'UNRECOGNIZABLE VERSION OF MYSELF' \"There is so much stigma around the word alcoholism or the label of an alcoholic. The real work that needed to be done in my life was to actually accept failure, pain, brokenness, and self sabotage. The drinking wasn’t the issue. I was,\" Simpson wrote. \"I didn’t love myself. I didn’t respect my own power. Today I do. I have made nice with the fears and I have accepted the parts of my life that are just sad. I own my personal power with soulful courage. I am wildly honest and comfortably open. I am free.\" Margot Robbie Margot Robbie turned heads when she walked the red carpet at the \"Saltburn\" premiere in a sheer black corset and very wide-legged trousers. She kept her makeup and accessories minimal, going for a more natural look, and wore just a gold necklace for jewelry. The actress walked the carpet as a producer of the new psychological thriller, which follows a young man struggling to fit in at Oxford who is invited to spend the summer at an estate in Saltburn after befriending a charming rich classmate. \"Saltburn\" is far from the first movie Robbie has produced, as the actress was involved in the production of \"I, Tonya,\" \"Promising Young Woman,\" \"Maid,\" \"Dollface\" and this summer's blockbuster, \"Barbie.\" She started the production company LuckyChap in 2014 with her friends Josey McNamara and Sophia Kerr and her now-husband, Tom Ackerley. \"The conversation started because I was like, ‘I keep picking up scripts, and I never want to play the girl, I just want to play the guy.’ And I can’t be [the only one]. There are brilliant actresses who aren’t getting amazing roles,\" Robbie told The Hollywood Reporter in December 2020. \"And beyond that, you look at the statistics of male versus female directors, male versus female writers, etc., and there’s so much to be done. You can’t just sit there and do nothing when you hear those stats.\" Camila Alves McConaughey Camila Alves McConaughey was a vision in blue when she walked the red carpet at the Baby2Baby Gala. Her hair and makeup was kept simple, as she wore her signature long wavy hair down, and wore neutral makeup. Earlier this year, Alves McConaughey made Paris Fashion Week a family affair. MATTHEW MCCONAUGHEY’S MOM INITIATED WIFE CAMILA ALVES INTO FAMILY BY CALLING HER WRONG NAMES The couple's two oldest children, Levi, 15, and Vida, 13, joined their mom on the Stella McCartney Womenswear Fall Winter 2023-2024 show red carpet in March, where all three stunned in matching neutral toned outfits. Kristin Cavallari View this post on Instagram A post shared by Kristin Cavallari (@kristincavallari) APP USERS CLICK HERE FOR POST Kristin Cavallari called herself a \"party girl\" when she posted photos of herself enjoying a night out with friends on Instagram. She rocked a black mini dress, paired with strappy heels and a wristwatch. One of the pics shows her posing outside next to her dog, while the others show her dancing the night away with her friends. \"Kristin is goals always,\" one fan wrote in the comments section, while another commented, \"this dress! You look stunning.\" Salma Hayek Salma Hayek arrived at the Baby2Baby Gala in a backless green sequined Bottega Veneta dress, with a halter neckline. Her makeup matched her dress, as she was rocking green eye makeup, pairing the look with dangly diamond earrings and green rings. The actress attended the gala as the recipient of the Giving Tree Award, which honors those who have made significant efforts to help children in need around the world. Her \"Magic Mike's Last Dance\" co-star Channing Tatum presented her with the honor, and she gave him a shout-out in an Instagram post she shared later, saying \"thank you for presenting me with this award (I know how much you hate doing this kind of thing…).\" \"I am incredibly honored and grateful beyond words to receive this year’s Giving Tree Award at the 2023 Baby2Baby Gala,\" Hayek also wrote. \"I am in awe of your resilience, thoroughness, and hard work in creating @baby2baby, providing children living in poverty across the country with diapers, clothing, and all the basic necessities that every child deserves.\" SALMA HAYEK CELEBRATES 57TH BIRTHDAY IN RACY RED BIKINI: ‘SO HAPPY TO BE ALIVE’ \"I promise I will continue to make it my lifetime commitment to help children across the world,\" she later added. Kim Kardashian Kim Kardashian walked the red carpet at the Baby2Baby Gala in a black lace Balenciaga gown. The reality star was recently named GQ's Man of the Year, posing for the cover at a desk in a power suit. During the interview for the Man of the Year issue, she sat with her sisters Kourtney and Khloé Kardashian, and discussed a wide array of subjects, including their late father and his divorce from their mom, Kris Jenner. \"I was in the bath and they called a family meeting,\" Kim told the outlet about her parents' divorce. \"I remember thinking, 'Please, Lord, don't let them be getting a divorce.' I never had an inkling that it would happen, but I knew that was what they were going to tell us. I felt it.\" Vanessa Kirby Vanessa Kirby stunned when she walked the red carpet at the premiere of her latest film, \"Napoleon,\" in a backless black Alexander McQueen gown. The dress featured a structured asymmetrical neckline, a thigh high slit and a bow train which featured gold sequined flowers embroidered on it. According to Variety, the actress is being submitted for consideration for an Academy Award for best supporting actress for her role in the new movie, in which she stars alongside Joaquin Phoenix. He portrays French Emperor Napoleon Bonaparte, while Kirby plays his wife Josephine, with their romance being one of the main storylines in the film. LIKE WHAT YOU’RE READING? CLICK HERE FOR MORE ENTERTAINMENT NEWS It wouldn't be the first Academy Award nomination for either actor, as Kirby was nominated in 2020 for her role in \"Pieces of a Woman,\" while Phoenix was nominated for 2000's \"Gladiator,\" 2005's \"Walk the Line\" and 2012's \"The Master,\" before winning in 2020 for his role in \"Joker.\" Millie Bobby Brown View this post on Instagram A post shared by Millie Bobby Brown (@milliebobbybrown) APP USERS CLICK HERE FOR POST \"Fun nights in denim,\" Millie Bobby Brown captioned a recent Instagram post. The series of photos featured the \"Stranger Things\" actress dressed in a black crop top and brown jacket, paired with a denim skirt. Brown rose to stardom as a preteen when she was cast as Eleven on the hit Netflix show \"Stranger Things,\" which is currently in production on its fifth and final season. She recently opened up to Glamour about how difficult it was to navigate the sudden spotlight and criticism that comes with being on a popular show, specifically when she was called a \"brat\" and \"trying to steal the thunder\" from her castmates in interviews. CLICK HERE TO SIGN UP FOR THE ENTERTAINMENT NEWSLETTER \"I was just penalized for overtalking and oversharing and being too loud…\"It’s hard to hear that at 13. You’re like, ‘I don't want to ever talk again. I don’t want to be the loud person,’\" Brown told the outlet in October. \"In interviews I couldn’t help but think of all the comments. So I just remembered to stay silent and speak when I was spoken to, even though I was dying to join in. I just felt it wasn’t my turn.\" Camila Cabello Camila Cabello attended a special screening of \"Trolls Band Together\" wearing a low-cut teal gown with a halter neckline and large black floral designs. The singer and actress joined the Trolls family in the latest movie, voicing the character of Viva. The movie also stars Justin Timberlake, Eric André, Amy Schumer and Zooey Dechanel. CLICK HERE TO GET THE FOX NEWS APP While Cabello started out as a member of the girl group Fifth Harmony, she has branched out as a successful solo artist and actress. She previously starred in \"Cinderella,\" and has released the songs \"Señorita,\" \"Havana,\" \"Bam Bam\" and \"Don't Go Yet.\"",
        "url": "https://www.foxnews.com/entertainment/kate-beckinsale-wears-provocative-titanic-dress-leonardo-dicaprios-birthday-photos",
        "image": "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2023/11/931/523/kate-beckinsale-party.jpg?ve=1&tl=1",
        "publish_date": "2023-11-18 11:50:48",
        "author": "Lori Bashian",
        "authors": [
            "Lori Bashian"
        ],
        "language": "en",
        "source_country": "us",
        "sentiment": 0.409
    },
    {
        "id": 183636681,
        "title": "Perth's Dewars Centre plays successful host to European Junior Curling Tour event",
        "text": "The European Junior Curling Tour swept into Perth at the weekend - and organisers have hailed the event a great success. Dewars Centre was chosen to host the tournament which, over three days of action, saw talented teams from Scotland as well as the continent battle for top honours. Among the line-up on the renowned and respected Fair City ice were squads who had travelled over from Denmark and Norway. Alan Hannah, one of the organisers, told the PA: “The event was a great success, and it is hoped we have created the foundations to host further events in the years to come with a larger number of teams participating from across Europe. “It was especially pleasing to see many young curlers from Perth and Kinross taking part which is testament to the great work being done locally to develop junior curling at Dewars Centre.” The girls’ event was won by Scotland’s junior champions Team Munro, whose ranks include local curlers Holly Wilkie-Milne and Laura Watt. They are soon to have another crack at winning the World Junior Championships. “Playing a competition in Perth is always special as it’s my home ice rink and I’ve grown up curling there,” said former Perth Academy student Wilkie-Milne. “Winning the first ever Perth EJCT title is something really special to me. It’s so lovely to lift that trophy at my home rink and support the beginning of a fantastic event.” Wilkie-Milne was complementarity of ice conditions and Perth’s pull in being able to host top competitions at European and world level. “Perth is a fantastic venue for events, with great ice, facilities and atmosphere,” she said. “The ice rink has all of the facilities and engagement of volunteers, staff and spectators to host outstanding events. “It’s great that the only Scottish EJCT is being hosted in this venue and the organisers have worked hard to pull off a great event. “We had a couple of international teams from Norway and Denmark, alongside our very strong Scottish junior field. The event was a good display of junior curling.” The boys’ event was won by Team Strawhorn and special mention goes to Perth’s Team Arran Thomson who placed third. Pick up a copy of this Friday's Perthshire Advertiser for all the team and action photos.",
        "url": "https://www.dailyrecord.co.uk/sport/local-sport/perths-dewars-centre-plays-successful-31946381",
        "image": "https://i2-prod.dailyrecord.co.uk/incoming/article31946356.ece/ALTERNATES/s1200/0_RWP_PAF_190124JuniorCurling_03JPG.jpg",
        "publish_date": "2024-01-23 12:45:52",
        "author": "Perthshire Advertiser",
        "authors": [
            "Perthshire Advertiser"
        ],
        "language": "en",
        "source_country": "gb",
        "sentiment": 0.564
    },
    {
        "id": 160860635,
        "title": "First look at Chester Zoo's new Lanterns and Light trail as 'biggest and brightest' event opens for Christmas 2023",
        "text": "It's one of the most popular events in the festive calendar and this year's Lanterns and event has opened at Chester Zoo. We were among the first to step inside and take a look at this year's offering, which even has a new name - Lanterns and Light - to reflect the new additions for Christmas 2023, which have made it the 'biggest and brightest' to date. This year, for the first time ever, the zoo has partnered with music giants Sony Music / RGL and Culture Creative, to create the all-new light trail, with never seen before installations. The fun starts from the moment you enter the attraction and are met by some very playful glowing interactive elephants. Just a few minutes in and you'll find another of this year's new additions - a 15m-long 3D mammoth hologram - which had the crowds mesmerised. The darker the better for this though, so we returned to it at the end of our trail to make sure we saw Matilda in all her glory. It was worth the wait. A team of 40 people have been working to set the magical trail around our 128-acre zoo, where the Lanterns have now been a festive staple for the last 12 years. Other new features this year include new interactive animal characters, a walkway of giant pea-lit animals, illuminated dolphins emerging from waterways and a stunning fire garden. While not a full-on grotto visit, little ones get the chance to see Father Christmas who will have a quick chat with them from his toy shop as they pass by. You can take your own food along if you wish, but there's no shortage of festive fodder to fill the troops as you make your way around. There's a dedicated Lanterns Food Village where you can get everything from burgers, sausages and Yorkshire wraps to sweet treats including some very delicious festive-themed handmade donuts, Christmas crumble, candy floss and popcorn. Of course there are plenty of festive drinks too, including mulled wine and a range of hot chocolates. And there's the opportunity to toast some marshmallows en route too, with a range of flavours including caramel, vanilla and chocolate orange. There is some indoor seating at the Food Village, as June's Food Court is open if you want to get out of the cold for a bit, and just behind it are a number of fairground rides for little ones including a carousel and swingboats. With ultraviolet rainforests, an incredible walk-through pea-lit tunnel and puppets and lanterns at every turn, there's nothing not to love about this glorious trail. The event is running on selected dates from now until December 31. Tickets, costing from £12 for children and from £18 for adults, are available online. Carers and little ones two and under go free. Lanterns and Light is one of many festive light trails and events coming to the region this Christmas. See the full list here.",
        "url": "https://www.manchestereveningnews.co.uk/whats-on/whats-on-news/gallery/first-look-chester-zoos-new-28131359",
        "image": "https://i2-prod.manchestereveningnews.co.uk/incoming/article28131395.ece/ALTERNATES/s1200/0_EGR_181123chesterzoo2_06.jpg",
        "publish_date": "2023-11-18 15:24:40",
        "author": "Emma Gill",
        "authors": [
            "Emma Gill"
        ],
        "language": "en",
        "source_country": "gb",
        "sentiment": 0.451
    },
    {
        "id": 192334691,
        "title": "IND Vs ENG: Who Was Last Batter from England to Score Double Century in Tests Played in India?",
        "text": "IND Vs ENG: The traditional rival between IND Vs ENG will still continue as there are still two more red ball matches to be played in this series of five Test matches. The Men in Blue are up with a lead of 2-1 in this series. They have won the second and the third match quite comprehensively after their loss in the first match in Hyderabad.Yashaswi Jaiswal is the latest double-centurion from the Blues in this series. The opener has also amassed the most runs in the first three matches as well while Boom Boom Bumrah has been the highest wicket-taker from the home side in three matches played so far. Jasprit Bumrah will be rested for the fourth Test match in Ranchi.One sad news is that India will continue to miss KL Rahul in this series. The Karnataka batter played the first Test. But due to his fitness concerns, Rahul has been ruled out of the 4th red ball match of this five-match series and his participation in the last Test match in Dharamshala will depend on his clearance of the fitness Test. .IND Vs ENG: Joe Edward Root Was The Last Batsman From England Who Scored A Double Century.Joe Edward Root has been a stellar name in the International Cricket arena. The former skipper of England is still the best batter for his country in the fifty-overs and red ball format. Root has been a backbone of the batting team of England. He made his debut in the traditional format of the game against India in Nagpur in 2012, where he scored 73 runs in the 1st innings and an unbeaten 20 runs in the second innings.England was the last team to win a Test Match Series in India during that series when Joe Root made his Test debut. The first Test match of that series was drawn and India won the second Test match. But the visitors, England won two back-to-back matches of that Test series in Mumbai and Kolkata to win that series of the red ball format in 2012.Root also captained England. In 2021, when England toured India for the last time before this current series, the visitors, England won the opening match in Chennai. Joe Root was the skipper of his side and he smashed a double ton in that Test match. He was the first player to smash 200 runs in his 100th Test match.Root was also the last batter from his side, England to score a double century in the red ball format in India. Ollie Pope came close to reaching that milestone in the current series. But Pope fell 4 runs short of that score as he was out on 196 runs in Hyderabad. Ollie played a brilliant innings that took the game from India.If England wants to do well and win the series from here than they will need Joe Root to play another captain’s knock like he played in the opening match of the 2021 five-match Test series. In this ongoing series, Root hasn’t been that player that his fans are used of seeing him. He has scored 29 and 2 runs in Hyderabad, 5 and 16 runs in Vizag and 18 and 7 runs in Rajkot. .IND Vs ENG: Will Boom Boom Bumrah Be Rested For The 4th Test Matches Against England in Ranchi?",
        "url": "https://www.sinceindependence.com/sports/ind-vs-eng-who-was-last-batter-from-england-to-score-double-century-in-tests-played-in-india",
        "image": "https://media.assettype.com/sinceindependence/2024-02/01bc7eb0-3409-47a7-9164-9de888e3e361/1707137958_1715.avif?w=1200&h=675&auto=format%2Ccompress&fit=max&enlarge=true",
        "publish_date": "2024-02-21 08:32:59",
        "author": "Kaushal Kowjalgi",
        "authors": [
            "Kaushal Kowjalgi"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.512
    },
    {
        "id": 154371481,
        "title": "Thank you for subscribing!",
        "text": "Sturm Graz sporting director Andreas Schicker has admitted he always knew the Austrian club would struggle to keep hold of Manchester United striker Rasmus Hojlund. The 20-year-old, who has scored three goals for United since arriving in August, joined Sturm Graz from Danish outfit FC Copenhagen in January 2022. He immediately went from strength-to-strength in Austria, scoring 12 goals and registering four assists in just 21 appearances. His form caught the attention of Italian club Atalanta, who swooped for his signature in August 2022, signing him towards the end of the summer transfer window, meaning his spell at Sturm Graz was short and sweet. He continued to maintain his uphill trajectory in Italy, scoring 10 goals and grabbing four assists last season. READ MORE: Roy Keane has finally got what he wanted at United after Andre Onana admission READ MORE: Erik ten Hag needs to demand more from four United players His performances for Atalanta, of course, alerted United to his talent levels and potential, with the club selecting the Danish international as their chosen candidate to try and end their goalscoring troubles. He joined the club in August for a fee that could eventually rise to £72million. He has scored three goals so far, all of which have come in the Champions League, and his performances have, overall, provided plenty of encouragement. Now on the books of one of Europe's elite, Schicker has conceded that it was always going to be difficult for Sturm Graz to retain him, as well as waxing lyrical about his mentality. \"Rasmus is an exceptional player,\" Schicker told Tuttomercatoweb. \"A top talent who played really well in Graz. \"We didn't plan to lose him just after half a season. But, from the way he was playing, I knew he was built for the best football stages, and we couldn't keep him down. \"I think his best quality as a footballer is his mental strength, which was and is truly impressive, especially considering his young age.\" At the time of joining Atalanta, Schicker thought it was a perfect move for Hojlund to take the next step in his career. Schicker added: \"After the match against Salzburg last August, where Rasmus scored two goals, the contacts with Atalanta became very concrete and everything happened really quickly. I thought Atalanta could be a perfect step for him. \"Now, we know that he improved in a top league like Serie A, and then moved to one of the best teams in the world like Manchester United.\"",
        "url": "https://www.manchestereveningnews.co.uk/sport/football/transfer-news/manchester-united-rasmus-hojlund-transfer-27984731",
        "image": "https://i2-prod.manchestereveningnews.co.uk/sport/football/football-news/article27984758.ece/ALTERNATES/s1200/0_GettyImages-1755971880.jpg",
        "publish_date": "2023-10-26 15:26:35",
        "author": "George Smith",
        "authors": [
            "George Smith"
        ],
        "language": "en",
        "source_country": "gb",
        "sentiment": 0.416
    },
    {
        "id": 171578073,
        "title": "Pep Guardiola raises Club World Cup final concern as Erling Haaland wins Man City award",
        "text": "Manchester City breezed through to the Club World Cup final on Tuesday with a convincing 3-0 win over Japanese side Urawa Red Diamonds in Saudi Arabia. They will face a tougher test in Friday’s showpiece when they take on Fluminense of Brazil but the Blues go into the contest as favourites. However, Pep Guardiola is concerned about the state of the pitch at the King Abdullah Sport City Stadium, which has already seen four games played on it including City’s semi-final. Erling Haaland has been ruled out of the tournament as he continues to nurse his foot injury but he continues to grab the headlines. He has now picked up another accolade for an unforgettable 2023. READ MORE: City player ratings vs Urawa Red Diamond READ MORE: City issue fitness update on De Bruyne and Haaland Guardiola raises pitch concerns ahead of Club World Cup final Guardiola has expressed concern at the state of the pitch at the King Abdullah Sport City Stadium ahead of the Club World Cup final against Fluminense on Friday. The Blues beat Urawa Red Diamonds 3-0 in Tuesday's semi-final but the playing surface was beginning to cut up during what was the fourth match played at this venue in eight days during this tournament. Fluminense beat Al-Ahly 2-0 in the first semi-final on Monday but afterwards their coaching staff and players also raised concerns about the state of the pitch. Haaland wins Man City Fans' Footballer of the Year 2023 Haaland has been crowned as your City Fans' Footballer of the Year for 2023. The 23-year-old Norway sensation, who also finished as runner-up for the national-wide accolade, was a landslide winner during the voting process. John Stones, Rodri and Haaland were in all the running for Reach PLC's top prize, which ultimately went to England and Newcastle defender Kieran Trippier. For the City-only prize, Haaland topped the billing with 547 of the 1,175 votes that came from Manchester Evening News readers. Rodri (364), Bernardo Silva (171) and Jack Grealish (93) followed him.",
        "url": "https://www.manchestereveningnews.co.uk/sport/football/football-news/pep-guardiola-raises-club-world-28325392",
        "image": "https://i2-prod.football.london/incoming/article28325415.ece/ALTERNATES/s1200/0_GettyImages-1867856487.jpg",
        "publish_date": "2023-12-20 21:47:46",
        "author": "Isaac Johnson",
        "authors": [
            "Isaac Johnson"
        ],
        "language": "en",
        "source_country": "gb",
        "sentiment": 0.297
    },
    {
        "id": 151731755,
        "title": "HIGHLAND PARK UNVEILS NEW CASK STRENGTH RELEASE NO.4 SCOTCH WHISKY",
        "text": "TORONTO, ON - Orkney-based distillery, Highland Park, has unveiled its new Cask Strength Release No.4, coinciding with the distillery's 225th Anniversary. Cask Strength Release No.4 is Highland Park in its purest form. Neither diluted nor chill-filtered, this unique expression delivers a robust and intense flavour. To view the full announcement, including downloadable images, bios, and more, click here. Key Takeaways: Highland Park Cask Strength Release No.4 is Highland Park in its purest form.The release of Highland Park Cask Strength Release No.4 coincides with the distillery's 225th Anniversary.Highland Park has partnered with a UK-based woodworker, Jamie Gaunt, to design a commemorative piece shaped from the oak cask staves used to mature the whisky. About Highland Park: Whisky has been distilled at Highland Park in Kirkwall, Orkney since 1798. Founder Magnus Eunson, was a direct descendant of Vikings who settled in Orkney over 1,000 years ago. A butcher and church officer by day and a bootlegger and smuggler by night, he set up an illegal whisky-making operation at a little bothy (a stone hut) at High Park, overlooking Kirkwall. It is still the site of the distillery today and although we say Highland Park was founded in 1798, that's actually the year the authorities finally caught up with Magnus. Few trees survive the gale-force winds on Orkney. This makes the island peat woodless and rich in heather. This then helps create the trademark Highland Park flavour profile of aromatic smoky peat and sweet heather honey. www.highlandparkwhisky.com About Beam Suntory: As a world leader in premium spirits, Beam Suntory inspires human connections. Consumers from all corners of the globe call for the company's brands, including the iconic Jim Beam® and Maker's Mark® bourbon brands and Courvoisier® cognac, as well as world renowned premium brands including Basil Hayden®, Knob Creek®, and Legent™ bourbon; Yamazaki®, Hakushu®, Hibiki® and Toki™ Japanese whisky; Teacher's, Laphroaig® and Bowmore® Scotch whisky; Canadian Club® whisky; Hornitos® and Sauza® tequila; EFFEN®, Haku® and Pinnacle® vodka; Sipsmith® and Roku™ gin; and On The Rocks Premium Cocktails. Beam Suntory was created in 2014 by combining the world leader in bourbon and the pioneer in Japanese whisky to form a new company with a deep heritage, passion for quality, innovative spirit and vision of Growing for Good, which now includes its transformative sustainability strategy, Proof Positive. Headquartered in New York, New York, Beam Suntory is a subsidiary of Suntory Holdings Limited of Japan. For more information on Beam Suntory, its brands, and its commitment to social responsibility, please visit www.beamsuntory.com and www.drinksmart.com. Contacts: Emily Leak Jacklyn Gilmor Source: Highland Park Single Malt Scotch Whisky Distributed by: Reportable, Inc.",
        "url": "https://www.thejapannews.net/news/274001923/highland-park-unveils-new-cask-strength-release-no4-scotch-whisky",
        "image": "https://static.midwestradionetwork.com/nn_logos/the-japan-news.png",
        "publish_date": "2023-10-17 18:14:36",
        "author": "Highland Park Single Malt Scotch Whisky",
        "authors": [
            "Highland Park Single Malt Scotch Whisky"
        ],
        "language": "en",
        "source_country": "bh",
        "sentiment": 0.758
    },
    {
        "id": 195839055,
        "title": "Table Tennis: Indian men and women’s teams qualify for 2024 Paris Olympics",
        "text": "The Indian men’s and women’s table tennis teams, on Monday, qualified for the upcoming 2024 Paris Olympics, which will be held in July-August later this year. Both the Indian teams qualified on the basis of being the highest-ranked teams in the world, who were yet to qualify for the quadrennial event. “In the women’s event, India, Poland, Sweden, and Thailand have earned their places in the Paris 2024 Olympics,” a statement from the International Table Tennis Federation read. “Meanwhile, on the men’s front, Croatia, India, and Slovenia have secured their spots, injecting an extra dose of adrenaline into the competition,” it added. The 2024 Paris Games will also mark India’s first appearance in table tennis team events at the Olympics since it was introduced into the program during the 2008 Beijing Games. “India qualifies for the team event at the Olympics. Something I have wanted to do for a long time,” tweeted Indian veteran Achanta Sharath Kamal, who will compete at his fifth Olympics in Paris. The team qualification also means that India will also have two representations each in both men’s and women’s singles in Paris, as all qualified teams are allocated two quota places in the individual events. Earlier, the Indian men’s and women’s team had missed out on direct qualification quota to the Paris Olympics as both teams crashed out in the Round of 16 at the World Team Table Tennis Championships in Busan last month. The display at the global event, however, helped the Indian teams to better their ranking points and qualify via the world ranking reallocation slot.",
        "url": "https://scroll.in/field/1064693/table-tennis-indian-men-and-womens-teams-qualify-for-2024-paris-olympics",
        "image": "https://sc0.blr1.cdn.digitaloceanspaces.com/article/194287-smiqtmsuch-1695311934.jpg",
        "publish_date": "2024-03-04 13:29:00",
        "author": "Scroll Staff",
        "authors": [
            "Scroll Staff"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.297
    },
    {
        "id": 197858483,
        "title": "ITV Dancing on Ice fans spot major omission in final as they say 'she would have won",
        "text": "Dancing on Ice fans were left confused as they spotted a major omission from the final while also saying 'she would have won' after being reminded over the 'Class of 2024'. The ITV skating competition's latest run came to a spectacular end on Sunday night (March 10) despite some last-minute drama. At the start of the show, Made In Chelsea star Miles Nazaire, broadcaster Adele Roberts and former Coronation Street actor Ryan Thomas, were introduced to the rink by presenters Holly Willoughby and Stephen Mulhern before they competed for one last time in the show. However, fourth finalist Greg Rutherford was missing after he had to pull out of the contest just hours before the final after suffering a \"significant injury\" during rehearsals. Holly said everyone was \"completely gutted\" over the news while Stephen said he was \"so sorry\" for Greg and his partner Vanessa James and sent him well wishes. READ MORE: ITV Dancing on Ice fans say 'someone please' over Holly Willoughby distraction Join our WhatsApp Top Stories and Breaking News group by clicking this link The show then had to carry on without him and the three finalists and their professional skating partners each performed a routine that they hoped would see them lift the trophy at the end of the night. The voting lines then closed an hour into the show for the first time and the third-place couple was announced as former BBC Radio 1 DJ Adele and skating partner Mark Hanretty. With the voting lines re-opened for once last time, Miles and Ryan were then both left to perform routines inspired by Jayne Torvill and Christopher Dean's famous Bolero, which this year marks 40 years since it was performed at the 1984 Winter Olympics in Sarajevo, in a bid to be crowned the winner of Dancing On Ice. But before the results, there was time for the stars of the 2024 series to return to the ice with the likes of boxer Ricky Hatton, Corrie actress Claire Sweeney, Olympic ski jumper Eddie 'the Eagle' Edwards and West End star all having one last chance to show off on the show. However, Dancing on Ice viewers were distracted by former S Club 7 star Hannah Spearritt who wasn't skating on the last night of the series. @emmaa_w asked: \"Where was Hannah? Why wasn’t she in the group skate? #DancingOnIce.\" @SandieJ3 echoed: \"I wonder why didn't Hannah & Andy skate back on the ice? #DancingOnIce.\" @xxncisaddictxx added: \"Weird how Hannah was missing when it came time to bring back this year's celebs #DancingOnIce.\" Meanwhile, others were distracted by Amber and felt she could have won the show if she'd not lost her place in the competition during the semi-final. @Caitlyyynx said: \"Honestly think if Amber had been given choreography that actually showed off her skating skill other cramming in lifts then she could have won #DancingOnIce.\" @dylanthomas91 shared: \"@Amber_Davies7 was my winner of #DancingOnIce.\" @sophiekelly4321 commented: \"@Amber_Davies7 was robbed this year!!! Fave from the beginning #DancingOnIce.\" @naomixoxox123 added: \"Still baffles me how Amber didn’t make it to the final #DancingOnIce.\"",
        "url": "https://www.manchestereveningnews.co.uk/news/tv/itv-dancing-ice-fans-spot-28793345",
        "image": "https://i2-prod.manchestereveningnews.co.uk/incoming/article28793448.ece/ALTERNATES/s1200/2_JSR_MEN_110324_DOI_02.jpg",
        "publish_date": "2024-03-11 10:50:02",
        "author": "Jessica Sansome",
        "authors": [
            "Jessica Sansome"
        ],
        "language": "en",
        "source_country": "gb",
        "sentiment": 0.33
    },
    {
        "id": 196807315,
        "title": "Goulburn's Carmel Halder retires after 42 years at Sts Peter and Paul's Primary",
        "text": "A long spell lasting almost half a century came to an end recently for a primary school teacher. Carmel Halder retired from Sts Peter and Paul's Primary after 42 years at the Catholic school and celebrated her career with a retirement lunch at Pavilion Cafe on Saturday, February 24 with staff, friends and family. \"It's been wonderful working for the last 42 years,\" Ms Halder said. \"It's great to retire and move onto different things.\" The mother of four, whose children all attended the school before moving onto Trinity Catholic College, said the most rewarding part about her time teaching was the camaraderie that came out of it. \"It's been great to be part of the school because it's all a big family,\" Ms Halder said. \"A lot of good friends and acquaintances came out of it for me too and it's been a really good time.\" Although she was excited to see what life had in store for her post teaching, Ms Halder said there were a couple of things she would miss. \"I'm going to miss the staff and the social side of things, but I'll miss being a classroom teacher because it was a very special time,\" she said. With teaching being a sought after profession, Ms Halder had some advice for those wanting to take it up as a career. \"If you want to be a teacher and that's your passion, you should try it because it's very rewarding,\" she said. \"Some days will be hard, but it's an important profession because you're molding young minds.\" Carmel Halder is still involved with the school one day a week as she works as a kindergarten to year two librarian.",
        "url": "https://www.goulburnpost.com.au/story/8533407/goulburns-carmel-halder-retires-after-42-years-at-sts-peter-and-pauls-primary/?src=rss",
        "image": "/images/transform/v1/crop/frm/vQaZ3anPUuND9nFzbQxA35/641b175c-b815-4ae0-82ac-412c4fa360fc.JPG/r427_569_5142_3712_w5568_h3712_fmax.jpg",
        "publish_date": "2024-03-07 08:11:00",
        "author": "Burney Wong",
        "authors": [
            "Burney Wong"
        ],
        "language": "en",
        "source_country": "au",
        "sentiment": 0.556
    },
    {
        "id": 185664803,
        "title": "Reigning champion Kostecki set for shock Erebus exit",
        "text": "Camera IconSupercars champion Brodie Kostecki is reportedly on the verge of quitting Erebus Motorsport. (HANDOUT/EDGE PHOTOGRAPHICS) Credit: AAP Reigning champion Kostecki set for shock Erebus exit Alex MitchellAAPJanuary 30, 2024 1:10PM Topics Share to FacebookShare to TwitterEmail UsCopy the Link",
        "url": "https://www.perthnow.com.au/sport/motorsport/reigning-champion-kostecki-set-for-shock-erebus-exit-c-13405809",
        "image": "https://images.perthnow.com.au/publication/C-13405809/5ba85b93672aa2b75e8d31dbb7ad29a75ff4de2a-16x9-x0y0w1280h720.jpg?imwidth=1200",
        "publish_date": "2024-01-30 06:10:44",
        "author": "Alex Mitchell, Alex MitchellAAP",
        "authors": [
            "Alex Mitchell",
            "Alex MitchellAAP"
        ],
        "language": "en",
        "source_country": "au",
        "sentiment": 0.537
    },
    {
        "id": 193822525,
        "title": "HMS Protector solidarity visit to Ukraine's Vernadsky Antarctic base — MercoPress",
        "text": "HMS Protector solidarity visit to Ukraine's Vernadsky Antarctic base On the two year anniversary of the Russian invasion of Ukraine, Royal Navy Ice Patrol HMS Protector visited the Vernadsky Base to express support and discuss how Ukraine and the UK are supporting peaceful scientific cooperation in Antarctica. Saturday 24 February, two years on since Russia’s illegal war in Ukraine, it was also an opportunity for Protector sailors and the team based there to share the stories of their families in their war-torn home and how some of the scientists plan to serve when they return to their motherland. Protector’s Commanding Officer, Captain Tom Weaver, said: “It was a privilege to be able to visit our Ukrainian friends at Vernadsky. “From the moment we approached the base to see the flag of Ukraine and the Union Flag hoisted together, we received the warmest of welcomes and a fascinating insight into the work they do. “I was humbled by the scientists’ stories of families back in Ukraine in places such as Kharkiv, and by the willingness to serve their country on returning from Antarctica.” Captain Weaver and his team were given a tour of the base – located on Galindez Island off the west coast of the Antarctic Peninsula. Vernadsky Research Base, formerly the British Faraday Station, has been operating since 1954, conducting vital research in fields such as meteorology, glaciology, and atmospheric chemistry. The base is renowned for its contributions to understanding climate change and its impact on the Antarctic region. It was originally established as the British Antarctic Survey’s Faraday Station but was transferred to Ukraine under a Memorandum of Understanding between the British Antarctic Survey and the State Institution National Antarctic Scientific Centre of Ukraine in early 1996. Leading Engineering Technician (LET) Callum MacNeil, who was also part of the base visit team, said: “The base visit to Vernadsky Base was like stepping into a living museum of British and Ukrainian Antarctic exploration. “I couldn’t help but feel a deep admiration for the legacy of exploration and discover that the British Faraday Station, now Vernadsky Base, represents.” He added: “Even the cozy confines of the wooden bar, a remarkable structure crafted from wood originally intended for a pier, a reminder of the ingenuity and resourcefulness of the early Antarctic explorers.” HMS Protector is currently deployed to the Antarctic region promoting British interests in the area in line with our Antarctic Treaty obligations, by working with partners including the UK Hydrographic Office (UKHO), British Antarctic Survey (BAS), UK Antarctic Heritage Trust (UKAHT) and the governments of the Falkland Islands, South Georgia and South Sandwich Islands.",
        "url": "https://en.mercopress.com/2024/02/26/hms-protector-solidarity-visit-to-ukraine-s-vernadsky-antarctic-base",
        "image": "https://en.mercopress.com/data/cache/noticias/98550/600x315/ukukr.jpg",
        "publish_date": "2024-02-26 12:21:00",
        "authors": [],
        "language": "en",
        "source_country": "uy",
        "sentiment": 0.466
    },
    {
        "id": 189126125,
        "title": "From Khesari Lal to Monalisa: Big Boss Changed the Fate of These Bhojpuri Stars",
        "text": "This list includes some prominent names from the Bhojpuri industry who have also ventured into politics in today's date..1. Ravi KishanThe first name on this list is none other than the Bhojpuri superstar, Ravi Kishan. Ravi Kishan made his presence felt in the very first season of the show, where he was among the top runners-up..2. Sambhavna SethIn the second season of Bigg Boss, Sambhavna Seth made her entry. She created quite a stir on the show. After exiting the show, the actress's life underwent a complete transformation..3. Manoj TiwariIn the fourth season of Bigg Boss, Manoj Tiwari was seen. Although he didn't win the show's trophy, he gained considerable popularity from it. His altercation with Dolly Bindra during the show remained in the limelight..4. MonalisaSalman Khan's show Bigg Boss Season 10 was a life-changing experience for Monalisa. She was the first contestant to find her life partner and get married on the Bigg Boss set..5. Vikrant SinghIn the 10th season of Bigg Boss, Vikrant Singh also remained in the limelight along with Monalisa. Their wedding made headlines during the show..6. Akshara SinghBhojpuri industry's queen, Akshara Singh, has also been a part of this popular reality show. She appeared in the first season of Bigg Boss OTT, where her strong personality made headlines. After exiting the show, the actress gained a distinct identity..7. Khesari Lal YadavThe show \"Bigg Boss 13\" was one of the most talked-about seasons. In this season, Bhojpuri star Khesari Lal Yadav made an appearance. After exiting the show, he achieved great success, and the entire country started to recognize him..8. Dinesh Lal YadavAfter participating in Bigg Boss, Dinesh Lal Yadav, also known as Nirahua, saw a significant increase in demand. As of today, he is not only an excellent actor but also a Member of Parliament for the BJP..Meet Mesmerizing Mother-Daughter Pairs in Bollywood",
        "url": "https://www.sinceindependence.com/ampstories/web-stories/from-khesari-lal-to-monalisa-big-boss-changed-the-fate-of-these-bhojpuri-stars",
        "image": "https://media.assettype.com/sinceindependence/2024-02/566c8425-596e-4b8e-84be-759c3b8eadad/WhatsApp_Image_2024_02_10_at_1_05_38_PM.jpeg?w=1200&h=675&auto=format%2Ccompress&fit=max&enlarge=true",
        "publish_date": "2024-02-10 14:11:09",
        "author": "Since Independenc, Since Independence",
        "authors": [
            "Since Independenc",
            "Since Independence"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.358
    },
    {
        "id": 153182343,
        "title": "The Ukraine syndrome: Why Western leaders can’t stop visiting wartime Israel",
        "text": "Israelis who blinked on Thursday missed the fleeting visit of British Prime Minister Rishi Sunak to Jerusalem, and as Shabbat ended his Italian counterpart Giorgia Meloni flitted through as well. Meanwhile, we’re being told to expect French President Emmanuel Macron on Tuesday.",
        "url": "https://www.haaretz.com/israel-news/2023-10-22/ty-article/.premium/the-ukraine-syndrome-why-western-leaders-cant-stop-visiting-wartime-israel/0000018b-569b-dc3c-a5df-debb06080000",
        "image": "https://img.haarets.co.il/bs/0000018b-56aa-d1d7-ab8b-7efad44f0001/48/29/8f95af164ddfac70b625aa0036b1/biden.jpg?precrop=3118,1813,x76,y0&height=630&width=1200",
        "publish_date": "2023-10-22 15:06:35",
        "author": "Anshel Pfeffer, Attorney Rakefet Shfaim",
        "authors": [
            "Anshel Pfeffer",
            "Attorney Rakefet Shfaim"
        ],
        "language": "en",
        "source_country": "il",
        "sentiment": 0.399
    },
    {
        "id": 159059615,
        "title": "Former NFL cornerback D.J. Hayden and 5 others killed in crash in downtown Houston",
        "text": "A crash at a red light killed six people including former NFL cornerback D.J. Hayden in downtown Houston early Saturday. The two-vehicle crash occurred about 2 a.m. when a Chrysler 300, apparently “going very fast, high velocity,\" ran the red light and collided with an SUV, Houston Police Assistant Chief Megan Howard said. Five men and one woman died, including Hayden, the Houston Chronicle reported. Four people were pronounced dead at the scene. Those killed included the driver of the Chrysler and a man who appeared to be homeless, Howard said. Four people were taken to the hospital and two of them died, Howard said, while one female passenger was in critical condition with life-threatening injuries. Police interviewed a male passenger from the SUV at the hospital. Investigators were working to identify the driver of the SUV, Howard said. Hayden, 33, was born in Houston and starred at the University of Houston, according to his profile page on ESPN.com. A first-round draft pick in 2013, he played in eight seasons through 2020 for the Oakland Raiders, Detroit Lions and Jacksonville Jaguars. “D.J.’s courage, perseverance, and dedication to his teammates will be fondly remembered by everyone who knew him,” the Raiders, now based in Las Vegas, said Saturday in a statement. “The prayers of the entire Raider Nation are with D.J.'s loved ones at this time.” In 2012, Hayden survived and later recovered from a near-death tear to a major vein by his heart after he and a teammate collided during practice, requiring emergency surgery.",
        "url": "https://www.nbcmiami.com/news/national-international/former-nfl-cornerback-d-j-hayden-and-5-others-killed-in-crash-in-downtown-houston/3157229/",
        "image": "https://media.nbcmiami.com/2023/11/AP23315735696501-1.jpg?quality=85&strip=all&fit=4300%2C2867",
        "publish_date": "2023-11-12 02:29:39",
        "authors": [],
        "language": "en",
        "source_country": "us",
        "sentiment": 0.368
    },
    {
        "id": 185794079,
        "title": "Piyush Goyal Urges Unicorn Collaboration For Startup Capital Access",
        "text": "New Delhi: Union commerce and industry minister Piyush Goyal on Tuesday urged the unicorns to come together and set up a unicorn club or association that would come up with solutions for access to capital for start-ups in the country. His statement came after the recently held Start-up India Innovation Week and chaired a unicorn roundtable to celebrate the growth of the unicorns and chart a collaborative way forward to support the growth of more unicorns in India.However, a statement issued by the commerce ministry said that over 40 participating unicorns highlighted their learnings from their experience, factors that enabled their growth, and identified areas to boost the growth of the Indian ecosystem that can help the nation emerge as a global start-up leader. During the meeting, all the conversation focused on streamlining regulatory processes to foster a more start-up friendly environment, increasing access in tier-2/3 cities and learning from the best practices set up by financial institutions in the private sector.Notably, the department for promotion of industry and internal trade (DPIIT), this year, celebrated the coming together of the country’s key start-ups, entrepreneurs, investors, policy makers and other stakeholders on innovation and entrepreneurship across the country from January 10–18.During the Start-up India Innovation Week, over 75 physical events served as a catalyst for entrepreneurship, showcasing India’s thriving ecosystem and igniting the dreams of countless aspiring founders. From workshops empowering women entrepreneurs to training grounds for incubator champions, the week saw mentors and mantees sharing wisdom, igniting the minds of aspiring pioneers.",
        "url": "https://www.deccanchronicle.com/business/piyush-goyal-urges-unicorn-collaboration-for-startup-capital-access-880453",
        "image": "https://www.deccanchronicle.com/h-upload/2024/01/30/1073378-1.jpg",
        "publish_date": "2024-01-30 16:14:16",
        "author": "DC Corresponde, DC Correspondent",
        "authors": [
            "DC Corresponde",
            "DC Correspondent"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.73
    },
    {
        "id": 172626343,
        "title": "Significance of Christmas Carols,Santa Claus and Christmas Tree",
        "text": "Christmas Carols Christmas is synonymous with traditional songs called carols. ‘Deck the halls’, ‘Rudolph the red-nosed reindeer’, ‘It came upon a midnight clear’, etc. These are all songs that are sung only at Christmas time. They are popularly known as Christmas carols. The tradition of singing Christmas carols can be traced back to the thirteenth century. Here are some more facts about these songs. Origin of Carols ‘Carol’ refers to a song that is sung at festival times. The carol itself can have religiously oriented lyrics but is not necessarily a part of church worship. Most carols are joyful songs with quick beats. They may be about a popular character or about a particular festive event. Carols are not exclusive to Christmas. Traditionally, carols were sung at other times like Easter, during the harvest season, etc. However, with time, these songs have diminished in number. Today carols related to Christmas make up the biggest group of these songs. The word ‘carol’ is derived from the Latin word ‘choraula’. It literally means a dance performed in a circle, accompanied by singing. From the 1100s to the 1350s, carols were purely dance songs, during festival celebrations. Later on, they started to be used during religious processions, and in church plays. Source : https://www.indiaparenting.com/the-history-of-christmas-carols.html Santa Claus Ho! Ho! Ho! Who is Santa Claus? Where did he come from? Apparently Santa Claus had his origins in a Turkish bishop named Nicholas who later became St. Nicholas. Legend has it that he gave gifts to people in need and this somehow evolved into gift giving on a specific winter day. Later, that day (or at least a specific day–December 25th) became Christmas Day for the Christians. The Dutch established the custom of celebrating St. Nicholas on his feast day, December 6th, by exchanging gifts. They brought the custom to the new world and English settlers began to pick up on it. The English-speaking children couldn’t pronounce Sinterklaas (the Dutch name for St. Nicholas) correctly. Instead it came out as Santa Claus. The English, being smart parents and not wanting to have to give gifts on two days, quickly associated Santa Claus with Christmas Day. Interestingly, St. Nicholas/Santa Claus was originally pictured with a noble-like appearance, wearing Bishop’s robes and riding a white horse–no sleigh, no reindeer. However, in 1809 the famous American author Washington Irving published a book which changed him from tall and thin and posed to short and stout and jolly. The change stuck and in 1823 was forever etched into tradition when Clement Moore wrote a poem that starts out: “Twas the night before Christmas…” Our current image of Santa Claus dates to the 1863-1886 era when a cartoonist for Harpers Weekly magazine, Thomas Nast, drew up a series of images of the short and stout and jolly version of Santa with a white beard and a red suit. Over the years Nast added such embellishments as a workshop, and, of course, illustrated Clement Moore’s sleigh and eight tiny reindeer. https://pinesteadchristmastrees.com/santa-claus-history Christmas Tree The Christmas tree is considered as the symbol of eternal life. It is believed that the tradition of putting up the Christmas tree first started in Germany, after which it came to the UK in the 1830s. The legend also has that after the birth of Jesus Christ in the winter season, some of the trees shook off the snow and turned green to mark the great event. Thus, the Christmas tree represents permanence and immortality.- different article As mentioned above, Christmas day was celebrated by pagan cultures as part of solstice celebrations where they decorated their homes in green with a desire to bring prosperity and spring. Those trees remain unaffected during winters and darkest days, so they were believed to hold special powers. The Romans also decorated their homes with Fir trees to celebrate Saturnalia and decorated them with embellishments. Some evidence also shows the Greeks decorating their trees in honour of their God. The tradition started in Central Europe, especially in Estonia, Germany and (Livonia (now Latvia), where Protestant Christians would bring decorated trees into their homes. They used to garnish the tree with paper roses, apples, wafers, shiny metal strips, and candies. Moravian Christians started the practice of lighting up Christmas trees with candles, which were replaced by electric Christmas lights as time passed. Nowadays, people use a mix of traditional and modern decorations like garlands, round ornaments, shiny metal strips, and candy canes. Many people place an angel or star at the top of the tree to symbolize the Angel Gabriel or the Star of Bethlehem from the birth story of Jesus. Tasty treats such as gingerbread, chocolate, and other candies are also favorites, and are tied to the tree branches using ribbons. https://www.tring.co.in/blog/significance-of-christmas-tree",
        "url": "https://www.dailyexcelsior.com/significance-of-christmas-carolssanta-claus-and-christmas-tree/",
        "image": "https://cdndailyexcelsior.b-cdn.net/wp-content/uploads/2023/12/a-4.jpg",
        "publish_date": "2023-12-23 20:10:12",
        "author": "Daily Excelsior",
        "authors": [
            "Daily Excelsior"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.409
    },
    {
        "id": 173723879,
        "title": "From Britney to Germán Bringas: the best old music our writers discovered in 2023",
        "text": "Slapp Happy – Sort of Slapp Happy’s 1972 debut album is a curious thing. It was recorded at Faust’s Wümme studios, with the krautrock legends acting as backing band, but it sounds absolutely nothing like krautrock. It was intended as a joke – a sarcastic response to experimental musician Anthony Moore’s record label demanding something more commercial – but carries no audible trace of the smug condescension that implies. Instead, it exists in an unplaceable space of its own creation. Its melodies stick with you – the fabulous Blue Flower was covered on Mazzy Star’s 1990 debut album She Hangs Brightly – its air of oddness feels unaffected, Dagmar Krause’s voice is a plaintive delight: pop music made by minds untethered to accepted notions of pop. Alexis Petridis WAT – World According To Just when you think there couldn’t possibly be another early 80s band at the intersection of post-punk and new wave with tinny drum machines, aloof female vocals and guitars seemingly recorded in a public toilet, it turns out there’s another – and the trio WAT, operational in Dutch city Eindhoven from 1983-1985, are a really good one. There’s something of Young Marble Giants’ Alison Statton to Ankie Keultjes’ wistful yet steely vocals, but the arrangements are way more maximalist, clearly also drawing from the jangling British indie of the time – Thin Blue Notes is like a great lost Smiths song. Their best tunes were gathered up this year on a compilation by Belgian label Stroom (who just had an underground hit with the brilliant Voice Actor). Ben Beaumont-Thomas Germán Bringas – Tunel Hacia Tí One of the best things about interviewing musicians from far-flung music scenes is asking them for local recommendations. After I spoke to Guatemalan cellist Mabe Fratti this autumn, I received a WhatsApp volley of enthusiastic tips from her adopted community in Mexico City – and discovered a new obsession in jazz multi-instrumentalist Germán Bringas (who also runs the club and improv cornerstone Jazzorca). Tunel Hacia Tí (tunnel towards you) is a compilation of his work from 1991 to 2000, and it spans parched spiritual vistas, lunar lounge music, squalling trumpet tantrums as dry as the desert earth, doomed kalimba hoedowns. It could live on ECM; it also variously summons visions of the intricacies of Beatrice Dillon’s music put through Oneohtrix Point Never’s warped filter. Wigged-out abstractions are followed by moments of sublime melody – I had to check that Caminatas, with its devastating, lilting, intensifying keys-and-trumpet refrain, wasn’t a cover, it sounds that classic. Everyone I’ve introduced him to has become equally obsessed: welcome to the Germán hive. Laura Snapes Britney Spears I wasn’t a Britney fan when she launched in 1999. Three years earlier, I’d been radicalised by the Spice Girls, and the lyrics to Born to Make You Happy offended my newly minted feminist sensibility. Recently, my return to the gym after a brief pause (2017-2023) has caused me to revisit her back catalogue. My favourite track is Stronger, which announces itself with a foghorn and only gets more demented from there, her hiccuping vocals declaring independence over a crunchy industrial beat. Where previous singles … Baby One More Timewere passive, Stronger sees her fully empowered, and I credit its energising power with at least 70% of my lifting capabilities. She’s stronger than yesterday; we both are. Joe Stone Pulp – Death Comes to Town In his recent memoir, So It Started There, drummer Nick Banks calls Death Comes to Town “the greatest lost Pulp track ever”. Written in their pre-fame 80s using a keyboard’s “disco” setting, the song was mysteriously abandoned during the sessions for troubled third album Separations. A remix called Death Goes to the Disco appeared on the B-side of 1991’s Countdown and the superior original eventually limped out on the album’s 2012 reissue, but it deserves a wider hearing. The hook is instantly infectious, Jarvis Cocker’s lyrics are a gateway to adventure (“Tonight’s the night, open your door and I will come inside …”) and the chorus and “la la las” are just made for giddily punching the air. Perhaps if they’d written it later, it would have been another Common People. Dave Simpson Billy Idol – Rebel Yell Has anyone ever displayed as much aryan beauty as Billy Idol, shirtless on the cover of Rebel Yell? Maybe Bowie. Maybe. I ask because the image has been glued to my phone all year as I’ve played and hummed along to the eerie synth and pulsating bassline of Eyes Without a Face, the album’s hit single. I first discovered it at my barber’s, where tattooed Italians inexplicably subsist on a diet of early 80s new wave and golden era hip-hop – perfect. Gloriously, I’ve also been able to share my love of Idol with friends, as the track re-emerged on TikTok this year, allowing a new generation to enjoy this chunk of new wave perfection with ethereal French backing vocals and a rap-rock middle section to boot. It’s as if Idol attempted to both condense – and pre-empt – the decade’s defining trends into one heartbreaking tale of a deteriorating relationship. Sasha Mistlin Organic Grooves with William Parker and Hamid Drake – Black Cherry Earlier this year, I was watching Moroccan gnawa master Majid Bekkas play. As he laid down an earthy groove on the three-string gimbri, it was his drummer Hamid Drake that caught my attention. Hitting fluid, minimal rhythms that held time often with just a single rimshot, Drake’s rooted approach to the kit was unique. He has worked with jazz luminaries including Don Cherry and Pharoah Sanders, but it was Black Cherry – a remix album of a 1997 duet with free jazz bassist William Parker by production collective Organic Grooves – that soon moved on to regular rotation in my household. Through layering dub effects, sub-frequencies and electronic beats, Black Cherry amplifies Drake’s meandering rhythms, giving them added weight for the dancefloor. Best played loud for full immersion. Ammar Kalia Maanam As the cliche goes; you don’t know what you’ve got until it’s gone. In July, after stumbling on a tribute marking the fifth anniversary of the death of Olga Jackowska – AKA Maanam’s Kora – I delved into the Polish band’s discography. They were mostly known for their gritty, energised, guitar-centric post-punk sound, embodied by their 1989 single Sie Ściemnia. But before that, they had softer, acoustic beginnings: from 1980, the seven-and-a-half-minute Szał Niebieskich Ciał offers crooning vocals, experimental synthesiser, edgy guitar riffs, and deeply emotional lyrics. Based on the blues scale but with a new wave flavour, it’s sad yet somehow not depressing: Kora’s warbling voice laments about the planets for the first five minutes, before a textured guitar solo takes you into a state of spaced-out wonderment. Aneesa Ahmed Gillian Welch – Everything Is Free I came across Everything Is Free via Father John Misty’s cover in the Spotify Studio sessions. It’s an ironic introduction for a song written and recorded by Gillian Welch in 2001, as a damning indictment of Napster and the then-emerging era of music piracy. Its lyrics leapt out at me for their ambivalence, and even anger: “Everything I’ve ever done, got to give it away … We’re going to do it anyway, even if it doesn’t pay.” Twenty years later, streaming may be legal, but artists are still not fairly compensated, and Welch’s song has emerged as a contemporary folk standard, covered by Courtney Barnett, Phoebe Bridgers and more. I love the turn in the song’s final verse, where Welch threatens her withdrawal from an exploitative system: “I don’t need to run around / I’ll just stay home … If there’s something that you want to hear, you can sing it yourself.” Elle Hunt Metallica – Ride the Lightning Ahead of Metallica’s “no repeats” double headliner duties at Download, a friend (and James Hetfield superfan) made me a playlist of songs beyond the band’s obvious classics. One of them, Creeping Death, got me stuck on their ferocious second album. Nuclear war, biblical plagues, capital punishment, suicidal depression: Ride the Lightning harnesses full-body fears to generate breathtaking power. Charged by the nightmares of literary greats (including King and Hemingway), the 80s thrash metal classic is half bravado, half total terror, and still dangerously potent. Back in June, when Metallica hammered through the album’s brutally claustrophobic title track, Ride the Lightning felt brand new. Katie Hawthorne The Mountain Goats – Dance Music Where to start with the Mountain Goats and their 971 albums: a concept album about goths, you say? An LP with alternative Swedish titles? I didn’t know, so I wrote them off as too tough a nut to crack. More fool me. It was this tale of fear and loathing in San Luis Obispo that finally did it. John Darnielle rap-sings his way, Subterranean Homesick Blues style, through a real-life tale of domestic abuse, childhood anxiety and the struggles with hard drugs that followed. Within it he includes a perfect encapsulation of music’s potential for escapism. As his stepfather hurls a glass at his mum and a screaming row ensues, Darnielle scurries upstairs to the safety of his record player and realises: “So this is what the volume knob’s for.” Tim Jonze",
        "url": "https://www.theguardian.com/music/2023/dec/26/best-old-music-our-writers-discovered-this-year-2023",
        "image": "https://i.guim.co.uk/img/media/32358b03fefaf23f839dc29d7650cd4e8f819f91/1_0_4999_3000/master/4999.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmY",
        "publish_date": "2023-12-26 19:00:43",
        "author": "Alexis Petridis, Ammar Kalia, Aneesa Ahmed, Ben Beaumont-Thomas, Dave Simpson, Elle Hunt, Katie Hawthorne, Laura Snapes and Joe Stone, Sasha Mistlin, Tim Jonze",
        "authors": [
            "Alexis Petridis",
            "Ammar Kalia",
            "Aneesa Ahmed",
            "Ben Beaumont-Thomas",
            "Dave Simpson",
            "Elle Hunt",
            "Katie Hawthorne",
            "Laura Snapes and Joe Stone",
            "Sasha Mistlin",
            "Tim Jonze"
        ],
        "language": "en",
        "source_country": "us",
        "sentiment": 0.524
    },
    {
        "id": 166039791,
        "title": "Republican John Curtis Supports Climate Change Ideology as He Flirts with Potential Senate Bid",
        "text": "Republican Rep. John Curtis (R-UT) is an ardent supporter of climate change ideology, a radical position that seeks to reshape the American economy from capitalism to socialism. Curtis’s radical position on global warming is an issue that will likely play a key role during his potential bid for the U.S. Senate in Utah, a traditionally red state. He called fighting climate change his “North Star” and believes many conservatives are science “deniers.” Curtis believes climate change is a serious threat. He led a delegation of House Republicans to the UN’s COP27 in 2022 and is planning another delegation of House Republicans to COP28. UN climate conferences are geared towards eliminating fossil fuels. Curtis also joined far-left dark money groups like Earthjustice and the National Resource Defense Council in sponsoring legislation that blamed the weather on “climate change.” “The same policy that is best for our environment is the same policy that is also best for national security, energy independence, agriculture and our economy,” Curtis recently posted on X. Curtis said in October he would not run for Senate and would stay in the House, but after Sen. Mitt Romney (R-UT) announced his retirement, Curtis told KUTV 2 News he was reconsidering: The drumbeat from Utahns around the state asking me to reconsider my decision last month to stay out of the Senate race has been constant and consistent. These voices, getting louder, and more organized, are increasingly difficult to ignore. Because so many Utahns have asked me to, I’m taking a fresh look. As part of that evaluation, I’m considering not only what is best for me and my family but what’s best for my current district and for our state. I’m counseling with friends, supporters, and my team. The same policy that is best for our environment is the same policy that is also best for national security, energy independence, agriculture and our economy. Conservatives are at the climate table. https://t.co/kr5O27Gdxo — Rep. John Curtis (@RepJohnCurtis) September 9, 2023 Follow Wendell Husebø on “X” @WendellHusebø. He is the author of Politics of Slave Morality.",
        "url": "https://www.breitbart.com/politics/2023/12/01/republican-john-curtis-supports-climate-change-ideology-as-he-flirts-with-potential-senate-bid/",
        "image": "https://media.breitbart.com/media/2023/12/john-curtis-640x335.jpeg",
        "publish_date": "2023-12-04 14:25:44",
        "author": "Wendell Husebø",
        "authors": [
            "Wendell Husebø"
        ],
        "language": "en",
        "source_country": "us",
        "sentiment": 0.334
    },
    {
        "id": 169845749,
        "title": "More than 100 injured in a Beijing rail collision as heavy snow hits the Chinese capital",
        "text": "Shopping Trends The Shopping Trends team is independent of the journalists at CTV News. We may earn a commission when you use our links to shop. Read about us. Gifts 20 Self-Care Goodies You'll Want To Gift Your Most Stressed-Out Friends And Family Members 8 Gifts Under $25 They Won’t Be Tempted to Regift 21 Gift Add-Ons And Stocking Stuffers That Won't End Up In Their Junk Drawer Editor's Picks We Tested Out the Best Laptops, and Here Are Our Honest Opinions 17 Beauty Staples Under $25 You’ll Want To Order Before New Year’s Eve Our Guide to the Best Treadmills in Canada in 2023 (And Where to Get Them) Home Our Guide to the Best Office Chairs in Canada in 2023 (And Where to Get Them) Our Guide to the Best Humidifiers in Canada in 2023 (And Where to Get Them) We Tested Out the Best Cordless Vacuums, and Here Are Our Honest Opinions Deals Boxing Day Is A Few Weeks Away, But You Can Already Snag These Deals On Amazon Canada Here Are All The Best Deals You'll Find On Amazon Canada This Week Black Friday And Cyber Monday May Be Over, But You Can Still Take Advantage Of These Amazing Deals MORE WORLD NEWS U.K. police 'overjoyed' that British teen missing for 6 years has been found in France Bull on tracks disrupts trains between Newark and New York Hungary's Orban says he won't hesitate to slam the brakes on Ukraine's EU membership Denmark widens terror investigation that coincides with arrests of alleged Hamas members in Germany Ballistic missile fired from rebel-held Yemen strikes cargo ship in Red Sea after earlier attack More than 100 injured in a Beijing rail collision as heavy snow hits the Chinese capital Boy, 13, charged after allegedly planning mass shooting in a synagogue California regulators vote to extend Diablo Canyon nuclear plant operations through 2030 CTVNews.ca Top Stories Amid flu season increases and new research on lasting 'long flu' impacts, experts urge flu shot uptake As flu season sweeps across Canada and new research suggests the disease could come with a more long-term burden for some, health officials and experts are reminding the public of the importance of getting your shot. AGING IN CANADA AGING IN CANADA | Communal living, senior-friendly neighbourhoods: Experts say housing innovations needed as Canadians age Canada's senior population is projected to see unprecedented growth in the coming decades, and experts say new housing strategies are badly needed, including improving and expanding support for those who choose to grow old at home, and rethinking how entire neighbourhoods are built. U.K. police 'overjoyed' that British teen missing for 6 years has been found in France U.K. police said Friday that they are 'relieved and overjoyed' to learn that a teenager found walking along a road in southwestern France is a British boy who went missing six years ago. Liberal gun control bill passes Senate, poised to become law The federal Liberal government's contentious gun control legislation Bill C-21 passed the Senate without changes on Thursday and is now poised to become law. Many Canadians have had long COVID for almost 4 years. Researchers say there's hope Forty-two per cent of the people in Canada reporting lasting symptoms had them for a year or more, but Canadian doctors and scientists want long COVID patients to know that research is accelerating. Montreal-area man finds year-old, $50,000 lottery ticket digging through Christmas decorations It's certainly going to be a Merry Christmas at the Labrie household this year. Mathieu Labrie was digging up his Christmas decorations on Nov. 29 when he discovered an old Celebration 2023 lottery ticket worth $50,000. Prince Harry hails court victory as 'great day for truth' after judge finds tabloid hacked his phone Prince Harry won his historic phone hacking lawsuit Friday against the publisher of the Daily Mirror and was awarded over 140,000 pounds (US$180,000) in the first of several lawsuits against British tabloids to go to trial in his battles with the press. $275K in fines for real estate agents who allowed fraudsters to sell B.C. home that wasn't theirs Four real estate agents and an associated brokerage have agreed to pay a combined $275,000 in penalties to the BC Financial Services Authority for their roles in facilitating a fraudulent transaction. Kid Rock says he is done boycotting Bud Light Kid Rock is changing his tune on Bud Light. He was one of the first people to declare a boycott on Bud Light after the beer brand briefly partnered with a transgender influencer, leading to a significant and lasting sales slump. Canada Many Canadians have had long COVID for almost 4 years. Researchers say there's hope Forty-two per cent of the people in Canada reporting lasting symptoms had them for a year or more, but Canadian doctors and scientists want long COVID patients to know that research is accelerating. Glen Assoun's daughter says probe of his wrongful conviction must become a priority The daughter of a wrongfully convicted Nova Scotia man says that even in death her father is being denied justice. 'I haven't done anything criminally wrong': Arrest warrant issued for 'crypto king' associate in Dubai An Ontario judge has ordered the arrest of an associate of the self-proclaimed ‘crypto king’ after he refused to surrender his passport and claimed he fled to Dubai instead. $275K in fines for real estate agents who allowed fraudsters to sell B.C. home that wasn't theirs Four real estate agents and an associated brokerage have agreed to pay a combined $275,000 in penalties to the BC Financial Services Authority for their roles in facilitating a fraudulent transaction. Fourth Calgarian arrested for terrorism-related offences in ongoing investigation A fourth person has been arrested in Calgary as part of an ongoing national security investigation related to terrorism-related posts on TikTok and other social media sites. Canada produced nearly a quarter of the global wildfire emissions in 2023: report Canada produced 23 per cent of the global wildfire carbon emissions for 2023, according to a new report by Copernicus, an environmental observation department of the European Union’s Space program. World U.K. police 'overjoyed' that British teen missing for 6 years has been found in France U.K. police said Friday that they are 'relieved and overjoyed' to learn that a teenager found walking along a road in southwestern France is a British boy who went missing six years ago. Bull on tracks disrupts trains between Newark and New York A loose bull on the tracks at a New Jersey train station snarled rail traffic on Thursday. The animal was off the tracks at Newark Penn Station by afternoon, New Jersey Transit said in a statement. The agency posted on X, formerly Twitter, a photo of the horned bovine standing on the tracks. Hungary's Orban says he won't hesitate to slam the brakes on Ukraine's EU membership Hungarian Prime Minister Viktor Orban said Friday his country will have plenty of opportunities in the future to interrupt Ukraine's process of joining the European Union, the day after the right-wing leader's stunning turnaround allowed an EU summit to move forward on bringing the war-torn country into the bloc. Denmark widens terror investigation that coincides with arrests of alleged Hamas members in Germany Denmark is holding two people in custody and four others are the target of a terrorism investigation, a prosecutor said Friday, in a case that coincided with one arrest in the Netherlands and several in Germany of alleged Hamas members. Ballistic missile fired from rebel-held Yemen strikes cargo ship in Red Sea after earlier attack A ballistic missile fired from rebel-held territory in Yemen struck a Liberian-flagged cargo ship Friday in the Red Sea near the Bab el-Mandeb Strait, setting the vessel ablaze, a U.S. defence official said. More than 100 injured in a Beijing rail collision as heavy snow hits the Chinese capital Two subway trains collided in heavy snow in Beijing, sending 515 people to the hospital, including 102 with broken bones, authorities said Friday. Politics Liberal gun control bill passes Senate, poised to become law The federal Liberal government's contentious gun control legislation Bill C-21 passed the Senate without changes on Thursday and is now poised to become law. Freeland hosts annual meeting with provincial, territorial counterparts today Finance Minister Chrystia Freeland is hosting her annual meeting of federal, provincial and territorial finance ministers in Toronto today. Liberals, NDP agree to new deadline to introduce pharmacare legislation After being unable to table — let alone pass — pharmacare framework legislation this year, the Liberals and New Democrats have agreed to a new deadline to present the bill: March 1, 2024. Health Amid flu season increases and new research on lasting 'long flu' impacts, experts urge flu shot uptake As flu season sweeps across Canada and new research suggests the disease could come with a more long-term burden for some, health officials and experts are reminding the public of the importance of getting your shot. Skin creams, workout supplements and Teslas: Here are the recalls of the week in Canada Health Canada and the Canadian Food Inspection Agency recalled various items this week, including more unauthorized skin lightening creams and workout supplements, while Transport Canada flagged an issue with tens of thousands of Teslas. Who qualifies for MAID in Canada? Federal government considers pausing expansion The federal government is considering whether to pause its original plan to broaden the rules that govern medically assisted dying so they include patients whose only underlying condition is a mental disorder. Sci-Tech Indigenous woolly dogs of B.C. were forced into extinction: study For thousands of years, a breed of white, woolly dog played an important and cultural role for Coast Salish people in Western Canada but when colonists moved in the animal quickly became extinct, a new study says. The Geminids meteor shower will be at its peak this week. Here's how you can see it It’s almost time for the annual light show that astronomers call one of the most impressive meteor showers of the year—the Geminids are set to be at their highest visibility this week, bringing hundreds of meteors streaking across the sky. Pope, once a victim of AI-generated imagery, calls for treaty to regulate artificial intelligence Pope Francis on Thursday called for an international treaty to ensure artificial intelligence is developed and used ethically, arguing that the risks of technology lacking human values of compassion, mercy, morality and forgiveness are too great. Entertainment Kid Rock says he is done boycotting Bud Light Kid Rock is changing his tune on Bud Light. He was one of the first people to declare a boycott on Bud Light after the beer brand briefly partnered with a transgender influencer, leading to a significant and lasting sales slump. Andre Braugher died from lung cancer, rep for 'Brooklyn Nine-Nine' and 'Homicide' star says Andre Braugher died from lung cancer, a representative said Thursday. Prince Harry hails court victory as 'great day for truth' after judge finds tabloid hacked his phone Prince Harry won his historic phone hacking lawsuit Friday against the publisher of the Daily Mirror and was awarded over 140,000 pounds (US$180,000) in the first of several lawsuits against British tabloids to go to trial in his battles with the press. Business Airbnb agrees to pay US$621 million to settle a tax dispute in Italy Short-term rental platform Airbnb has agreed to pay 576 million euros (US$621 million) to settle a years-long dispute over unpaid taxes in Italy but said it won't try to recover the money from its hosts. Amazon, Target and more will stop selling water beads marketed to kids due to rising safety concerns Three major retailers -- Amazon, Target and Walmart -- say they're suspending sales of water-bead products marketed to young children due to growing safety concerns. TREND LINE TREND LINE | How Canadians' fears about the economy translate to their spending habits Canadians are tightening their belts this holiday season, spending less overall than they did at the same time last year while worrying about how they will fare financially in 2024, according to new data from Nanos Research. Lifestyle Montreal-area man finds year-old, $50,000 lottery ticket digging through Christmas decorations It's certainly going to be a Merry Christmas at the Labrie household this year. Mathieu Labrie was digging up his Christmas decorations on Nov. 29 when he discovered an old Celebration 2023 lottery ticket worth $50,000. No turkey, no cannabis: Here's what to know about crossing the Canada-U.S. border during the holidays The Canada Border Services Agency is urging Canadians to be prepared before crossing the border ahead of one of the busiest travel periods of the year. Cat-lover Taylor Swift celebrated in B.C. SPCA fundraising drive The B.C. SPCA is riding Taylor Swift's coattails – or cat-tails? – with a fundraising campaign celebrating the animal-loving superstar being named TIME's 2023 Person of the Year. Sports Bianca Andreescu says her back isn't ready for the Australian Open Bianca Andreescu says she won't play in next month's Australian Open because of a nagging back injury. The 2019 U.S. Open champion from Mississauga, Ont., has been dealing with a stress fracture in her back since the summer. Ex-Jaguars employee could face up to 30 years in prison after pleading guilty to stealing more than US$22 million from team A former Jacksonville Jaguars employee could face up to 30 years in prison after pleading guilty to financial crimes which included stealing more than $22 million from the NFL team. Female soccer fans in Iran allowed into Tehran stadium for men's game. FIFA head praises progress Female soccer fans in Iran claimed a small win Thursday in their long campaign to be allowed into stadiums to watch men's games after decades of near total exclusion and harassment. Autos Transport Canada says Tesla recall will affect roughly 193,000 cars in Canada Tesla will recall 193,000 vehicles in Canada to address concerns about safeguards for its driver assistance system Autopilot after announcing a recall of 2.03 million vehicles for the issue in the United States, Transport Canada said Wednesday. U.S. agency takes first step to mandate anti-drunk driving technology U.S. auto safety regulators said on Tuesday they have begun the process that will eventually force carmakers to adopt new technology to prevent intoxicated drivers from starting vehicles. Tesla recalls nearly all vehicles sold in U.S. due to defective system Tesla is recalling nearly all vehicles sold in the U.S., more than 2 million, to update software and fix a defective system that's supposed to ensure drivers are paying attention when using Autopilot. Stay Connected",
        "url": "https://www.ctvnews.ca/world/more-than-100-injured-in-a-beijing-rail-collision-as-heavy-snow-hits-the-chinese-capital-1.6688655",
        "image": "https://www.ctvnews.ca/content/dam/ctvnews/en/images/2023/12/15/train-collision-on-the-western-district-in-beijing-1-6688660-1702644261040.jpg",
        "publish_date": "2023-12-15 15:23:44",
        "author": "The Associated Press",
        "authors": [
            "The Associated Press"
        ],
        "language": "en",
        "source_country": "ca",
        "sentiment": 0.354
    },
    {
        "id": 185762201,
        "title": "Superquiz and Target Time, Wednesday, January 31",
        "text": "Find words of four letters or more. Every word must include the centre letter and each letter is used once only. Find at least one nine-letter word. No colloquial or foreign words, capitalised nouns, apostrophes or hyphens. No verbs or plural words ending in “s”. Solution list is not exhaustive. Reference source: Macquarie Dictionary. Today’s Target: 9 words, average; 13 words, good; 17+ words, excellent Yesterday’s Target Time: acker, arrack, cake, cark, crack, cracker, crake, creak, karate, kart, RACETRACK, rack, racket, rake, tack, tacker, taka, take, taker, teak, track, tracker, trek.",
        "url": "https://www.theage.com.au/national/superquiz-and-target-time-wednesday-january-31-20240130-p5f13q.html",
        "image": "https://static.ffx.io/images/$zoom_1.1037%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_0%2C$y_49/t_crop_custom/q_86%2Cf_auto/df67b5ead87acc155956acb571d8e9972b745f33",
        "publish_date": "2024-01-30 13:59:00",
        "author": "Harry Hollinswort",
        "authors": [
            "Harry Hollinswort"
        ],
        "language": "en",
        "source_country": "au",
        "sentiment": 0.31
    },
    {
        "id": 175067947,
        "title": "Peb Global Hotel’s Arrival To Boost Hospitality Industry In Warri – Bebenimibo",
        "text": "Peb Global Hotel has joined the League of Delta State hospitality business by opening for operations at Jeddo in Okpe Local Government Area, near Warri in Delta State with the aim to boost the hospitàlitindustry as well as mprove the economic base of the state. The exquisite five-star hotel owned by Dr. Paul E. Bebenimibo, Publisher of PEBNEWSis set to significantly reduced unemployment rate and boost the hospitality industry. This was disclosed by the Chairman of the occasion, High Chief Mcdonald Igbadiwei in his opening speech, he commended Dr. Bebenimibo for assisting the state government by reducing the unemployment rate and helping to improve the hospitality industry. The Member of the Bayelsa State House of Assembly said that the opening of the hotel will ensure business growth of the Jeddo community. Speaking further, he called on Deltans and others to patronise the great hotel for official and private engagements. In his welcome address, Dr. Bebenimibo said, “this edifice you’re seeing here today, the project started two years ago, we thank God Almighty for His grace in putting up this project. “We are set for business, in a projects like this, we all know that it plays some vital role in the society. It’s part of boosting Okpe, Warri, and Effurun hospitality business. “By God’s grace, this will open more doors to the hospitality business in this environment.” In a chat with Dr. Clarkson Agagha, a special guest at the event , he said, “I’m extremely happy because this project is not just for the development of this area but equally for the economic factor. “Actually, it is contributing to the basic needs of the unemployment of the country. Because people from this area will be engaged as well.” One of the staff who crave anonymity commended the management, stressing that she was a teacher with a low salary at a private school, before disengaging to work at Peb Global Hotel because it offers a better remuneration and staff welfare.",
        "url": "https://independent.ng/peb-global-hotels-arrival-to-boost-hospitality-industry-in-warri-bebenimibo/",
        "image": "https://independent.ng/wp-content/uploads/IMG-20231230-WA0014.jpg",
        "publish_date": "2023-12-30 21:07:00",
        "author": "Okiemute Okpomor",
        "authors": [
            "Okiemute Okpomor"
        ],
        "language": "en",
        "source_country": "ng",
        "sentiment": 0.412
    },
    {
        "id": 155477711,
        "title": "How sober travellers and alcohol-free travel companies are driving a new tourism trend as people look for richer experiences unclouded by booze",
        "text": "Akash Raman, a 35-year-old advertising professional in Bangalore, India remembers his late teens and 20s as a time spent drinking in bars and of holidays taken in an alcoholic daze. Two years ago, feeling low, he decided to stop drinking. He then took his first trek, in the Himalayas, with some like-minded friends. He had never enjoyed a better holiday, he says. He was mindful and felt in the moment, without anything clouding his brain. “Alcohol and drinking are highly overrated and a social pressure,” Raman says. “When you get out of that loop, you realise there is much more to life and quality experiences to be had.” For many of us, holidays are synonymous with alcohol. It also flows freely in celebration of joyous events or to help us through stress or rough phases in life. Travel tends to involve the sampling of local wines and spirits, cocktails poolside – and hangovers. Boozy festivals such as Mardi Gras, in the US, and Oktoberfest, in Munich, Germany, only reinforce the idea that alcohol is a part of experiencing something new. But that is changing, with an increasing number of adults across the world becoming “sober curious”, according to John Holmes, professor of alcohol policy at the University of Sheffield, in Britain. These are not people in recovery or who have an addiction problem – who have been long catered for by companies such as Sober Vacations International, which was founded in 1987 – but simply those re-examining their relationship with alcohol. Going to Shenzhen? A guide to visas, the apps you need and cashless payment “There are many reasons why people want to drink less but they generally relate to either concerns about health or a wish to focus more on the things they care about,” Holmes says. “Many people today also worry that alcohol gets in the way of enjoying their lives. It clouds their judgment, distorts their memories and sometimes becomes the focus of an occasion rather than an accompaniment. They feel that not drinking allows them to experience important moments more fully. “This is a striking contrast with 10 or 20 years ago, when people saw alcohol as a key part of experiencing life to the full. It speaks to the way our understanding of what makes a good life has shifted over time.” Anecdotal evidence suggests many millennials and Gen Z who are exposed to social media and an increasing body of research on the perils of drinking prefer to imbibe less on holiday and instead get their kicks by hiking or rock climbing. With the 2018 book Sober Curious: The Blissful Sleep, Greater Focus, Limitless Presence, and Deep Connection Awaiting Us All on the Other Side of Alcohol, author Ruby Warrington has done more than most to usher in this trend. Her book explains that many people who turn sober find that they sleep better, have more energy and even lose weight. To their surprise, many find that they can socialise and make friends without booze, too. Other books popular with the sober curious include Drinking Games: A Memoir (2023), by Sarah Levy, and Hilary Sheinbaum’s The Dry Challenge: How to Lose the Booze for Dry January, Sober October, and Any Other Alcohol-Free Month (2020). Being alcohol-free allows us to use all our senses and have an optimal travel experience. We use the term ‘full sensory travel’ Darci Murray, founder, Hooked Picking up on the trend have been a number of travel companies that eschew alcohol-fuelled nights on the beach, mimosa brunches and sundowners at safari bars. We Love Lucid was founded in 2019 by Lauren Burnison, in Britain. Burnison had given up alcohol in 2016 and soon afterwards travelled extensively through the empty spaces of Mongolia and Siberia, but inspiration struck in Ronda, Spain, where she decided to start a travel company for like-minded people. “A huge part of my alcohol-free travel experiences is getting travellers to push themselves out of their comfort zones,” Burnison says. “We do things like full-moon kayaking on a lake, canyoning and windsurfing, along with some more relaxed activities such as tapas cooking or hiking.” In cities, instead of visiting bars, she takes her customers to concerts and theatre shows in the evenings. “Most of all, my trips are about connection. Taking the decision to question your relationship with booze is a rebellious one and many people can feel isolated, surrounded only by people that drink. We just focus on having a blast and making new unforgettable memories that don’t involve booze,” she says. Travel agent Darci Murray founded the alcohol-free travel company Hooked in 2021 in Vancouver, Canada. “Being alcohol-free allows us to use all our senses and have an optimal travel experience,” Murray says. “We use the term ‘full sensory travel’. “I have actually removed the word ‘sober’ from all my marketing as it implies a certain stigma. I do sometimes use the words ‘sober curious’. You don’t have to be an alcoholic to not want to drink alcohol.” Murray organises trips for travellers between 40 and 70 years old to places as diverse as Namibia and Iceland, taking her clients to everything from drag shows, museums and cooking classes to monster-truck displays, sometimes accompanied by milkshakes. Deon de Villiers, who runs the bespoke Safari Guru company, has also set his sights on the sober market. “We host several sober safaris, allowing those that have made the lifestyle choice to safari in a comfortable safe space with like-minded, interesting people who, for various reasons, have decided alcohol is simply not an option for them,” says de Villiers, who operates in Namibia, Botswana and Kenya. “I think it’s fair to say that Covid did bring this into sharp focus, highlighting our health habits and mental well-being. Many people struggled with too much isolation and alcohol.” ‘The best in years’: teens try out World of Frozen at Hong Kong Disneyland Hotels and cruise companies have also responded to the trend. In 2021, hotel chain Hyatt launched the Zero Proof, Zero Judgement programme. Properties taking part offer zero-proof cocktails (mocktails) and suggestions for activities that don’t involve alcohol that encompass book stores, museums and outdoor pursuits. All-inclusive cruise packages tend to be boozy affairs but Norwegian Cruise Line earned recognition at the 2023 Vibe Vista Awards for its alcohol-free beverage programme, which was introduced on its Norwegian Prima vessel. Zero-proof cocktails are also being offered in upper-class sections by airlines such as Virgin Atlantic and Emirates. Why Gen Z have embraced the low-alcohol or no-alcohol lifestyle According to a 2023 study by IWSR Drinks Market Analysis, the global market for no- and low-alcohol beer, cider, wine and spirits grew by more than 7 per cent in volume across 10 key markets in 2022, including the US, Canada, the UK, Germany and Australia. In the US, that would have been helped by the Sans Bar chain, which operates alcohol-free bars in Austin, Kansas City and Los Angeles, and has pop-ups elsewhere. Sans Bar serves a wide variety of non-alcoholic drinks, from wine to “hops water” (a beer-flavoured sparkling water) and mocktails made with fresh juices. Few countries are as familiar with mocktails as India, where “bars and restaurants … for the longest time have been catering to sober travellers by default,” says mixologist and Delhi bar owner Yangdup Lama, referring to the fact that a large proportion of the Indian population are teetotallers, either for religious reasons or because they are women, who traditionally never used to drink. “Most bars and restaurants would always consciously have a separate section called mocktails.” But even here, change is afoot. “[Mocktails] may not have undergone the kind of change that cocktails have seen over the years but, yes, very clearly in most [bars and restaurants in India] there’s enough [variety] for the sober ones,” Lama says. For many elsewhere in the world, hedonism and binge drinking are no longer cool. And travellers are realising that if they stay sober, their experiences are likely to be richer and more memorable. “When on a Vespa ride in Cinque Terre, in Italy, overlooking the colourful villages and sea while listening to the cicadas and smelling the lush flowers surrounding me, I was brought to tears,” Murray says. “It was sensory overload. I would not have had this if I lived a lifestyle numbing my senses.”",
        "url": "https://www.scmp.com/lifestyle/travel-leisure/article/3239649/how-sober-travellers-and-alcohol-free-travel-companies-are-driving-new-tourism-trend-people-look",
        "image": "https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2023/10/30/9c12169f-8bfb-4564-94ff-b2afa1fad357_f728cdfb.jpg",
        "publish_date": "2023-10-30 11:15:14",
        "author": "Kalpana Sunder, Sarah Levy",
        "authors": [
            "Kalpana Sunder",
            "Sarah Levy"
        ],
        "language": "en",
        "source_country": "cn",
        "sentiment": 0.604
    },
    {
        "id": 169380531,
        "title": "Former Dumfries provost wants event to mark anniversary of German town twinning",
        "text": "The former provost of Dumfries is calling for a special event to be organised in the town in 2024 to mark an anniversary and welcome VIP guests from Germany. Next year will be the 30th anniversary of Dumfries being twinned with the town of Gifhorn in Lower Saxony. Over the past three decades, the building of friendships and contacts has grown due to the continued endeavours of many people, groups, clubs, and schools between the Scottish and German communities. The practice of twinning spread after World War Two as national governments in Europe sought to promote peace and co-operation among communities torn apart by recent conflict. Lochar Councillor Tracey Little, who served as provost of Dumfries until earlier this year, will table a motion at the full council meeting on Thursday seeking a special event to welcome guests from Gifhorn next year. The motion reads: “Dumfries and Gifhorn are of a similar size, originally with similar economies and have many historical links. “Although there have been changes in both towns over the 30 years, the partnership has developed in many ways. “Some of the twinning events of the last 30 years have included exchanges between Dumfries and Gifhorn ranging from pipe-bands, football teams, choirs, scouts, artists, authors, schools and international youth camps. “Dumfries and Galloway Council has continued to give enthusiastic and practical support to exchanges, and this is greatly appreciated by all those working to keep the twinning ties strong. “Council recognises the positive ongoing work throughout our own services along with other organisations, individuals, supporting the twinning between Dumfries and Gifhorn. “Dumfries and Galloway Council notes that in 2024, the 30th Anniversary of this twinning, will result in a larger programme of events and activities in both Dumfries and Gifhorn. “As part of the budget setting process, council calls for a one-off uplift to the twinning budget to help facilitate the welcoming of German guests to celebrate the Anniversary and enable Doonhamers to visit our twinned friends in Gifhorn to participate in their commemorations.”",
        "url": "https://www.dailyrecord.co.uk/news/local-news/former-dumfries-provost-wants-event-31648480",
        "image": "https://i2-prod.dailyrecord.co.uk/incoming/article31648507.ece/ALTERNATES/s1200/0_mdr_dsf_190914DHSJPG.jpg",
        "publish_date": "2023-12-14 08:16:41",
        "author": "Marc McLean",
        "authors": [
            "Marc McLean"
        ],
        "language": "en",
        "source_country": "gb",
        "sentiment": 0.628
    },
    {
        "id": 184693645,
        "title": "Art But Make It Sports Brings History to a New Audience",
        "text": "LJ Rader tries to be online as much as possible during big sporting events, but he missed the first half of last Sunday’s N.F.L. playoff game between the Buffalo Bills and the Kansas City Chiefs because of a dinner engagement. After he left the restaurant, Mr. Rader checked his phone and saw an unusual request: The N.F.L. had tagged him on X, formerly known as Twitter, hoping he would deliver one of his signature creations. “I would’ve been so mad if I was still eating and had missed this,” Mr. Rader said. On social media, Mr. Rader is the wizard behind Art But Make It Sports, where he uses accounts on X and Instagram to pair photographs from the world of sports with paintings and other pieces of art that mirror them. Witty, irreverent and often poignant, the accounts have a combined 365,000 followers. Last Sunday, the N.F.L. wanted Mr. Rader’s take on a scene that was destined for internet immortality: Jason Kelce, an offensive lineman for the Philadelphia Eagles, was screaming, shirtless and clutching a can of beer as he leaned out of a stadium luxury box in subarctic weather to celebrate a touchdown that his brother, Travis, had scored for Kansas City.",
        "url": "https://www.nytimes.com/2024/01/26/style/art-but-sports.html",
        "image": "https://static01.nyt.com/images/2024/01/26/fashion/26ART-BUT-SPORTS-promo/26ART-BUT-SPORTS-promo-facebookJumbo.jpg",
        "publish_date": "2024-01-26 18:14:54",
        "author": "Scott Cacciola",
        "authors": [
            "Scott Cacciola"
        ],
        "language": "en",
        "source_country": "us",
        "sentiment": 0.31
    },
    {
        "id": 192748173,
        "title": "Peter Wright pipped by Luke Littler in last leg Premier League Darts showdown",
        "text": "Peter Wright lost a last leg showdown with Luke Littler in a brilliant battle with the teen sensation. Snakebite had the chance to win the quarter-final clash at 5-4 but missed the chance at double for the match and was punished by the youngster to take it to a deciding set. The 17-year-old then kept his cool as he grabbed a 6-5 win in Newcastle to advance to the semi-finals. The Scotsman produced some excellent darts on the night and will be happy with how he performed but ultimately he will be disappointed at failing to advance to the last four on the night and put some points on the board in the fourth night of the BetMGM Premier League. The top four players after night 16 will contest the play-offs at The O2, London on Thursday May 23 and Wright will be keen to get up and running if he is to stand a chance of getting into that top four with a catch up job on his hands at this stage of the competition. He currently sits bottom of the standings and is yet to register a point. Follow Record Sport on Twitter, Facebook and Instagram for all of the up-to-the minute breaking news, video and audio on the SPFL, the Scotland national team and beyond. You can also follow our dedicated Celtic podcast page and sign up to our newsletters to make sure you never miss a beat throughout the season. We've also entered the world of WhatsApp with our Celtic community up and running. Follow NOW to get your club's latest breaking news and transfer gossip directly to your phone.",
        "url": "https://www.dailyrecord.co.uk/sport/other-sports/darts/peter-wright-pipped-luke-littler-32191516",
        "image": "https://i2-prod.dailyrecord.co.uk/incoming/article32191535.ece/ALTERNATES/s1200/0_JS325559271.jpg",
        "publish_date": "2024-02-22 22:04:05",
        "author": "Alan Galindo",
        "authors": [
            "Alan Galindo"
        ],
        "language": "en",
        "source_country": "gb",
        "sentiment": 0.326
    },
    {
        "id": 155730467,
        "title": "Lionel Messi wins record eighth Ballon d’Or for best player in the world – The Frontier Post",
        "text": "PARIS (Reuters) : Argentina captain Lionel Messi won a record eighth Ballon d’Or for the best player in the world on Monday, beating Norway’s UEFA player of the year and Treble winner Erling Haaland of Manchester City to the prestigious prize. Inter Miami’s Messi, who last won the award in 2021, played a pivotal role in guiding Argentina to their first World Cup title in 36 years when they beat defending champions France in the final last year. The 36-year-old is now three Ballons d’Or clear of rival Cristiano Ronaldo, who won the last of his five trophies in 2017. Messi has now finished among the top three a record 14 times in total, finishing runner-up on five occasions. “I couldn’t imagine having the career that I’ve had. Everything that I’ve achieved. The fortune I’ve had playing for the best team in the world, the best team in history. It’s nice to win these individual trophies. To win the Copa America and then the World Cup, to get it done is amazing,” Messi said. “All of them (Ballon d’Or awards) are special for different reasons,” he added. “I’m happy to get that recognition that I’m getting thanks to what we have achieved with the national team,” Messi told Reuters. “This (World Cup) title we had been aiming for for so many years makes it even more special,” he said. Asked if he would carry on until the 2026 World Cup, Messi said: “I don’t think about it. I’ll enjoy (my career) day by day. There will first be the Copa America in the United States (in 2024). (The World Cup), I don’t think about it.” Earlier, Messi’s World Cup-winning teammate Emiliano Martinez won the Lev Yashin Award for the world’s best goalkeeper. Spain’s Women’s World Cup winner and Barcelona midfielder Aitana Bonmati won the women’s Ballon d’Or. “It’s an individual trophy but it can’t exist without a team,” she told reporters. Messi, who won his first Ballon d’Or in 2009 and claimed four in a row until 2012, finished second to Haaland at the UEFA awards in August. Haaland, 23, was one of the firm favourites for his first Ballon d’Or after scoring 52 goals in 53 matches in all competitions last season as City won the Champions League, Premier League and FA Cup. But Argentina’s magical run at the World Cup in Qatar, where Messi earned the Golden Ball for best overall player and Silver Boot (seven goals and three assists), helped him pip the Norwegian striker to the award. The World Cup was the only major trophy missing from Messi’s resume as Argentina made amends for losing the 2014 final to Germany while in March he became only the third player in history to score 100 international goals. Messi also won the Ligue 1 title with Paris St Germain before moving to Inter Miami, where he helped the Major League Soccer side win the Leagues Cup — their first major trophy. Real Madrid and England midfielder Jude Bellingham won the Kopa Trophy for the best Under-21 player, while club teammate Vinicius Jr. was awarded the Socrates Award for his humanitarian work off the pitch.",
        "url": "https://thefrontierpost.com/lionel-messi-wins-record-eighth-ballon-dor-for-best-player-in-the-world/",
        "image": "https://thefrontierpost.com/wp-content/uploads/2023/10/1698710401889_78b320ab-837b-401f-b1c1-b54cd110543e.jpg",
        "publish_date": "2023-10-31 08:52:51",
        "author": "The Frontier Post",
        "authors": [
            "The Frontier Post"
        ],
        "language": "en",
        "source_country": "pk",
        "sentiment": 0.443
    },
    {
        "id": 152898137,
        "title": "Saskatoon Hilltops' sack-master Kack found a home on the D-line right from the start",
        "text": "“I don’t know if it’s so much my skill moves or anything. I just think I’ve got a high-paced motor and I don’t like to turn it off. Just being persistent and falling down three times and getting up four.” Kack’s turf motor got pulled in a certain direction early, and he’s had a mentor to look up to at home. “My stepbrother is actually (former Hilltop and University of Saskatchewan pass rusher) Riley Pickett, who’s on the B.C. Lions as long snapper,” noted Kack. “Watching him play here was awesome too. I think it was his last year that he played here that he was defensive lineman of the year. Definitely a lot of stolen moves from him.” Kack has played some hockey and football along the way, but football has stuck. “I still kind of kick around in the beer leagues and stuff. I was never a goal-scorer. I played a little basketball but never averaged many points. I was always a good competitor and I was always better on the defensive side of things, so then I really got going in football when I made Team Sask. under-16. “That atmosphere and being able to travel with your friends on a bus, that is one thing that stuck with me, being on a team where there’s all shapes and sizes and different backgrounds of people, it’s just interesting to me. Compared to other sports, it’s just one I’ve been able to connect with a little more.”",
        "url": "https://thestarphoenix.com/sports/hilltops-sack-master-kack-found-a-home-on-the-d-line-right-from-the-start",
        "image": "https://smartcdn.gprod.postmedia.digital/thestarphoenix/wp-content/uploads/2023/10/0828-sports-hilltops-football-31.jpg",
        "publish_date": "2023-10-21 14:00:37",
        "author": "Darren Zary, Michelle Berg, Saskatoon StarPhoenix",
        "authors": [
            "Darren Zary",
            "Michelle Berg",
            "Saskatoon StarPhoenix"
        ],
        "language": "en",
        "source_country": "ca",
        "sentiment": 0.429
    },
    {
        "id": 178377237,
        "title": "Calvin J. Morley Safe School Zone Initiative to Improve Pedestrian Crossings at Primary Schools",
        "text": "Minister of Energy and Transport, the Hon. JoBeth Coleby-Davis and External Affairs Vice-President of Baha Mar Robert Sands assisted young students of Yellow Elder Primary School in crossing busy Baillou Hill Road during a Road Safety exercise, on the morning of January 9, 2024. In their emphasis on Road Safety: They wished to draw attention to the speed limit in school zones; the need for crossing guards at select primary schools; demonstrate to remind parents, teachers, and students that the safety of young Bahamian children is in focus, now that classes have resumed. Moreover, the exercise built support for the Calvin J. Morley Safe School Zone Initiative — a project sponsored by Baha Mar Foundation to improve pedestrian crossings at primary schools in New Providence. Note: Officers of the Traffic Division of the RBPF will deploy assistance of the speed gun to monitor school zone speed levels. From: Bahamas Information Services",
        "url": "https://znsbahamas.com/police-continue-investigations-into-murders-that-occurred-at-the-start-of-the-new-year/",
        "image": "https://znsbahamas.com/wp-content/uploads/2024/01/road8-1.jpg",
        "publish_date": "2024-01-09 20:45:26",
        "author": "Baha Mar Foundation, znsbahamas",
        "authors": [
            "Baha Mar Foundation",
            "znsbahamas"
        ],
        "language": "en",
        "source_country": "bs",
        "sentiment": 0.69
    },
    {
        "id": 160277305,
        "title": "Sydney’s Smith prepares for Norwood homecoming as Cats lose Scheer, Demons drop Allen",
        "text": "While she said it would be a thrill to have her family at Norwood Oval, she said her primary focus was on securing a victory. “I guess a little bit of a 360 [degree cycle] for me playing my several years there [Norwood Oval]; it’s played a big part in my footy career,” Smith said. “To come back there in front of all my family is exciting, but I guess that’s not why we’re going back there, we’re going there to win a game. “So as good as it is, there’s probably a bigger focus.”",
        "url": "https://www.theage.com.au/sport/afl/sydney-s-smith-prepares-for-norwood-homecoming-as-cats-lose-scheer-demons-drop-allen-20231115-p5ekav.html?ref=rss&utm_medium=rss&utm_source=rss_sport",
        "image": "https://static.ffx.io/images/$zoom_0.2157%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_146%2C$y_0/t_crop_custom/q_86%2Cf_auto/5f1ba7fb54388784e7a574a6c7e989843704c602",
        "publish_date": "2023-11-16 11:51:34",
        "author": "Sophia McCaughan",
        "authors": [
            "Sophia McCaughan"
        ],
        "language": "en",
        "source_country": "au",
        "sentiment": 0.318
    },
    {
        "id": 166177761,
        "title": "Zachor Legal Institute Announces New Law Review Article on Federal Civil Rights Protections for Zionists",
        "text": "Welcome to Kalkine Media Pty Ltd. website. Your website access and usage is governed by the applicable Terms of Use & Privacy Policy. Welcome to Kalkine Media LLC website. Your website access and usage is governed by the applicable Terms and Conditions & Privacy Policy. Welcome to Kalkine Media New Zealand Limited website. Your website access and usage is governed by the applicable Terms and Conditions & Privacy Policy. Welcome to Kalkine Media Incorporated website. Your website access and usage is governed by the applicable Terms and Conditions & Privacy Policy. Welcome to Kalkine Media Limited website. Your website access and usage is governed by the applicable Terms of Use & Privacy Policy. Welcome to Kalkine Media Limited website. Your website access and usage is governed by the applicable Terms of Use & Privacy Policy. Welcome to Kalkine Media Limited website. Your website access and usage is governed by the applicable Terms of Use & Privacy Policy. Welcome to Kalkine Media Limited website. Your website access and usage is governed by the applicable Terms of Use & Privacy Policy. Welcome to Kalkine Media Limited website. Your website access and usage is governed by the applicable Terms of Use & Privacy Policy. Welcome to Kalkine Media Limited website. Your website access and usage is governed by the applicable Terms of Use & Privacy Policy. Welcome to Kalkine Media Limited website. Your website access and usage is governed by the applicable Terms of Use & Privacy Policy. Welcome to Kalkine Media Limited website. Your website access and usage is governed by the applicable Terms of Use & Privacy Policy. Welcome to Kalkine Media Limited website. Your website access and usage is governed by the applicable Terms of Use & Privacy Policy. Welcome to Kalkine Media Limited website. Your website access and usage is governed by the applicable Terms of Use & Privacy Policy. Welcome to Kalkine Media Limited website. Your website access and usage is governed by the applicable Terms of Use & Privacy Policy. Welcome to Kalkine Media Limited website. Your website access and usage is governed by the applicable Terms of Use & Privacy Policy. Welcome to Kalkine Media Limited website. Your website access and usage is governed by the applicable Terms of Use & Privacy Policy. Welcome to Kalkine Media Limited website. Your website access and usage is governed by the applicable Terms of Use & Privacy Policy. Welcome to Kalkine Media Limited website. Your website access and usage is governed by the applicable Terms of Use & Privacy Policy. Welcome to Kalkine Media Limited website. Your website access and usage is governed by the applicable Terms of Use & Privacy Policy. مرحبًا بكم في موقع Kalkine Media Limited. يخضع الوصول إلى موقع الويب الخاص بك واستخدامه لما هو معمول بهشروط الاستخدام & سياسة الخصوصية. Bienvenue sur le site Web de Kalkine Media Limited. L'accès et l'utilisation de votre site Web sont régis par les Conditions d'utilisation & Politique de confidentialité. Bienvenido al sitio web de Kalkine Media Limited. El acceso y el uso de su sitio web se rigen por los Términos de uso y Política de privacidad. Willkommen auf der Website von Kalkine Media Limited. Der Zugriff und die Nutzung Ihrer Website unterliegen den geltenden Nutzungsbedingungen & Datenschutzerklärung. Willkommen auf der Website von Kalkine Media Limited. Der Zugriff und die Nutzung Ihrer Website unterliegen den geltenden Nutzungsbedingungen & Datenschutzerklärung.",
        "url": "https://kalkinemedia.com/news/world-news/zachor-legal-institute-announces-new-law-review-article-on-federal-civil-rights-protections-for-zionists",
        "image": "https://kalkinemedia.com/storage/uploads/large/1701730122_656e574a45fa2_www.einpresswire.com",
        "publish_date": "2023-12-04 23:51:43",
        "author": "EIN Presswire",
        "authors": [
            "EIN Presswire"
        ],
        "language": "en",
        "source_country": "au",
        "sentiment": 1.0
    },
    {
        "id": 156815983,
        "title": "Kate Bush refuses to attend Rock and Roll Hall of Fame induction ceremony but is grateful for honour",
        "text": "The West Australian Perth Now Click to open navigation ‌‌ Confidential Movies Best Short Film Television Music Reviews Books Competitions Camera IconKate Bush Credit: BANG - Entertainment News Kate Bush refuses to attend Rock and Roll Hall of Fame induction ceremony but is grateful for honour BANG - Entertainment NewsBang Showbiz November 4, 2023 9:07AM Topics Share to Facebook Share to Twitter Email Us Copy the Link Your Local News Share to TwitterShare to FacebookShare to InstagramShare to YoutubeEmail UsGet Digital Edition Perth Now Email UsNewsletter Chevron Down IconSubmit story tip Camera IconSubmit photos Get Digital EditionDigital edition Chevron Down IconBack to top",
        "url": "https://www.perthnow.com.au/entertainment/celebrity/kate-bush-refuses-to-attend-rock-and-roll-hall-of-fame-induction-ceremony-but-is-grateful-for-honour-c-12435856",
        "image": "https://images.perthnow.com.au/publication/C-12435856/256d82ab36f605c92a8da5f5a7f43187de41476f-16x9-x0y317w650h366.jpg?imwidth=1200",
        "publish_date": "2023-11-04 02:07:13",
        "author": "BANG - Entertainment News",
        "authors": [
            "BANG - Entertainment News"
        ],
        "language": "en",
        "source_country": "au",
        "sentiment": 1.0
    },
    {
        "id": 180138113,
        "title": "Nesbitt's Quality Meats: Glengormley family-run butchers marks 30 years in the community",
        "text": "For 56 years a butchers shop has sat proud on the same corner spot in the heart of Glengormley. At the junction of Glencairn Park and the Antrim Road, three generations of butchers have operated here keeping locals well fed with local produce. The first was owned by Stuart Edwards, the second was owned by David Nesbitt, and the third is owned by Alastair Bonar, the current owner who has been operating here for the past 30 years. But Nesbitt's Quality Meats pays homage to what was there before. Named after previous owner David Nesbitt, who owner Alastair worked for for many years before buying the shop, the family-run butchers has been serving customers with a smile ever since they opened up. Read more: Meet the man travelling to all Belfasts in the world on an old motorbike Read more: Internet users puzzled after Google shows strange search results for NI village The work can't be done alone, however, with Alastair splitting every day operations between himself, his wife Sharon, and son Philip, who can all be found working behind the counter at Nesbitt's - often at the same time. Speaking to Belfast Live, Alastair said: \"We're part of the community here and we're well known in the area. We have a good customer base from the wider Glengormley area. \"We have a good rapport with our customers, and we've built many nice friendships as you get to know everybody. \"The man I worked for here for years, David Nesbitt, built this shop up and he was very good to me, it's nice to carry that on.\" As for what sets Nesbitt's apart, Alastair said they have a big focus on local produce, as well as including more niche items such as haggis and smoked salmon from Scotland. He said: \"I'm a great believer in selling local produce so I have a good chain of suppliers I've been with for a long time. For instance, we had a great run of turkeys there at Christmas, and they come from 25 minutes up the road. \"I was down at the beginning of December seeing the turkeys. Our chickens come from Ballyeaston and we've been with the supplier there for a long time, he has been supplying this shop for about 40 years. \"It's just trying to get people to support small businesses, and I'm passionate about small local artisan food shops. There's lovely places around Northern Ireland just here, there, and yonder.\" Nesbitt's Quality Meats have been shortlisted in the top five for the top butcher category in the Countryside Alliance awards, which they were nominated for by a customer. Alastair said: \"It's just nice to be recognised. I was all chuffed to find out about the nomination, and ot's nice that somebody has nominated us for that.\" You can find out more about the awards and place a vote for Nesbitt's Quality Meats by clicking here. For all the latest news, visit the Belfast Live homepage here and sign up to our daily newsletter",
        "url": "https://www.belfastlive.co.uk/news/northern-ireland/nesbitts-quality-meats-glengormley-family-28441114",
        "image": "https://i2-prod.belfastlive.co.uk/news/article28441640.ece/ALTERNATES/s1200/0_Nesbitts-Butchers-02_JK.jpg",
        "publish_date": "2024-01-14 09:38:26",
        "author": "Jane Corscadden",
        "authors": [
            "Jane Corscadden"
        ],
        "language": "en",
        "source_country": "gb",
        "sentiment": 0.432
    },
    {
        "id": 171299235,
        "title": "HUD Awards County $1.1M Housing Voucher Grant for Youth in Foster Care",
        "text": "U.S. Department of Housing and Urban Development officials presented San Diego County with a $1.1 million grant Tuesday that will fund 49 new housing vouchers for families and youth in foster care and at risk of homelessness. The county received the third largest award from HUD’s $10 million total among 13 housing authorities around the country. According to the federal agency, the grants will fund 625 vouchers nationwide and are part of HUD’s Family Unification Program. The vouchers are available to two groups — families and current or former foster youth. According to HUD, families who could benefit from the housing vouchers include those whose primary reason their child is in foster care is due to insufficient housing. “The program also helps youth ages 18 to 24, who have either exited foster care or will do so within the next 90 days, and those who are experiencing homelessness or at risk of experiencing homelessness and are 16 years or older,” according to a statement from the county. Young people in the program also get help finding housing, deposits and utilities and case management. For more information on HUD’s Family Unification Program, visit www.hud.gov. City News Service contributed to this article.",
        "url": "https://timesofsandiego.com/politics/2023/12/19/hud-awards-county-1-1m-housing-voucher-grant-for-youth-in-foster-care/",
        "image": "https://timesofsandiego.com/wp-content/uploads/2023/06/Hand_Key_house.jpg",
        "publish_date": "2023-12-20 03:04:20",
        "author": "Elizabeth Ireland",
        "authors": [
            "Elizabeth Ireland"
        ],
        "language": "en",
        "source_country": "us",
        "sentiment": 0.69
    },
    {
        "id": 191556137,
        "title": "Who is Johnny Weir as he replaces ITV Dancing on Ice's Ashley Banjo?",
        "text": "Who is the special guest judge on Dancing on Ice, Johnny Weir? ITV's favourite ice-skating show, Dancing on Ice, has introduced a fresh face in the judging panel, as Ashley Banjo takes a break from the show until the semi-final. Filling his spot is American figure skating pro, Johnny Weir. Ashley will take time off due to other commitments with his popular dance crew Diversity, which won Britain's Got Talent in 2009. In contrast, Johnny, who has carved out a successful career as a Winter Olympics skater and now a commentator, will sit beside familiar judgers like Oti Mabuse, Jayne Torvill, and Christopher Dean on Dancing on Ice. When asked about his excitement over joining the show, Johnny stated: \"I am so excited to join the panel simply because I love my sport - I love figure skating. Dancing on Ice has done such a brilliant job over the years of promoting my sport and showing people what the inside of our world looks like, and how much personal freedom you can find on the ice. It's an amazing opportunity for me to bring my love from America over to an audience that has been supportive of our sport over the years and I think any attention that figure skating can get around the world is wonderful.\" Read more Real reason Ashley Banjo is not on Dancing on Ice as Johnny Weir returns But what else do we know about Johnny? Who is Johnny Weir? Johny Weir is an American figure skater and television commentator. He is a two-time Olympian, the 2001 World Junior Champion, and a three-time U.S. National champion. He was the youngest U.S. National champion since 1991, and in 2006 was the first skater to win U.S. Nationals three times in a row since Brian Boitano in the late 1980s, and the first American to win Cup of Russia in 2007. Weir was raised in Quarryville, Pennsylvania, and his first love wasn't skating. He won several equestrian competitions before switching to figure skating at the age of 12. Is Johnny Weir married? Johnny is currently single. In January 2012, he married his partner Victor Voronov, a graduate of Georgetown University Law Center and whose family was from Russia. They wed in a civil ceremony in New York City, only five months after the state legalized same-sex marriages. But Johnny filed for divorce in February 2014 and were involved in several legal battles in court. As of 2021, Weir lives in Greenville, Delaware in a home that was featured on MTV Cribs. Prior to the purchase, he cited privacy, seclusion, and his need for rest from his busy life, as factors guiding his decision to settle in a more rural area.",
        "url": "https://www.birminghammail.co.uk/news/showbiz-tv/who-johnny-weir-replaces-itv-28657806",
        "image": "https://i2-prod.examinerlive.co.uk/incoming/article28657619.ece/ALTERNATES/s1200/0_johnnyw4.png",
        "publish_date": "2024-02-18 20:58:58",
        "author": "Katy Hallam, Stephanie Colderick",
        "authors": [
            "Katy Hallam",
            "Stephanie Colderick"
        ],
        "language": "en",
        "source_country": "gb",
        "sentiment": 0.406
    },
    {
        "id": 191869323,
        "title": "RFU ditches plan to sell Twickenham and buy 50% share of Wembley",
        "text": "The Rugby Football Union has ditched a radical proposal to sell Twickenham and buy a 50% share of Wembley from the Football Association, the Guardian can reveal, instead focusing on £663m plans to overhaul its current stadium. Twickenham has served as the home of English rugby since 1909 and while the RFU is formulating plans to revamp the stadium as part of its “masterplan programme”, last year the union’s board approved a recommendation to retain an option to “leave” but to “defer formal engagement with the FA”. Matchdays at Twickenham drive 85% of the RFU’s revenues and the stadium has in recent years been described by the RFU’s chief executive, Bill Sweeney, as “our cash cow”. As a result the RFU has been -reluctant to stage England internationals anywhere else but moving to Wembley was part of a “reserve” option to the union’s plans to overhaul Twickenham. The Guardian has seen the RFU’s in-depth plans for revamping Twickenham, with a window between the end of the 2027 Six Nations and the start of the following year’s championship identified as the preferred time to carry out a large section of the work with minimal disruption. It would, however, mean that Red Roses matches and the men’s team’s World Cup warm-up matches would have to be played elsewhere in that time. The masterplan – which focuses on property, transport and user experience – also makes reference to a previous potential option to relocate to Wembley, where England have hosted one previous match, against Canada in 1992. Wales also used Wembley – which was the subject of a £900m offer by the US billionaire Shahid Khan in 2018 – as a temporary base while the Principality Stadium was being built. “The RFU is focused on continuing to develop Twickenham Stadium,” a spokesperson for the union said. “Previous considerations looking at the viability of moving to alternative sites have been rejected.” While the RFU has calculated costs of £663m for its Twickenham overhaul, there is an acknowledgment that is unaffordable and that more pressing works will be prioritised with around £300m in financing available. The figure of £663m is considered illustrative and the intention is for the total costs to form a longer-term blueprint and for subsequent works to be carried out as and when the union has the finances. “The events held at Twickenham generate a significant proportion of the RFU’s revenue and allow investment in the game at all levels from community to elite,” read the plans. “Beyond its role as the RFU’s most visible asset and the home of England’s national rugby teams, this makes the stadium a critical financial driver to support the growth of the game and the delivery of the RFU’s objectives for the sport from grassroots to the elite level. “Although the RFU has made significant investment in enhancing the stadium and the site, its development has, even in recent years, been completed without an overarching long-term strategy. This piecemeal approach has resulted in inefficiencies in operations, compliance, maintenance and, crucially, the fan experience perspectives.” The work includes renovations of each of the four stands – which would see the minimum capacity for rugby events reduced to 80,000 – as well as the stadium roof, the car parks and the RFU’s offices relocated. The intention is that the stadium would be fully operational again by 2031. The RFU is also seeking to improve transport links due to the overreliance on Twickenham rail station and countless reports of overcrowding chaos on matchdays. Among the initiatives being assessed to improve transport to and from matches, the RFU is exploring the use of riverboat services. Writing in the RFU’s most recent annual report, the chief financial officer, Sue Day, outlined how such an overhaul of Twickenham is necessary to “safeguard the future revenues needed to invest back into the game”. There is a concern within the RFU, however, that such lavish spending on the stadium will be seen as incongruous at a time when the professional and grassroots games need investment. An RFU spokesperson added: “Our long-term masterplan for -Twickenham Stadium is being developed to ensure England’s national rugby stadium stays up to date, is compliant with all relevant regulations, provides the best possible experiences for fans, and continues to generate revenue for reinvestment into the community and professional game. “Work will be undertaken over the next 12 months to consider next stage designs and assess what interventions might take place and when within the existing stadium footprint over the next 10 years. The RFU board has not agreed any new -redevelopment plans. However, as you would expect, all options will be thoroughly considered as part of a long-term strategy. “As plans are further developed, the RFU board and council will be fully consulted and engaged in the due diligence and approval process, this would include any potential funding sources. As per the RFU constitution, if borrowing of over £150m was needed, council members’ views and approval would be required. We do not anticipate major stadium works starting before 2027.”",
        "url": "https://www.theguardian.com/sport/2024/feb/19/rfu-twickenham-wembley-stadium-rugby-union-england",
        "image": "https://i.guim.co.uk/img/media/a44d21a4602177387f0b8248a60398298a08e916/0_183_5494_3297/master/5494.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGV",
        "publish_date": "2024-02-19 19:00:24",
        "author": "Gerard Meagher",
        "authors": [
            "Gerard Meagher"
        ],
        "language": "en",
        "source_country": "us",
        "sentiment": 0.413
    },
    {
        "id": 194259191,
        "title": "Girls basketball provincials: How the Riverside Rapids were almost the Riverside Razorbacks and other nickname tales",
        "text": "The Rapids are the defending Quad A high school senior girls’ basketball provincial champions, and with 2023 tournament first all-stars Avery Sussex and Jorja Hart leading the charge, they’re the No. 1 seeds for this year’s event, which tips off Wednesday at the Langley Events Centre. Riverside opened its doors in 1996 in Port Coquitlam. A new school needed a moniker for its sports’ teams. School staff wound up in two camps: one that favoured Rapids, one that pushed for Razorbacks. Both names brought that much coveted alliteration. Rapids tied into the school’s proximity to the Coquitlam River. Razorbacks was trendy at the time, because of the NCAA football team from Arkansas. When the dust settled, the staff picked Rapids. Coming up on 30 years from the decision, it’s easy to wonder how Razorbacks might have aged.",
        "url": "https://theprovince.com/sports/high-school/girls-basketball-provincials-how-the-riverside-rapids-were-almost-the-riverside-razorbacks-and-other-nickname-tales",
        "image": "https://smartcdn.gprod.postmedia.digital/theprovince/wp-content/uploads/2024/02/bl6i6971.jpg",
        "publish_date": "2024-02-27 22:59:48",
        "author": "Steve Ewen",
        "authors": [
            "Steve Ewen"
        ],
        "language": "en",
        "source_country": "ca",
        "sentiment": 0.401
    },
    {
        "id": 157582945,
        "title": "ASX News, Financial News on Stocks & ASX Share Market - Kalkine Media",
        "text": "Welcome to Kalkine Media Pty Ltd. website. Your website access and usage is governed by the applicable Terms of Use & Privacy Policy. Welcome to Kalkine Media LLC website. Your website access and usage is governed by the applicable Terms and Conditions & Privacy Policy. Welcome to Kalkine Media New Zealand Limited website. Your website access and usage is governed by the applicable Terms and Conditions & Privacy Policy. Welcome to Kalkine Media Incorporated website. Your website access and usage is governed by the applicable Terms and Conditions & Privacy Policy. Welcome to Kalkine Media Limited website. Your website access and usage is governed by the applicable Terms of Use & Privacy Policy. Welcome to Kalkine Media Limited website. Your website access and usage is governed by the applicable Terms of Use & Privacy Policy. Welcome to Kalkine Media Limited website. Your website access and usage is governed by the applicable Terms of Use & Privacy Policy. Welcome to Kalkine Media Limited website. Your website access and usage is governed by the applicable Terms of Use & Privacy Policy. Welcome to Kalkine Media Limited website. Your website access and usage is governed by the applicable Terms of Use & Privacy Policy. Welcome to Kalkine Media Limited website. Your website access and usage is governed by the applicable Terms of Use & Privacy Policy. Welcome to Kalkine Media Limited website. Your website access and usage is governed by the applicable Terms of Use & Privacy Policy. Welcome to Kalkine Media Limited website. Your website access and usage is governed by the applicable Terms of Use & Privacy Policy. Welcome to Kalkine Media Limited website. Your website access and usage is governed by the applicable Terms of Use & Privacy Policy. Welcome to Kalkine Media Limited website. Your website access and usage is governed by the applicable Terms of Use & Privacy Policy. Welcome to Kalkine Media Limited website. Your website access and usage is governed by the applicable Terms of Use & Privacy Policy. Welcome to Kalkine Media Limited website. Your website access and usage is governed by the applicable Terms of Use & Privacy Policy. Welcome to Kalkine Media Limited website. Your website access and usage is governed by the applicable Terms of Use & Privacy Policy. Welcome to Kalkine Media Limited website. Your website access and usage is governed by the applicable Terms of Use & Privacy Policy. Welcome to Kalkine Media Limited website. Your website access and usage is governed by the applicable Terms of Use & Privacy Policy. Welcome to Kalkine Media Limited website. Your website access and usage is governed by the applicable Terms of Use & Privacy Policy. مرحبًا بكم في موقع Kalkine Media Limited. يخضع الوصول إلى موقع الويب الخاص بك واستخدامه لما هو معمول بهشروط الاستخدام & سياسة الخصوصية. Bienvenue sur le site Web de Kalkine Media Limited. L'accès et l'utilisation de votre site Web sont régis par les Conditions d'utilisation & Politique de confidentialité. Bienvenido al sitio web de Kalkine Media Limited. El acceso y el uso de su sitio web se rigen por los Términos de uso y Política de privacidad. Willkommen auf der Website von Kalkine Media Limited. Der Zugriff und die Nutzung Ihrer Website unterliegen den geltenden Nutzungsbedingungen & Datenschutzerklärung. Willkommen auf der Website von Kalkine Media Limited. Der Zugriff und die Nutzung Ihrer Website unterliegen den geltenden Nutzungsbedingungen & Datenschutzerklärung.",
        "url": "https://kalkinemedia.com/global/tech-corner/technology/homewav-brings-inmate-communications-to-pettis-county-jail-through-innovative-partnership",
        "image": "https://kalkinemedia.com/resources/assets/public/img/Kalkine_media_logo.png",
        "publish_date": "2023-11-06 22:02:39",
        "author": "EIN Presswire",
        "authors": [
            "EIN Presswire"
        ],
        "language": "en",
        "source_country": "au",
        "sentiment": 1.0
    },
    {
        "id": 189551199,
        "title": "Chiefs win second straight Super Bowl, third in five seasons, in OT thriller",
        "text": "This website uses cookies to personalize your content (including ads), and allows us to analyze our traffic. Read more about cookies here. By continuing to use our site, you agree to our Terms of Service and Privacy Policy.",
        "url": "https://torontosun.com/sports/football/nfl/chiefs-win-second-straight-super-bowl-third-in-five-seasons-in-ot-thriller",
        "image": "https://smartcdn.gprod.postmedia.digital/torontosun/wp-content/uploads/2024/02/2004167031-scaled-e1707710232627.jpg?quality=100&strip=all",
        "publish_date": "2024-02-12 04:57:29",
        "author": "Associated Press",
        "authors": [
            "Associated Press"
        ],
        "language": "en",
        "source_country": "ca",
        "sentiment": 0.682
    },
    {
        "id": 168869223,
        "title": "NBA DFS: DraftKings, FanDuel Daily Fantasy Basketball Picks For Tuesday, Dec. 12 Include Kawhi Leonard -",
        "text": "The Los Angeles Lakers, the first-ever in-season tournament champions, return to the court on Tuesday against the Dallas Mavericks. The Lakers defeated the Pacers, 123-109, on Saturday night in Las Vegas behind 41 points and 20 rebounds by Anthony Davis and 24 points and 11 rebounds by LeBron James. Davis (hip) and James (calf) are both questionable for Tuesday, so daily Fantasy basketball players should keep an eye on their statuses when forming an NBA DFS strategy if the Lakers decide to rest them after playing extended minutes last week. Or, will these Lakers superstars carry that momentum against Dallas and finish as top NBA DFS picks? The Tuesday NBA DFS player pool also features Nikola Jokic, Devin Booker and Jayson Tatum. Which stars should you find ways to fit into NBA DFS lineups, and who are the cheaper options to provide value around a few stud players? Before making your NBA DFS picks, be sure to check out the NBA DFS advice, player rankings, stacks and top daily Fantasy basketball picks from SportsLine’s Mike McClure. McClure is a DFS professional with more than $2 million in career winnings. He’s also a predictive data engineer at SportsLine who uses a powerful prediction model that simulates every minute of every game 10,000 times, taking factors like matchups, statistical trends and injuries into account. This allows him to find the best NBA DFS values and create optimal lineups that he shares only over at SportsLine. They’re a must-see for any NBA DFS player. On Monday, McClure highlighted Grizzlies guard/forward Desmond Bane as one of his top picks in his NBA DFS player pool on both sites. The result: Bane had 28 points, three rebounds and eight assists, returning 44.75 points on DraftKings and 41.6 points on FanDuel. Anybody who included him in their lineups was well on the way to a profitable day. McClure has turned his attention to NBA action on Tuesday and locked in his top daily Fantasy basketball picks. You can only see them by heading to SportsLine. Top NBA DFS picks for Tuesday, December 12 For Tuesday, one of McClure’s top NBA DFS picks is Clippers forward Kawhi Leonard, who is listed at $8,000 on DraftKings and $8,700 on FanDuel. Leonard had 34 points, six rebounds, five assists and three steals in a 132-27 win over Portland on Monday after scoring a season-high 41 points against the Jazz on Friday. He’s averaging 28.6 points, 6.7 rebounds and four assists over his last seven contests, including scoring at least 30 points in four games. Leonard is shooting 50% or better from the field in each of his last six games. The Clippers, who are on a four-game winning streak, have started to find their chemistry alongside one another, and Leonard has found himself in high-percentage opportunities surrounded by options like Paul George and James Harden. The five-time All-Star has averaged at least 23 points in each of his previous seasons with the Clippers, and he is a safe option to continue his strong play for NBA DFS lineups on Tuesday. Another part of McClure’s optimal NBA DFS strategy includes stacking Leonard with guard Harden ($7,800 on DraftKings and $8,000 on FanDuel). Harden is averaging 18.3 points, five rebounds and 8.8 assists over his last four games. He’s shooting far more efficiently as of late, making at least 50% of his field goals in three of his past four games after reaching that clip in just four of his first 13 games after being traded to Los Angeles from the 76ers. Harden has at least seven assists in five straight games, and at this stage of his career, he’s often at his best when looking to set up others rather than creating his own shot. The 15th-year veteran led the NBA with 10.7 assists per game last season with the 76ers, and as he continues to learn how to better play with Leonard, George and other Clippers teammates, his assists numbers should rise. With the roll the Clippers are on lately, including scoring a season-high 132 points on Monday, Harden and Leonard are an appealing NBA DFS stack for Tuesday. See McClure’s other NBA DFS picks right here. How to set your NBA DFS lineups for Tuesday, December 12 McClure is also targeting a player who could go off for massive numbers on Tuesday because of a dream matchup. This pick could be the difference between winning your tournaments and cash games or going home with nothing. You can only see who it is here. Who is DFS pro Mike McClure putting in his optimal NBA DFS lineups for Tuesday? Visit SportsLine now to see optimal NBA DFS picks, rankings, advice, and stacks, all from a professional DFS player who has over $2 million in career winnings, and find out.",
        "url": "https://worldnewsera.com/sports/nba-news/nba-dfs-draftkings-fanduel-daily-fantasy-basketball-picks-for-tuesday-dec-12-include-kawhi-leonard/",
        "image": "https://sportshub.cbsistatic.com/i/r/2023/01/26/acd0b3df-42ee-4096-afe5-c30722e51612/thumbnail/1200x675/36b3faf18eb6745a306c4d2020b19504/kawhi-leonard-usatsi-clippers.jpg",
        "publish_date": "2023-12-12 18:16:20",
        "author": "Anthony Davis, Ashleigh Durden",
        "authors": [
            "Anthony Davis",
            "Ashleigh Durden"
        ],
        "language": "en",
        "source_country": "us",
        "sentiment": 0.424
    },
    {
        "id": 161150637,
        "title": "Winners at Natl. NCC Camp",
        "text": "Mysuru’s favorite and largest circulated English evening daily has kept the citizens of Mysuru informed and entertained since 1978. Over the past 45 years, Star of Mysore has been the newspaper that Mysureans reach for every evening to know about the happenings in Mysuru city. The newspaper has feature rich articles and dedicated pages targeted at readers across the demographic spectrum of Mysuru city. With a readership of over 2,50,000 Star of Mysore has been the best connection between it’s readers and their leaders; between advertisers and customers; between Mysuru and Mysureans.",
        "url": "https://starofmysore.com/winners-at-natl-ncc-camp/",
        "image": "https://starofmysore.com/wp-content/uploads/2023/11/Mahabodhi-School-ncc-cadets.jpg",
        "publish_date": "2023-11-19 14:16:00",
        "author": "Author",
        "authors": [
            "Author"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.442
    },
    {
        "id": 169012561,
        "title": "I’m addicted to Christmas movies, even the turkeys",
        "text": "There’s Love Actually which is about lump-in-your-throat London love … provided you’re willing to look past a snowstorm of misogynistic and ageist clangers. Remember, no critical thinking is necessary for holiday movies. Spirited recently (and quickly) became a festive favourite, despite the gags and reimagined Christmas carols being overstuffed (because overstuffed is what the season is all about, right?). Now, thanks to having access to several streaming platforms (where I certainly don’t share passwords with relatives), there’s an abundance of new Christmas movies that we’ll forget long before the credits roll. And yet, I can’t look away. Streaming platforms have unabashedly muscled into the made-for-TV-style movies market. They are churning out quick, cheap holiday flicks with minimum creativity to maximise profits.",
        "url": "https://www.smh.com.au/culture/movies/i-m-addicted-to-christmas-movies-even-the-turkeys-20231211-p5eqk6.html?ref=rss&utm_medium=rss&utm_source=rss_culture",
        "image": "https://static.ffx.io/images/$zoom_1%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_324%2C$y_321/t_crop_custom/q_86%2Cf_auto/e2121c9c761df2b934a3cbd2b68e42f5dd0cf9bc",
        "publish_date": "2023-12-13 05:30:00",
        "author": "Antoinette Lattouf",
        "authors": [
            "Antoinette Lattouf"
        ],
        "language": "en",
        "source_country": "au",
        "sentiment": 0.357
    },
    {
        "id": 196743987,
        "title": "Bunch of 90s pop icons set to host event in Glasgow",
        "text": "The Biggest 90s 00s Disco is set to take place at the city's OVO Hydro on Saturday, December 14. As part of it, music icons with number-one hits including Peter Andre, Basshunter, and Lou Bega will be performing. The full list of stars who will be in attendance at the show include: Peter Andre SNAP Basshunter Robin S Five Lou Bega La Bouche Atomic Kitchen Whigfield Rozalla Rednex Ultra Nate Michael Jackson Tribute Show Kascada Tribute Show A spokesperson for the OVO Hydro said: \"After the success of Biggest 90s 00s Disco in the UK in 2023, we're excited to be bringing the party back to Glasgow in 2024! \"With artists such as Peter Andre, Basshunter, Five, Lou Bega and many, many more, this won't be one to miss. \"Attendees are in for a four-hour nostalgia-filled party that will transport them back to the golden era of disco. \"Fans can expect an immersive experience featuring fancy dress, flash mobs, lots of confetti and many more surprises.\" To find out more, click HERE.",
        "url": "https://www.glasgowtimes.co.uk/news/scottish-news/24168777.bunch-90s-pop-icons-set-host-event-glasgow/",
        "image": "http://www.glasgowtimes.co.uk/resources/images/17526899.jpg/",
        "publish_date": "2024-03-07 11:23:11",
        "author": "Ben Waddell, Toby Granville",
        "authors": [
            "Ben Waddell",
            "Toby Granville"
        ],
        "language": "en",
        "source_country": "gb",
        "sentiment": 0.805
    },
    {
        "id": 164617755,
        "title": "Metronet, wages spend reflect in public sector cash flow",
        "text": "Your single user subscription provides more than you think Extensive & innovative WA business database The most powerful knowledgebase mapped from 20 years of research and insight into every WA leader and business. Never miss a story with BN daily emails Morning and afternoon timely wrap ups of every news item delivered straight to your device. Directors, businesses lists and projects Transaction records, directors wealth, remuneration data and network activity. Specialised reports and profile events Get the inside scoop on every news story and connect with WA’s biggest leaders. Get full access to Business News What is Data & Insights? Just want the daily emails? Sign up to our free newsletters",
        "url": "https://www.businessnews.com.au/article/Metronet-wages-spend-reflect-in-public-sector-cash-flow",
        "image": "https://static.businessnews.com.au/sites/default/files/articles-2023-11/metrolink%20yanchep_%20mark%20mcgowan_%20rita%20saffioti-9696.jpg",
        "publish_date": "2023-11-30 04:58:56",
        "author": "Jack McGinn",
        "authors": [
            "Jack McGinn"
        ],
        "language": "en",
        "source_country": "au",
        "sentiment": 0.531
    },
    {
        "id": 190591203,
        "title": "France and Ukraine to sign a security agreement in Paris in the presence of President Zelenskyy",
        "text": "This will be the third visit by Zelenskyy to Paris since Russia’s invasion of Ukraine almost two years ago, following those in February and May 2023, the statement said. The French presidency said the visit will be an opportunity for Macron “to reaffirm France’s determination to continue to provide unwavering support to Ukraine and the Ukrainian people, over the long term and with all its partners.” Both leaders will discuss the situation on the front line, Ukraine’s military, economic and humanitarian needs, as well as negotiations on the country’s efforts to join the European Union, which France fully supports, the statement said. Ukraine’s presidential office on Thursday said Zelenskyy will visit Germany, where he will meet with Chancellor Olaf Scholz, and France on Friday. He will also participate the next day to the Munich Security Conference and will hold bilateral meetings on its sideline, including with U.S. Vice President Kamala Harris, Czech President Petr Pavel, Denmark Prime Minister Mette Frederiksen and the Netherlands Prime Minister Mark Rutte.",
        "url": "https://nationalpost.com/pmn/news-pmn/france-and-ukraine-to-sign-a-security-agreement-in-paris-in-the-presence-of-president-zelenskyy",
        "image": "https://smartcdn.gprod.postmedia.digital/nationalpost/wp-content/uploads/2024/02/Guilbeault-cycling.jpg?quality=5&strip=all&w=100&sig=PBxRxxnMTWGJJKrzcNWNtw",
        "publish_date": "2024-02-15 10:56:30",
        "author": "The Associated Press",
        "authors": [
            "The Associated Press"
        ],
        "language": "en",
        "source_country": "ca",
        "sentiment": 0.519
    },
    {
        "id": 153868867,
        "title": "AnaKacia Shifflet's Life On The High Wire",
        "text": "Welcome to Kalkine Media Pty Ltd. website. Your website access and usage is governed by the applicable Terms of Use & Privacy Policy. Welcome to Kalkine Media LLC website. Your website access and usage is governed by the applicable Terms and Conditions & Privacy Policy. Welcome to Kalkine Media New Zealand Limited website. Your website access and usage is governed by the applicable Terms and Conditions & Privacy Policy. Welcome to Kalkine Media Incorporated website. Your website access and usage is governed by the applicable Terms and Conditions & Privacy Policy. Welcome to Kalkine Media Limited website. Your website access and usage is governed by the applicable Terms of Use & Privacy Policy. Welcome to Kalkine Media Limited website. Your website access and usage is governed by the applicable Terms of Use & Privacy Policy. Welcome to Kalkine Media Limited website. Your website access and usage is governed by the applicable Terms of Use & Privacy Policy. Welcome to Kalkine Media Limited website. Your website access and usage is governed by the applicable Terms of Use & Privacy Policy. Welcome to Kalkine Media Limited website. Your website access and usage is governed by the applicable Terms of Use & Privacy Policy. Welcome to Kalkine Media Limited website. Your website access and usage is governed by the applicable Terms of Use & Privacy Policy. Welcome to Kalkine Media Limited website. Your website access and usage is governed by the applicable Terms of Use & Privacy Policy. Welcome to Kalkine Media Limited website. Your website access and usage is governed by the applicable Terms of Use & Privacy Policy. Welcome to Kalkine Media Limited website. Your website access and usage is governed by the applicable Terms of Use & Privacy Policy. Welcome to Kalkine Media Limited website. Your website access and usage is governed by the applicable Terms of Use & Privacy Policy. Welcome to Kalkine Media Limited website. Your website access and usage is governed by the applicable Terms of Use & Privacy Policy. Welcome to Kalkine Media Limited website. Your website access and usage is governed by the applicable Terms of Use & Privacy Policy. Welcome to Kalkine Media Limited website. Your website access and usage is governed by the applicable Terms of Use & Privacy Policy. Welcome to Kalkine Media Limited website. Your website access and usage is governed by the applicable Terms of Use & Privacy Policy. Welcome to Kalkine Media Limited website. Your website access and usage is governed by the applicable Terms of Use & Privacy Policy. Welcome to Kalkine Media Limited website. Your website access and usage is governed by the applicable Terms of Use & Privacy Policy. مرحبًا بكم في موقع Kalkine Media Limited. يخضع الوصول إلى موقع الويب الخاص بك واستخدامه لما هو معمول بهشروط الاستخدام & سياسة الخصوصية. Bienvenue sur le site Web de Kalkine Media Limited. L'accès et l'utilisation de votre site Web sont régis par les Conditions d'utilisation & Politique de confidentialité. Bienvenido al sitio web de Kalkine Media Limited. El acceso y el uso de su sitio web se rigen por los Términos de uso y Política de privacidad. Willkommen auf der Website von Kalkine Media Limited. Der Zugriff und die Nutzung Ihrer Website unterliegen den geltenden Nutzungsbedingungen & Datenschutzerklärung. Willkommen auf der Website von Kalkine Media Limited. Der Zugriff und die Nutzung Ihrer Website unterliegen den geltenden Nutzungsbedingungen & Datenschutzerklärung.",
        "url": "https://kalkinemedia.com/news/world-news/anakacia-shifflets-life-on-the-high-wire",
        "image": "https://kalkinemedia.com/storage/uploads/large/1698181242_6538307ac2ca7_19128047_with_the_guv_new_3024x4024.jpeg",
        "publish_date": "2023-10-24 23:05:35",
        "author": "EIN Presswire",
        "authors": [
            "EIN Presswire"
        ],
        "language": "en",
        "source_country": "au",
        "sentiment": 1.0
    },
    {
        "id": 159352515,
        "title": "New York Celebrates Diwali, Empire State Building Lit Up In Orange Hues",
        "text": "The iconic Empire State Building was lit up in orange hues as New York City celebrated Diwali on Sunday. New York City Mayor Eric Adams and Deputy Commissioner of International Affairs Dilip Chauhan celebrated the 'festival of lights' with people of the Hindu community at the Bhakti Center, the oldest Hindu temple in Manhattan. In June, Eric Adams announced the popular Hindu festival Diwali as a school holiday in New York City. The Federation of Indian Associations (FIA) of the tri-state area of New York, New Jersey and Connecticut, the leading umbrella community organisation in the US, partnered with the Empire State Building to illuminate the iconic Manhattan building for the festival. Shining in orange tonight in celebration of DiwaliText CONNECT to 274-16 to get alerts on our Lights!Watch tonight's lighting here: https://t.co/O9J9aS1frk",
        "url": "https://www.ndtv.com/world-news/new-york-celebrates-diwali-empire-state-building-lit-up-in-orange-hues-4569466",
        "image": "https://c.ndtvimg.com/2023-11/t88hqhm8_empire-state-building_625x300_13_November_23.jpeg?ver-20231016.06",
        "publish_date": "2023-11-13 06:19:39",
        "authors": [],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.631
    },
    {
        "id": 196531375,
        "title": "Took us far too long to get this ‘niche bilingual joke’ but it was very much worth it in the end",
        "text": "First in an occasional and surely unique series, niche bilingual joke of the day comes courtesy of author @NJSimmondsbooks over on Twitter. I love this very niche joke that maybe 5 of my followers will get pic.twitter.com/ByhdFC9Npk — Natali Simmonds / N J Simmonds (@NJSimmondsbooks) March 4, 2024 And here it is again, in the […]",
        "url": "https://www.thepoke.com/2024/03/06/took-us-far-too-long-to-get-this-niche-bilingual-joke-but-was-very-much-worth-it-in-the-end/",
        "image": "https://www.thepoke.com/wp-content/uploads/2024/03/Screenshot-2024-03-06-at-16.24.28.png",
        "publish_date": "2024-03-06 17:26:43",
        "author": "John Plunkett",
        "authors": [
            "John Plunkett"
        ],
        "language": "en",
        "source_country": "gb",
        "sentiment": 0.417
    },
    {
        "id": 164051813,
        "title": "Indian rescuers just feet away from reaching 41 workers trapped in collapsed tunnel for over 2 weeks",
        "text": "Most of the trapped workers are migrant labourers from across the country. Many of their families have traveled to the location, where they have camped out for days to get updates on the rescue effort and in hopes of seeing their relatives soon. Authorities have supplied the trapped workers with hot meals through a 6-inch (15-centimetre) pipe after days of surviving only on dry food sent through a narrower pipe. They are getting oxygen through a separate pipe, and more than a dozen doctors, including psychiatrists, have been at the site monitoring their health. The tunnel the workers were building was designed as part of the Chardham all-weather road, which will connect various Hindu pilgrimage sites. Some experts say the project, a flagship initiative of the federal government, will exacerbate fragile conditions in the upper Himalayas, where several towns are built atop landslide debris. Large numbers of pilgrims and tourists visit Uttarakhand’s many Hindu temples, with the number increasing over the years because of the continued construction of buildings and roadways.",
        "url": "https://torontosun.com/news/world/indian-rescuers-just-feet-away-from-reaching-41-workers-trapped-in-collapsed-tunnel-for-over-2-weeks",
        "image": "https://smartcdn.gprod.postmedia.digital/torontosun/wp-content/uploads/2023/11/India-Tunnel-Collapse-6-scaled-e1701179614338.jpg?quality=100&strip=all",
        "publish_date": "2023-11-28 14:56:27",
        "author": "AP Photo, Associated Press",
        "authors": [
            "AP Photo",
            "Associated Press"
        ],
        "language": "en",
        "source_country": "ca",
        "sentiment": 0.35
    },
    {
        "id": 192613529,
        "title": "Britney Spears describes herself as 'girl who used to be famous",
        "text": "The West Australian Perth Now Click to open navigation ‌‌ Confidential Movies Best Short Film Television Music Reviews Books Competitions Camera IconBritney Spears Credit: BANG - Entertainment News Britney Spears describes herself as 'girl who used to be famous' BANG - Entertainment NewsBang Showbiz February 22, 2024 7:04PM Topics Share to Facebook Share to Twitter Email Us Copy the Link Your Local News Share to TwitterShare to FacebookShare to InstagramShare to YoutubeEmail UsGet Digital Edition Perth Now Email UsNewsletter Chevron Down IconSubmit story tip Camera IconSubmit photos Get Digital EditionDigital edition Chevron Down IconBack to top",
        "url": "https://www.perthnow.com.au/entertainment/celebrity/britney-spears-describes-herself-as-girl-who-used-to-be-famous-c-13693671",
        "image": "https://images.perthnow.com.au/publication/C-13693671/dd0a1c6b2c3901203675e4dbf0f4a416d5748974-16x9-x0y317w650h366.jpg?imwidth=1200",
        "publish_date": "2024-02-22 12:04:59",
        "author": "BANG - Entertainment News",
        "authors": [
            "BANG - Entertainment News"
        ],
        "language": "en",
        "source_country": "au",
        "sentiment": 0.652
    },
    {
        "id": 188887859,
        "title": "Tory MSP stands down from Holyrood to take up position at Scotland Office",
        "text": "A Tory MSP has swapped the Scottish Parliament for the House of Lords to take up a position within the Scotland Office. Lord Donald Cameron has served as a list MSP for the Highlands and Islands region since 2016. He will become a parliamentary undersecretary of state at the Scotland Office. The King approved the appointment on Friday and conferred a life peerage on Lord Cameron. Lord Cameron said: “I am honoured to have been appointed as a UK Government minister and to the House of Lords. “As part of the Scotland Office team I look forward to continuing our work representing Scotland at the heart of Whitehall, upholding the devolution settlement, and ensuring Scotland continues to benefit from the UK Government’s ambitious levelling up agenda.” Lord Cameron was an advocate, passing the bar in 2005. Alister Jack, Secretary of State for Scotland, said: “I welcome Donald Cameron’s appointment at the Scotland Office. “He is a talented lawyer as well as an experienced parliamentarian. I know Donald will do a great job helping us to deliver on the priorities of people in Scotland.”",
        "url": "https://www.standard.co.uk/news/politics/scotland-holyrood-house-of-lords-scottish-parliament-highlands-and-islands-b1138299.html",
        "image": "https://static.standard.co.uk/2024/02/09/18/b8f72f1331532936fdff3331a8c9d829Y29udGVudHNlYXJjaGFwaSwxNzA3NTg5NTEz-2.55520129.jpg?width=1200",
        "publish_date": "2024-02-09 19:40:43",
        "author": "Lauren Gilmour",
        "authors": [
            "Lauren Gilmour"
        ],
        "language": "en",
        "source_country": "gb",
        "sentiment": 0.649
    },
    {
        "id": 166364141,
        "title": "Accomplishment reflects BJP’s growing popularity: Tanavade",
        "text": "Panaji: The Goa state BJP president and Rajya Sabha MP Sadanand Shet Tanavade, on Monday, told the BJP national president J P Nadda that the state party is committed to work collaboratively towards winning both the seats in Goa in the upcoming Lok Sabha elections 2024. He met Nadda in New Delhi on Monday and congratulated him on the party’s victory in assembly polls of three states. During the meeting, Tanavade extended his heartfelt congratulations to BJP national president for the impressive electoral successes in Madhya Pradesh, Chhattisgarh, and Rajasthan. Additionally, Tanavade congratulated Nadda for the notable increase in vote share in Telangana, resulting in the rise in the number of MLAs in the state. “This accomplishment reflects the party’s growing popularity and the positive response from the electorate in Telangana,” he said. Tanavade said that he took the opportunity to apprise Nadda of the organisational aspects of the BJP Goa unit. He provided insights into the current state of affairs and shared valuable feedback on the ways to strengthen the party’s presence in the state. The discussion included various organisational matters, with a focus on enhancing BJP’s engagement and outreach in Goa. Tanavade expressed his gratitude for the opportunity to meet with Nadda and reiterated his commitment to working towards winning both the seats in the upcoming Lok Sabha elections in Goa.",
        "url": "https://www.navhindtimes.in/2023/12/05/goanews/accomplishment-reflects-bjps-growing-popularity-tanavade/",
        "image": "https://www.navhindtimes.in/wp-content/uploads/2020/08/The-Navhind-Times-Logo-Mobile-Mainpage.png",
        "publish_date": "2023-12-04 21:39:43",
        "author": "Navhind Times",
        "authors": [
            "Navhind Times"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.489
    },
    {
        "id": 169277337,
        "title": "Official UK Trailer for Acclaimed Meditative Film 'Samsara' Set in Laos",
        "text": "Official UK Trailer for Acclaimed Meditative Film 'Samsara' Set in Laos by Alex Billington December 12, 2023Source: YouTube \"The world opens to those who open up to it.\" Curzon in the UK has unveiled a trailer for an acclaimed film called Samsara, described as a \"highly immersive and meditative film by artist and director Lois Patiño.\" Not to be confused with Ron Fricke's meditative globe-spanning documentary also called Samsara (2012). The term \"saṃsāra\" is actually a Pali/Sanskrit word that means \"wandering\" as well as \"world,\" wherein the term connotes \"cyclic change\" or, less formally, \"running around in circles.\" In the temples of Laos, teenage monks accompany a soul in transit from one body to another through the bardo. A luminous and sonorous journey leads to reincarnate on the beaches of Zanzibar, where groups of women work in seaweed farms. Berlinale adds: \"In this conversation held on the border between life, death & meditation, Patiño continues his exploration of the image as an immersive experience. [As with films] by Apichatpong Weerasethakul, the cycle of birth, death and reincarnation coincides with the experience of watching. The act of seeing and of telling stories becomes a unique visionary experience that literally leads the viewer into another dimension.\" Here's the first official UK trailer (+ poster) for Lois Patiño's Samsara, direct from YouTube: Intro from Berlinale: \"Laos. Dozens of teenagers are living and studying together in Buddhist temples. A young man crosses the river every day to read a text to an elderly woman that serves as a guide for finding one’s way through the afterlife. When the woman dies, her spirit begins a sensory journey towards reincarnation in its next body. To complete the journey, you have to entrust yourself to be carried away by the sound and light.\" Samsara (2023) is directed by the Spanish artist / filmmaker Lois Patiño, director of the film Red Moon Tide, and also the doc Coast of Death previously, along with many other short films. The screenplay is written by Garbiñe Ortega and Lois Patiño. It's produced by Leire Apellaniz. The film initially premiered at the 2023 Berlin Film Festival earlier this year. Curzon will release Patiño's Samsara film in UK cinemas + on VOD starting January 26th, 2024. No US release date is set yet - stay tuned. Worth a look? Find more posts: Foreign Films, Indies, To Watch, Trailer",
        "url": "https://www.firstshowing.net/2023/official-uk-trailer-for-acclaimed-meditative-film-samsara-set-in-laos/",
        "image": "https://media2.firstshowing.net/firstshowing/img16/SamsaraPostermainimagebigcolorTsr1.jpg",
        "publish_date": "2023-12-14 00:08:45",
        "author": "Alex Billington, Google Inc",
        "authors": [
            "Alex Billington",
            "Google Inc"
        ],
        "language": "en",
        "source_country": "us",
        "sentiment": 0.432
    },
    {
        "id": 188071631,
        "title": "Drake trends on X over alleged 'leaked' X-rated video - as rapper 'appears to respond' to social...",
        "text": "Drake has become the number one trending topic on X after an alleged X-rated video of the star was reportedly leaked online. The rapper, 37, who recently slammed the Grammys, set the internet abuzz and fans into a frenzy after a clip emerged appearing to show the star laying in bed naked and engaging in a sex act. Hundreds of thousands of fans quickly began responding to the clip in disbelief. The rapper has not issued issued an official response or statement to the video. Kick streamer Adin Ross, who is friends with the rapper, claimed he sent a voice memo to Drake saying: 'We was just looking at the s**t. It’s like crazy bro, like god damn. 'You’re blessed with your voice, you’re blessed with performing, you’re blessed to be you, you’re blessed to be number one and you’re also blessed to have a f**king missile.' Ross claimed Drake responded to him with 'eight laughing face emojis' and might use the voice memo as his 'next album intro.' It is not clear if Drake's alleged response was the star confirming the video was him. He has not made any further comments on the situation orvideo. DailyMail.com has contacted Drake's representatives for comment. This comes after Drake slammed the Grammy Awards 2024 claiming 'it doesn't dictate s***' while furious SZA fans demanded that she was 'robbed' of an award on Sunday. Following Taylor Swift's victory Album Of The Year win, the rapper and SZA's fanbase has hit out at the awards ceremony. Taylor, 34, made history as she earned the top honor at the end of the night for her album Midnights in a surprise appearance by music icon Celine Dion. Drake, who wasn't in attendance at the ceremony this year, has since snubbed Taylor's win as he took to Instagram to re-share his iconic 2019 acceptant speech after picking up a Grammy five years ago. Alongside the repost, he wrote: 'All you incredible artists remember this show isn't the facts it's just the opinion of a group of people whose name are kept a secret (literally you can google it). 'Congrats to anybody winning anything for hip hop but this show doesn't dictate s*** in our world.' Meanwhile, SZA fans claimed the artist should have scooped the Album Of The Year award instead of Taylor, despite her already winning three awards. Taking to X, formerly known as Twitter, fans of the singer gushed to the comments to demand she was robbed of her success. Some wrote: 'sza snubbed for album of the year #GRAMMYS' 'SZA got robbed omfg'. SZA was the most nominated artist coming into the event with nine. She won Best R&B Song for her hit Snooze, Best Pop Duo/ Group Performance with Phoebe Bridgers for Ghost In The Machine as well as the Best Progressive R&B Album for SOS. Others nominated for Best Album include Oliva Rodrigo, Miley Cyrus, Jon Batiste, Janelle Monae and Boygenius.",
        "url": "https://www.dailymail.co.uk/tvshowbiz/article-13053653/Drake-trends-X-alleged-leaked-X-rated-video-rapper-appears-respond-social-media-furore.html?ns_mchannel=rss&ns_campaign=1490&ito=1490",
        "image": "https://i.dailymail.co.uk/1s/2024/02/06/22/80937857-0-image-m-23_1707258105998.jpg",
        "publish_date": "2024-02-07 02:15:56",
        "author": "Editor, Queen Camilla",
        "authors": [
            "Editor",
            "Queen Camilla"
        ],
        "language": "en",
        "source_country": "gb",
        "sentiment": 0.331
    },
    {
        "id": 162417743,
        "title": "30 single pan bands move to Arima semifinals - Trinidad and Tobago Newsday",
        "text": "The preliminaries of the single pan competition were concluded on November 18 and 30 bands move on to the semifinals, which will be held this Saturday at the Arima Velodrome, Arima. On November 20, Pan Trinbago announced the qualifying bands. Forty-five bands played for a semifinal spot. In a press release, the organisation said the body “successfully wrapped up the single pan preliminaries, a six-day event, spanning four regions. “The competition featured outstanding performances by 45 single pan steelbands, showcased musical excellence, camaraderie, and an infectious energetic spirit.” Pan Trinbago president Beverley Ramsey-Moore was quoted as commending the 45 bands that graced “this iconic competition with exceptional performances. “The end of these preliminaries signifies not just a competition but a celebration of unity, musical prowess, and the enduring legacy of the steelpan art form. Pan Trinbago commends the showcased skills from all the bands, setting a commendable standard for musical excellence and unity. “This event has significantly raised the bar, establishing a foundation for an unforgettable journey leading up to the Panorama 2024 finals,” she said. The 2023 single pan champions San Juan’s Chord Masters was at the top of the qualifying list with 277 points, playing the Mighty Gabby’s Doctor Cassandra. Newtown Playboys was in second place with 268 points, playing the late Kitchener’s Pan In A Minor. San Juan East Side Symphony rounded off the top three, getting 266 points playing Mac Fingall’s Big Belly Man. The semifinals on November 25 start from 4 pm. Qualifying bands: 1 Chord Masters Steel Orchestra 2 Newtown Playboys 3 San Juan East Side Symphony 4 New Age Trendsetters 5 D’Brimblers 6 Marsicans 7 Arima All Stars Steel Orchestra 8 D’Original Woodbrook Modernaires 9 Trinidad Nostalgic Steel Orchestra 10 East Phonics Steel Orchestra 11 Stardust Steel Orchestra 12 Trinidad East Side Symphony 13 TT Prison Service Steel Orchestra 14 Woodbrook Playboyz Steel Orchestra 15 La Famille United 16 Pan Elites Steel Orchestra 17 TT Police Steel Orchestra 18 Ice Water Pan Ensemble 19 Platinum Steel Orchestra 20 Uni Stars 21 Gonzales Sheikers 22 Metro Stars 23 Curepe Polyphonics 24 TT Fire Service Steel Orchestra 25 Nostrand Symphony 26 San Juan All Stars Steel Orchestra 27 Pan Stereonettes Steel Orchestra 28 Edinburgh 500 Steel Ensemble 29 St Thomas Silver Stars Steel Orchestra 30 Nu Pioneers Pan Groove",
        "url": "https://newsday.co.tt/2023/11/23/30-single-pan-bands-move-to-arima-semifinals/",
        "image": "https://newsday.co.tt/wp-content/uploads/2023/11/21965142.jpg",
        "publish_date": "2023-11-23 12:17:09",
        "author": "Melissa Doughty",
        "authors": [
            "Melissa Doughty"
        ],
        "language": "en",
        "source_country": "tt",
        "sentiment": 0.603
    },
    {
        "id": 178572311,
        "title": "Halle Berry, Kiefer Sutherland lead tributes to Adan Canto",
        "text": "The West Australian Perth Now Click to open navigation ‌‌ Confidential Movies Best Short Film Television Music Reviews Books Competitions Camera IconHalle Berry Credit: BANG - Entertainment News Halle Berry, Kiefer Sutherland lead tributes to Adan Canto BANG - Entertainment NewsBang Showbiz January 10, 2024 5:06PM Topics Share to Facebook Share to Twitter Email Us Copy the Link Your Local News Share to TwitterShare to FacebookShare to InstagramShare to YoutubeEmail UsGet Digital Edition Perth Now Email UsNewsletter Chevron Down IconSubmit story tip Camera IconSubmit photos Get Digital EditionDigital edition Chevron Down IconBack to top",
        "url": "https://www.perthnow.com.au/entertainment/celebrity/halle-berry-kiefer-sutherland-lead-tributes-to-adan-canto-c-13178467",
        "image": "https://images.perthnow.com.au/publication/C-13178467/316ac53d31eadc33f801e550c48996cf1fe62282-16x9-x0y317w650h366.jpg?imwidth=1200",
        "publish_date": "2024-01-10 10:06:28",
        "author": "BANG - Entertainment News",
        "authors": [
            "BANG - Entertainment News"
        ],
        "language": "en",
        "source_country": "au",
        "sentiment": 0.627
    },
    {
        "id": 164181517,
        "title": "Village lodge empowering community to conserve wildlife",
        "text": "People in Group Village Head (GVH) Linyangwa, along Kasungu National Park’s eastern boundary, now detest even the mere thought of tampering with wildlife in the park, for they are benefiting development projects and financial support to venture into businesses, among others. Through Linyangwa Conservation and Cultural Village Lodge—a community-owned initiative often supported by Kasungu National Park—community members are empowered to refrain from committing wildlife crimes, attracting admiration from neighbouring communities and those along other parks and wildlife reserves. The village lodge, situated 2.7 kilometers from the park’s main gate, began operating in early 2022, generating income which is channeled towards community development and empowerment initiatives, thereby reducing or diminishing people’s appetite to rely on wildlife. The compound is picturesque amidst natural trees and farms, featuring four self-contained rooms, summer huts, office and reception, huge water tank and large open space, among others. Accommodation, restaurant, bar, leisure and wildlife conservation and cultural practices are some of the services offered, mostly targeting tourists visiting Kasungu National Park. At least 100 visitors seek various services every month, enabling the community to earn a profit of between MK150,000 to MK170,000, according to Managing Director, Kenan Chitsime. “Among other important things, we also use the money to repair boreholes, pay school fees for orphaned and needy children and improve the lodge’s infrastructure. “As the place will be expanding and profit increasing, we will support more community members to venture into small scale businesses,” said Chitsime. A reed fence rings the “cherished treasure” for over 2300 subjects of GVH Linyangwa under Senior Chief Lukwa. GVH Linyangwa actually hatched the idea of Linyangwa Conservation and Cultural Village Lodge as early as 2014, setting himself off on a long journey of rallying his subjects towards actualizing the idea, aimed at promoting wildlife conservation, tradition and culture and local tourism. By the end of 2021 to early 2022, the village lodge had few of its structures taken shape and struggling to conduct business. Then Kasungu National Park, through Promoting Investment and Competitiveness in Tourism Sectors project funded by African Development Bank, provided support to the facility, including improving water access, provision of solar power and renovation of rooms, among others. The aim was to make the place become more attractive and appealing to visitors. The park also sends some of its visitors to the village lodge, according to Chitsime, who is grateful for this partnership. Chitsime says the facility operates through three components, namely: wildlife conservation, culture and tradition and lodge. He adds that specific services through these components attract specific visitors. “On wildlife conservation, for instance, we civic educate and encourage community members and visitors to refrain from wildlife crimes. We encourage them to report any stray animals to officials of Kasungu National Park. “Park officials give us extension services in that regard, which makes people cultivate good behaviours and attitudes towards wildlife, resulting in reduction in crime and human-wildlife conflicts along the park, among others”. Apparently, Kasungu National Park, being the second-largest in Malawi and having a wide variety of animal and plant species, attracts scores of both well-meaning tourist visitors and crime mongers, from within Kasungu District and across the country. Before the village lodge started operating, according to Chitsime, at least 100 people from GVH Linyangwa committed various wildlife crimes every year in the park, including encroachment, poaching, cutting down trees and charcoal burning. Now, he says, there are fewer crime cases or even none. According to statistics from the Department of National Parks and Wildlife, Kasungu registered only 10 arrests and 10 convictions involving wildlife crimes from January to October 2023, perhaps indicating that the village lodge may have contributed to this reduction. Otherwise the arrests and convictions were too many in 2020 to 2021—124 and 47—respectively. In 2022, there were 18 arrests and 66 convictions. Elizabeth Zimba, 42, says she is, therefore, proud to belong to Linyangwa Conservation and Cultural Village Lodge, an initiative aimed at eliminating wildlife crimes along Kasungu National Park, which has “enhanced her passion for development and conserving wildlife”. Thokozani Nkhoma, 26, says the initiative changed for the better her mindset and attitude towards wildlife, adding, “I am committed to the cause of achieving the ultimate vision of the village lodge”. GVH Linyangwa says the facility would be a hub for future generations to learn how to conserve wildlife and traditions and culture. “Many people should know this place and learn from what is happening here. Our aim is to develop this place to levels where even the government can collect taxes to enable it provide vital social services to other needy communities”. Park Manager for Kasungu National Park, Ndaona Kumanga, cherishes the good partnership existing between the park and the GVH Linyangwa community, stressing that “communities participation in conservation is critical because the park cannot win the conservation battle alone”. “The community indeed loves conservation and nature and is passionate about these things. They are even helping us in maintaining the fence line to restrain stray animals and crime mongers, among others. “As a park, we will continue supporting them in order to contribute towards achieving and sustaining the ultimate objectives of their village lodge”. GVH Chimwala, neighbouring GVH Linyangwa, hopes “to rally his subjects towards emulating the initiative by their neighbours”. His sentiments are shared by GVHs Chazolokela and Timbenao, along Nkhotakota Wildlife Reserve and Majete Wildlife Reserve in Chikwawa, respectively. “Lack of resources is a challenge standing in our way. However, we hope to use the good relations we have with our neighbors to learn from them how they are doing it,” GVH Chimwala said. However, oblivious to GVH Timbenao, African Parks, which manages Majete Wildlife Reserve, is already supporting GVH Njereza’s community along the reserve in implementing a similar project dubbed Game Capture Community Campsite, according to Dixie Makwale, Community Extension Manager. Makwale said the campsite generates at least MK18 million annually, an amount Majete Wildlife Reserve Association injects into various community development initiatives in GVH Njereza, Traditional Authority Kasisi and all other communities along the reserve. “Such initiatives are indeed important. People support conservation in protected areas if they are involved and see tangible benefits through various means of getting money”. Back at Linyangwa Conservation and Cultural Village Lodge, Chitsime surveys the surroundings and then makes a passionate appeal for more support. “Further improvements are required here, especially having more rooms is important. Otherwise some visitors are sent back because of lack of space and we lose business. There is also the need to vigorously market this place,” he says. Sharing is caring!",
        "url": "https://www.nyasatimes.com/village-lodge-empowering-community-to-conserve-wildlife/",
        "image": "https://www.nyasatimes.com/wp-content/uploads/IMG_20231122_143239_360.jpg",
        "publish_date": "2023-11-28 22:39:46",
        "author": "Kasungu National Park, Nyasa Times Reporter",
        "authors": [
            "Kasungu National Park",
            "Nyasa Times Reporter"
        ],
        "language": "en",
        "source_country": "mw",
        "sentiment": 0.354
    },
    {
        "id": 154977567,
        "title": "Thank you for subscribing!",
        "text": "Newly engaged and relishing a newfound sense of contentment, Roz Purcell is embracing a slower, simpler life. The author of \"The Hike Life\" recently opened up about fellow radio presenter and impersonator Doireann Garrihy's impressions of her. In response to questions about Doireann's mimicry, if she found them funny or insulting, Roz exhibited a refreshing nonchalance, stating: “I don’t mind them.” READ MORE: Roz Purcell breaks tradition in her quest to find the perfect wedding dress \"I grew up in a house where everyone rips the piss out of each other so I just don’t take things seriously\" she told The Irish Independent. Roz, who has seamlessly embraced her new role as a RTÉ 2FM radio presenter alongside her thriving career, further elaborated on her perspective, highlighting her familiarity with Doireann's work: “Also, I know Doireann and I’ve worked with her. The mimicry she does is a different side to her; it’s not her trying to be mean to anybody,\" Roz explained. Describing her ability to find humour even in impersonations of herself, she shared: “There are times when I have tuned in in the morning on the way to a hike and she’s doing me and I’m in stitches laughing and I’ll text in and say, ‘Oi, I’m listening!’ \"Although any time I do a voice note and I listen back, all I hear is Doireann…” she added. While Roz has embraced her role on 2FM and continues to grow her presence in the public eye, her partner of seven and a half years, Zach Desmond, remains a private figure in their relationship. In August 2023, Zach proposed, and Roz revealed on a recent episode of The Late Late Show that they're eager to tie the knot soon. Zach, the son of renowned figures in the music industry, Denis Desmond and Caroline Downey, leads a life away from the public gaze. As Roz affectionately describes him, he is a “super-private” person, allowing the couple to find balance between their public and private worlds. READ MORE: Roz Purcell breaks tradition in her quest to find the perfect wedding dress Get the latest RSVP headlines straight to your inbox for free by signing up to our newsletter Join our new WhatsApp community! Click this LINK to receive your daily dose of RSVP Live content. We also treat our community members to wonderful competitions, promotions, along with great stories. If you don’t like our community, you can check out any time you like. If you’re curious, you can read our Privacy Notice",
        "url": "https://www.rsvplive.ie/news/celebs/roz-purcells-opinion-doireann-garrihys-31303416",
        "image": "https://i2-prod.rsvplive.ie/incoming/article31303406.ece/ALTERNATES/s1200/0_Screenshot-2023-10-28-at-144344.png",
        "publish_date": "2023-10-28 16:38:24",
        "author": "Tara McCormack",
        "authors": [
            "Tara McCormack"
        ],
        "language": "en",
        "source_country": "ie",
        "sentiment": 0.641
    },
    {
        "id": 155922643,
        "title": "The Day of the Dead in Mexico is a celebration for the 5 senses",
        "text": "MEXICO CITY (AP) — The Day of the Dead in Mexico smells like cempasuchil flowers and copal incense. It has a sweet taste. Sounds and colors abound. There are photos, candles and music all over. The hands of artisans prepare the altars to honor their ancestors. Although it is an intangible tradition, borne down from pre-Hispanic cultures, Day of the Dead is also a celebration for all the senses —even if one of them is failing you. Gerardo Ramírez, who over the years become almost blind, sums it all up in one line: “You honor people, you connect with the past.” THE SMELL THAT GUIDES YOU FROM THE UNDERWORLD Together, two smells show dead souls the way out of the underworld: cempasúchil — a type of marigold whose name means “flower of 20 petals in Náhuatl language” — and a tree resin called copal burned at altars. The native species of cempasúchil smells so strong you can almost hear it, said Verenice Arenazas, a young woman who traded her HR job for her family’s traditional flower field. “As soon as you move it, it tells you ‘here I am, look at me'” she said. Her family this year produced 17,000 cempasúchil plants in Xochimilco, Mexico City’s famed canal-crossed southern borough. Arenazas’ family grows two types of cempasúchil: those grown by selecting seeds from the most potent-smelling flowers and those that are genetically modified. Both are nearly sold out, she said with a smile. Arenazas says the flowers smell like the “sweet, fresh, honest work” of the farmers like her who dedicate unending days caring for the flowers. They also smell of “Mexican pride,” she said. FOOD FOR THE DEAD On the traditional altars honoring the dead, food is a symbol of Mother Earth. Even the sweetest bread, flavored with orange blossom, has grizzly origins. According to researchers at the Mexican School of Gastronomy, the dough was prepared by mixing honey and human blood as an offering to the gods. Other historians believe that Spanish colonizers, frightened by human sacrifices in Mexico, created a bread, dipped in sugar and painted it red, to symbolize a heart. Today there is a special place on altars for the dead person’s favorite food and drink. “The offering loses flavor,” explained Ramírez, “because the dead actually come back; what they eat is the essence.” Ramírez explained the communion between the living and the dead recalling an anecdote that marked him when he was a child. When his uncle died, the family placed his body on the dining table until the coffin arrived. Then they all sat down to eat there. THE CREATIVE HANDS PREPARING THE ALTAR Preparing an altar is a great pleasure to many Mexicans. “To feel the softness of the flowers, where you put the food, all the textures,” said Ramírez. “It’s an explosion of sensations.” Altars welcome all sorts of handicrafts, from papier-mache skeletons to alebrijes (imaginary animal figures), but“papel picado” – very thin sheets of colored paper cut-outs – is essential. There are places where “papel picado” is still made with hammer and chisel, as in the workshop of Yuriria Torres, located south of Mexico City. “It’s like sculpting” a work of art, says Torres, who still does the whole process by hand, eschewing stencils or laser cutters. Some people connect Torres’ art to the sheets of amate tree bark used by pre-Hispanic communities as paper, though the Indigenous precursor was not dyed. Others say the careful cuttings originated in China, and were brought to Mexico by the Spaniards. Either way, researchers agree that it symbolizes the union between life and death. Perhaps for that reason, the scenes that Torres represents are skulls or skeletons dancing or eating. MUSIC OVER THE TOMBS While some older Mexicans remember hearing only the murmur of prayers characterizing the Day of the Dead, today mariachi music can be heard over the decorated tombs of many cemeteries. José García, a 60-year-old shoe shiner from San Antonio Pueblo Nuevo, a township 90 miles (140 kilometers) west of Mexico City, said people with money would bring a group of musicians to the cemetery to toast with their departed loved ones and listen to their favorite songs. But, he adds, one doesn’t have to have money to enjoy the music. Some people just bring “their recordings or their horns,” he said. PHOTOS OF THE DEPARTED Day of the Dead is one of Mexico’s great visual spectacles — and a celebration of cultural syncretism. All the while, its fundamental purpose is to remember those who have died so their souls don’t disappear forever. Photos of the departed loved ones take the most important spot on the altar. Colors fill everything. The bright orange of the cempasúchil, the black of the underworld, the purple of the Catholic faith, red for warriors and white for children. Remembrance is not only individual, but collective. Some more political altars in the country’s main public university, the National Autonomous University of Mexico, remembered murdered students and the Palestinian dead in the Israel-Hamas war. Elsewhere remembrance is institutional, like the offering in the capital’s Zócalo in honor of the revolutionary Pancho Villa on the centenary of his death. Beyond the visual spectacle, the important thing is to “get into” the offering, to connect with the past and go beyond the senses, insists Ramírez. “It’s not something they explain to you,” he says. “From the moment you are born and experience the celebration, it’s in your DNA.” ____ Follow AP’s coverage of Latin America and the Caribbean at https://apnews.com/hub/latin-america María Verza And Fernanda Pesce, The Associated Press",
        "url": "https://toronto.citynews.ca/2023/10/31/the-day-of-the-dead-in-mexico-is-a-celebration-for-the-5-senses/",
        "image": "https://toronto.citynews.ca/wp-content/blogs.dir/sites/10/2023/10/20231031201016-65419971b17b369397529973jpeg.jpg",
        "publish_date": "2023-11-01 01:19:08",
        "author": "Mar, News Staff",
        "authors": [
            "Mar",
            "News Staff"
        ],
        "language": "en",
        "source_country": "ca",
        "sentiment": 0.562
    },
    {
        "id": 167185737,
        "title": "Makeover: A nurse practitioner adds polish to her look",
        "text": "Before styling, I applied Oribe Hair Crème for Style through her roots to ends and blow dried her hair using a large round brush. I then used a curling wand to add a soft wave to her style and finished the look with Oribe Après Beach Wave and Shine Spray. Makeup: I kept her makeup very simple and easy, and used peach, pink and bronzy tones to compliment her complexion. I applied a toffee coloured eyeshadow stick on her eyelid and tight lined her eyes with a brown liner to softly define her eyes. I dusted her face with a hint of bronzer and pink blush and used a sheer pink gloss to amplify her full lips. Makeup used: Foundation: MAC Studio FX Concealer: Stila Pixel Perfect Concealer in Fair Eyeshadow: Florence By Mills Eye Candy Eyeshadow Sticks in Toffee Eyeliner: Smashbox Always On Gel Liner in Brown Brows: Benefit Cosmetics Precisely My Brow Pencil in #2.5 with Gimme Brow #1 Bronzer: NARS Laguna Bronzer Lip: Sephora Collection Colorful Gloss Balm in Moon and Back Don’t miss the news you need to know — add VancouverSun.com and TheProvince.com to your bookmarks and sign up for our newsletters here. You can also support our journalism by becoming a digital subscriber: For just $14 a month, you can get unlimited, ad-lite access to The Vancouver Sun, The Province, National Post and 13 other Canadian news sites. Support us by subscribing today: The Vancouver Sun | The Province.",
        "url": "https://vancouversun.com/life/fashion-beauty/makeover-nurse-practitioner-polished-look",
        "image": "https://smartcdn.gprod.postmedia.digital/vancouversun/wp-content/uploads/2023/11/1210-col-makeover-web.jpg",
        "publish_date": "2023-12-07 20:00:31",
        "author": "Aleesha Harris, Mills Eye Candy",
        "authors": [
            "Aleesha Harris",
            "Mills Eye Candy"
        ],
        "language": "en",
        "source_country": "ca",
        "sentiment": 0.701
    },
    {
        "id": 189711925,
        "title": "UK Spring Fair offers plenty of inspiration and opportunities",
        "text": "I am grateful for the opportunity to visit the UK Spring fair last week in Birmingham. Several times the size of Australia’s largest gift fair, we got to see suppliers not currently represented in Australia as well as broader ranges from suppliers already represented. It was also good to meet Aussie suppliers to show what we liked. It was wonderful seeing how suppliers presented their ranges, like Paper Salad, which is available in Australia via Waterlyn. The stand was stunning and inspiring. Spring Fair is far more diverse in product categories than we see in Australia. We bought from several suppliers not represented locally. We also picked up some visual merchandising as well as product ranging tips that I think we will be able to use in-store. A big trend at the fair was British made. This was good to see. While cheaper offshore sourced products from bigger companies tended to have bigger stands, the British made message did stand out. Another noticeable trend was ethically copurced, sustainably sourced. These trends of product source and sustainable supply matter especially to Gen Alpha and Gen Z – important co-horts to our businesses. I appreciate not everyone can get to overseas trade shows. If you can, go. If you can’t see if your marketing group has people who go and can share their insights. Retail continues to evolve apace, especially in our channel. What we are and what we can sell continues to change and in this there are many opportunities. Getting offshore to see some ahead of us can be helpful, advantageous.",
        "url": "https://www.newsagencyblog.com.au/2024/02/12/uk-spring-fair-offers-plenty-of-inspiration-and-opportunities/",
        "image": "https://www.newsagencyblog.com.au/wp-content/uploads/2024/02/IMG_9891.jpeg",
        "publish_date": "2024-02-12 03:59:35",
        "author": "Mark Fletcher",
        "authors": [
            "Mark Fletcher"
        ],
        "language": "en",
        "source_country": "au",
        "sentiment": 0.772
    },
    {
        "id": 169280235,
        "title": "“A Midnight Clear” sees composer Cameron Wilson bring the house down",
        "text": "If you can only name a single classical violinist in Vancouver, it’s probably Cameron Wilson. As a prolific musician, composer, and arranger, he’s spent decades lending his bow to almost everyone in the city, from the symphony orchestra to Mariachi Del Sol; writing and performing jazz, chamber, Celtic, and cinematic songs that run the gamut from parody to profound. One of his longest-standing musical relationships is with Chor Leoni, Vancouver’s 70-strong men’s choir, which dates back over 20 years. “I feel like extended family, almost,” Wilson recalls in a Zoom call. “Diane Loomer, the original director, got me involved in arranging and in shows in the summertime at Bard on the Beach.” Over the years, Wilson has moved from arranging songs for the choir and being part of their accompanying band into creating original compositions. The first—and last—such piece was “Cadillac Cathedral”, a bluegrass and folk-tinged number that premiered in 2014 and had its attempted 2020 revival thwarted by the pandemic. “I’ve written a lot of instrumental music, not as much choral music, so that was a challenge,” Wilson explains. “An all-men’s choir, unlike a mixed choir, there’s limited range, because you don’t have the high soprano—it’s more mid-range and low.” This year marks Wilson’s first new Chor Leoni composition in almost a decade, which is set to premiere at the choir’s iconic Christmas concerts this weekend at St. Andrew’s-Wesley United in downtown Vancouver. The line-up features a mix of old and new, from “Silent Night” and “Auld Lang Syne” all the way through to modern favourites, like a reprise of Don MacDonald’s “A Fantasy of Carols” that premiered at last year’s Chor Leoni Christmas bonanza. Wilson’s offering, “A Midnight Clear”, is—as the name may clue you in—a reworking of beloved wintertime carol “It Came Upon a Midnight Clear”. That song, in turn, is based on an 1849 poem by Edmund Sears that, depending on whether you’re more influenced by the US or the UK, has two different melodies associated with it. While “It Came Upon a Midnight Clear” has always been one of Wilson’s favourite carols, initially, he struggled with working out how to rework the existing piece into a cohesive new composition. But an assist from Erick Lichte, Chor Leoni’s artistic director who commissioned the piece, helped him find his way into the music. “Erick rearranged all the text, and he labelled each of the sections,” Wilson recalls. “Once he did that, it was like having a roadmap and I was able to compose the music—it was like a lightbulb going on.” The resulting piece creates a three-part narrative, each section with a different tone and attitude that highlights the possibilities of what a choir can do. The first part, “Mystery”, is almost minimalistic: sparse, questioning, and mystical, wondering what is yet to come. That leads into the second part, “The Message”, where most of the text of the poem is set to an entirely new melody. The opening line, “It came upon a midnight clear, that glorious song of old” raised an important question: what is that song of old? “I sat down and kind of cycled out with the rhythm of the words until I got a melody that I liked.” Wilson explains. “It had to stick—for me to be happy with it, I had to come back the next day and remember it. And then it became like an earworm, and I couldn’t get rid of it.” The third and final part is the most out-of-the-box section. Wilson may be a classically trained violinist with decades of formal experience under his belt, but he also carries on a legacy of Ottawa Valley fiddling techniques from his father who learned it all by ear. “Hoedown of Hope” brings some of Wilson’s own jaunty, old-country fiddling to the score, balanced against the other instruments and the large choral presence, to upend expectations of what Christmas choral music can be. “It’s kind of funky. It’s not a sea shanty, but it has elements of that,” Wilson explains. “There’s a fiddle breakdown section where the band goes nuts.” While the Christmas concerts are traditionally a more reflective experience, “A Midnight Clear” aims to shake that up a bit. The triumphant ending, complete with bodhrán-style drumming and rousing harmonies, aims to illustrate the sheer power of hope. “Erick said, ‘Cam, I want you to bring the house down at the end of the piece,’” Wilson laughs. “No pressure—just bring the house down.” So if the church is mysteriously no longer standing come next week, we know who to blame. Christmas with Chor Leoni When: December 15 to 18, various times Where: St. Andrew’s-Wesley United, 1022 Nelson Street, Vancouver Admission: From $20, available here",
        "url": "https://www.straight.com/arts/a-midnight-clear-sees-composer-cameron-wilson-bring-house-down",
        "image": "https://www.straight.com/files/v3/styles/gs_feature/public/images/23/12/cameron-wilson_photo-by-vincent-lim.jpg?itok=EnVWlUv5",
        "publish_date": "2023-12-13 19:14:32",
        "author": "V.S. Wells",
        "authors": [
            "V.S. Wells"
        ],
        "language": "en",
        "source_country": "co",
        "sentiment": 0.364
    },
    {
        "id": 173973309,
        "title": "Weala residents gown Jeety for continuous humanitarian works",
        "text": "Indian philanthropist and renowned businessman Mr. Upjit Singh Sachdeva was gowned on Christmas Day by jubilant residents of Cinta in Weala, Margibi County in appreciation for his continuous humanitarian works that impact their lives. They hailed Mr. Sachdeva (Mr. Jeety) for his outstanding humanitarian gestures in Liberia, precisely Margibi County over the years. Despite being successful in his business ventures, the citizens said Mr. SachdevaJeety has never forgotten the importance of giving back to the community and as such, the need to appreciate his philanthropic efforts can never be overemphasised. Jeety received the honor on Christmas Day, when he and his team fed over 3,000 children in commemoration of Christmas, demonstrating his commitment to creating a positive impact on the Liberian society. Jeety, as his usual activities also fed over 1,000 inmates with hot meal, water and soft drinks coupled with the donation of additional plates and spoons at the Monrovia Central Prison (South Beach) including several disadvantaged youths (Zogoes) in Monrovia. Remarking during the gowning ceremony, Cinta Township Commissioner, Roland Johnson said their decision is in recognition of the good they continue to receive from the Indian business tycoon in their community. Commissioner Johnson, speaking on behalf of the citizens furthered that their decision is in recognition of the fact that Jeety’s philanthropic efforts have not gone unnoticed by them as direct beneficiaries of his kindness. Johnson noted that Jeety’s contributions to the welfare of the less fortunate and prisoners in Monrovia as well as the people of Weala and the country at large have already earned him respect and admiration from both locals and authorities across Margibi County. The Commissioner further thanked Jeety and his team for the construction of Jeety Rubber LLC Factory in Weala and the installation of running water, noting that the facility has already begun boosting the local economy as well as providing thousands of jobs for the citizens of Weala and its surroundings. He then extolled the government for creating an environment that allows investments to flourish, asserting, “Jeety Rubber LLC facility is a statement of his love and concern he has for this country and its people.” “Hence, we from this community want to thank you Jeety and we love and appreciate all that you are doing for our country and its citizenry,” he said. In response, Jeety thanked the citizens for the gift and honor bestowed upon him, and emphasized the need for those he described as the country’s future leader to be celebrated and catered to. He said recognizing Christmas can be a difficult time for those who lack parental care or live in challenging circumstances, Mr. Jeery disclosed that he and his team are committed to ensuring that smiles are put on the faces of the children every big day. To ensure that the children experience a glimmer of hope and happiness during the festive season, Jeety and his team further organized a heartwarming children’s party, ensuring that all of the kids in attendance feel the love and joy of Christmas. Collaborating with the county’s local authorities and volunteers, Mr. Jerry further arranged the party complete with decorations, gifts, and entertainment, as the joy and smiles on the children’s faces were a testament to the impact Jeety’s gestures had on their lives. The honor bestowed upon Jeety is a testament to his selflessness and dedication to the welfare of others and with his unwavering support for prisoners and children during holidays. Throughout the year, Jeety showcased his deep understanding of the challenges faced by some Liberians. Furthermore, his contributions have undoubtedly left an indelible mark on the lives of those he has reached out to, serving as an inspiration for others to follow in his footsteps.",
        "url": "https://thenewdawnliberia.com/weala-residents-gown-jeety-for-continuous-humanitarian-works/",
        "image": "https://thenewdawnliberia.com/govoampi/2023/12/Weala-Residents-gown-Jeety.jpg",
        "publish_date": "2023-12-27 16:05:17",
        "author": "New Dawn",
        "authors": [
            "New Dawn"
        ],
        "language": "en",
        "source_country": "lr",
        "sentiment": 0.412
    },
    {
        "id": 178132747,
        "title": "Pivotal starts selling Helix, the first production light",
        "text": "Starting price of $190,000 in the US for the single-seat all-electric personal aircraftThe smart aircraft packed with safety features requires no FAA pilot certification LAS VEGAS, Jan. 08, 2024 (GLOBE NEWSWIRE) -- Pivotal, the market leader in light electric vertical takeoff and landing (eVTOL) aircraft, is thrilled to announce the official launch of online sales for its highly anticipated flying vehicle, the Helix. The starting price for a Helix aircraft is $190,000 USD before taxes, delivery, or other fees, as applicable. Customers can place orders for delivery in the United States on Pivotal’s website at pivotal.aero. First customer shipments begin on June 10, 2024. Created for the awe of exploring the world from new heights, the Helix removes the barriers that prevent everyday adventurers from experiencing the joys of aviation. The Helix’s powerful capabilities are navigated with intuitive joystick controls, guided by a simple user interface. At the heart of this single-seat vehicle lies a robust fault-tolerant design, bolstered by triple modular flight control systems for safety and reliability. Efficient, compact, and simple, the Helix is transportable and easy to assemble — from storage to sky in 30 minutes. It disassembles to fit into a 16-foot trailer. \"We're proud to begin selling, and soon delivering, our Helix aircraft. The market is ready for the wonder of aerial recreation and short-hop eVTOL travel. We are ready to provide the beauty and freedom of personal flight to a whole lot of people with a passion for flying and an interest in creating a new generation of aviators and aviation,” said Ken Karklin, CEO, Pivotal. Early access customer Dean Owen added, “As one of Pivotal's BlackFly customers, I can't wait for more pilots to join the fold. There’s no better feeling than flying in this aircraft, and I want to share it with people like me who have dreamt of flying for a long time. This is an exciting moment to get in on the Helix and a growing community of Pivotal pilots.\" Helix PackagesThe Helix is offered in three configurations, with the ability to add accessories and services for further customization. Package 1 offers a white and carbon fiber exterior finish and includes a digital flight panel, canopy, HD landing camera, charger, vehicle cart, custom marking, comprehensive pilot training, and warranty; base price of $190,000Package 2 offers a gloss white and striped carbon fiber exterior finish and includes the features above, plus a trailer with dual wing cart; 4k camera with landing assist, recording, and sharing features; ADS-B air traffic system; two chargers; and enhanced warranty; base price of $240,000Package 3 offers an exterior in gloss white, carbon fiber, with custom accent color and includes the features above, plus a premium flight deck, three chargers, beacon aircraft lighting; integrated emergency locator transmitter, one additional training slot for a friend or family member; and the option to fully customize the exterior at additional cost, design dependent; base price of $260,000 For more details visit pivotal.aero/helix. For those interested in placing an order, here are some specifications: The Helix is only available in the United StatesCustomers can order the Helix online with a $250 non-refundable application feeTo secure a Helix production slot and forecasted ship date, a deposit of $50,000 is due within five business days of initial order placementThe Helix is manufactured in Palo Alto, California No Pilot License Needed; Training Is RequiredThe Helix complies with FAA Part 103 (Ultralight) category in the United States. The FAA requires Ultralight aircraft to fly over non-congested areas only and away from airports. Under this regulation, no pilot license is required. All Helix pilots must successfully complete comprehensive initial and periodic recurrent flight training to support safe operations in all situations. Customers will select their training dates and receive delivery timing once Pivotal receives the aircraft deposit. About PivotalPivotal (fka Opener.Aero) designs, develops, and manufactures light eVTOL aircraft. As an industry pioneer, Pivotal is renowned for the BlackFly, the first light eVTOL to enter the market. The company’s distinctive tilt-aircraft architecture and scalable platform have been under continuous improvement for over twelve years, and today, the Pivotal Helix offers the most mature technology in the light eVTOL category. Efficient, compact, and simple, Pivotal vehicles are designed for a wide range of consumer, public service, and defense applications. The company is headquartered in Palo Alto, CA. For videos and more information, visit https://pivotal.aero. Media Contact Heidi Groshelle press@pivotal.aero A video accompanying this announcement is available athttps://www.globenewswire.com/NewsRoom/AttachmentNg/2d273913-a4c1-44bb-90ed-376f0d50a51a Photos accompanying this announcement are available at https://www.globenewswire.com/NewsRoom/AttachmentNg/51adc9e1-728f-49b6-b01b-edd16173f844https://www.globenewswire.com/NewsRoom/AttachmentNg/0f83d7c8-df30-4819-9269-123eada95fc2https://www.globenewswire.com/NewsRoom/AttachmentNg/b7c5f7b7-8afc-454a-923c-09866ae3d877 Source link The content is by Globe Newswire. Headlines of Today Media is not responsible for the content provided or any links related to this content. Headlines of Today Media is not responsible for the correctness, topicality or the quality of the content.",
        "url": "https://www.headlinesoftoday.com/topic/press-releases/pivotal-starts-selling-helix-the-first-production-light.html",
        "image": "https://cdn.headlinesoftoday.com/wp-content/uploads/2023/11/a9f9e257-30cb-4458-9f84-4af62a77e3b7-scaled.jpeg",
        "publish_date": "2024-01-09 04:34:50",
        "author": "GlobeNewswire",
        "authors": [
            "GlobeNewswire"
        ],
        "language": "en",
        "source_country": "in",
        "sentiment": 0.647
    },
    {
        "id": 154369011,
        "title": "ASX News, Financial News on Stocks & ASX Share Market - Kalkine Media",
        "text": "Welcome to Kalkine Media Pty Ltd. website. Your website access and usage is governed by the applicable Terms of Use & Privacy Policy. Welcome to Kalkine Media LLC website. Your website access and usage is governed by the applicable Terms and Conditions & Privacy Policy. Welcome to Kalkine Media New Zealand Limited website. Your website access and usage is governed by the applicable Terms and Conditions & Privacy Policy. Welcome to Kalkine Media Incorporated website. Your website access and usage is governed by the applicable Terms and Conditions & Privacy Policy. Welcome to Kalkine Media Limited website. Your website access and usage is governed by the applicable Terms of Use & Privacy Policy. Welcome to Kalkine Media Limited website. Your website access and usage is governed by the applicable Terms of Use & Privacy Policy. Welcome to Kalkine Media Limited website. Your website access and usage is governed by the applicable Terms of Use & Privacy Policy. Welcome to Kalkine Media Limited website. Your website access and usage is governed by the applicable Terms of Use & Privacy Policy. Welcome to Kalkine Media Limited website. Your website access and usage is governed by the applicable Terms of Use & Privacy Policy. Welcome to Kalkine Media Limited website. Your website access and usage is governed by the applicable Terms of Use & Privacy Policy. Welcome to Kalkine Media Limited website. Your website access and usage is governed by the applicable Terms of Use & Privacy Policy. Welcome to Kalkine Media Limited website. Your website access and usage is governed by the applicable Terms of Use & Privacy Policy. Welcome to Kalkine Media Limited website. Your website access and usage is governed by the applicable Terms of Use & Privacy Policy. Welcome to Kalkine Media Limited website. Your website access and usage is governed by the applicable Terms of Use & Privacy Policy. Welcome to Kalkine Media Limited website. Your website access and usage is governed by the applicable Terms of Use & Privacy Policy. Welcome to Kalkine Media Limited website. Your website access and usage is governed by the applicable Terms of Use & Privacy Policy. Welcome to Kalkine Media Limited website. Your website access and usage is governed by the applicable Terms of Use & Privacy Policy. Welcome to Kalkine Media Limited website. Your website access and usage is governed by the applicable Terms of Use & Privacy Policy. Welcome to Kalkine Media Limited website. Your website access and usage is governed by the applicable Terms of Use & Privacy Policy. Welcome to Kalkine Media Limited website. Your website access and usage is governed by the applicable Terms of Use & Privacy Policy. مرحبًا بكم في موقع Kalkine Media Limited. يخضع الوصول إلى موقع الويب الخاص بك واستخدامه لما هو معمول بهشروط الاستخدام & سياسة الخصوصية. Bienvenue sur le site Web de Kalkine Media Limited. L'accès et l'utilisation de votre site Web sont régis par les Conditions d'utilisation & Politique de confidentialité. Bienvenido al sitio web de Kalkine Media Limited. El acceso y el uso de su sitio web se rigen por los Términos de uso y Política de privacidad. Willkommen auf der Website von Kalkine Media Limited. Der Zugriff und die Nutzung Ihrer Website unterliegen den geltenden Nutzungsbedingungen & Datenschutzerklärung. Willkommen auf der Website von Kalkine Media Limited. Der Zugriff und die Nutzung Ihrer Website unterliegen den geltenden Nutzungsbedingungen & Datenschutzerklärung.",
        "url": "https://kalkinemedia.com/global/tech-corner/technology/driving-transformation-the-road-to-181-billion-the-automotive-advanced-shifter-system-markets-journey-by-2031",
        "image": "https://kalkinemedia.com/resources/assets/public/img/Kalkine_media_logo.png",
        "publish_date": "2023-10-26 15:16:35",
        "author": "EIN Presswire",
        "authors": [
            "EIN Presswire"
        ],
        "language": "en",
        "source_country": "au",
        "sentiment": 1.0
    },
    {
        "id": 153219589,
        "title": "Women on the edge of despair in ‘Ironbound’ and ‘In Two Minds’",
        "text": "In Two Minds, Draíocht; Ironbound, Peacock ​In Two Minds is a play about bipolar disorder, and in portraying the cruelty of it as an illness, not just for the person suffering from it, but for those who love the person and are burdened with their care, it succeeds excellently.",
        "url": "https://www.independent.ie/entertainment/theatre-arts/women-on-the-edge-of-despair-in-ironbound-and-in-two-minds/a2051595534.html",
        "image": "https://focus.independent.ie/thumbor/GiJKcEDxPeQFX9HJF3FbgCH3sY0=/0x0:3238x2159/550x550/prod-mh-ireland/c1547f33-e8f9-4c7e-aa6a-bfd606455dd2/d0a4aab6-7f8f-4997-8afd-094c1606a59a/SF%20In%20Two%20Minds%204.jpg",
        "publish_date": "2023-10-22 18:12:35",
        "author": "Storm Babet",
        "authors": [
            "Storm Babet"
        ],
        "language": "en",
        "source_country": "ie",
        "sentiment": 0.856
    },
    {
        "id": 155790469,
        "title": "Keir Starmer defends position on Israel-Gaza conflict",
        "text": "What is included in my trial? During your trial you will have complete digital access to FT.com with everything in both of our Standard Digital and Premium Digital packages. Standard Digital includes access to a wealth of global news, analysis and expert opinion. Premium Digital includes access to our premier business column, Lex, as well as 15 curated newsletters covering key business themes with original, in-depth reporting. For a full comparison of Standard and Premium Digital, click here. Change the plan you will roll onto at any time during your trial by visiting the “Settings & Account” section. What happens at the end of my trial? you will be auto-enrolled in our premium digital monthly subscription plan and retain complete access for 65 € per month. you can change your plan at any time online in the “Settings & Account” section. If you’d like to retain your premium access and save 20%, you can opt to pay annually at the end of the trial. You may also opt to downgrade to Standard Digital, a robust journalistic offering that fulfils many user’s needs. Compare Standard and Premium Digital here. Any changes made can be done at any time and will become effective at the end of the trial period, allowing you to retain full access for 4 weeks, even if you downgrade or cancel.",
        "url": "https://www.ft.com/content/3ac9d712-817e-409d-af2d-aee937e91e5e",
        "image": "https://d1e00ek4ebabms.cloudfront.net/production/db179368-7273-4826-85b2-2300d1dffce2.jpg",
        "publish_date": "2023-10-31 14:01:03",
        "authors": [],
        "language": "en",
        "source_country": "gb",
        "sentiment": 0.338
    }
]